; ModuleID = 'src/shred.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.Options = type { i8, i64, i64, i32, i8, i8, i8 }
%struct.mtop = type { i16, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.randint_source = type { ptr, i64, i64 }
%struct.randread_source = type { ptr, ptr, ptr, %union.anon.8 }
%union.anon.8 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }

!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1233, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 18)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1250, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 14)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1250, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 12)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1262, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 21)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 3)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !96, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1275, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 2)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "randint_source", scope: !108, file: !2, line: 1169, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !255, line: 33, flags: DIFlagFwdDecl)
!255 = !DIFile(filename: "./lib/randint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "28ec191ae1fe18b14ea27fd20962a86a")
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !124, line: 736, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 75)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !263, file: !124, line: 575, type: !125, isLocal: true, isDefinition: true)
!263 = distinct !DISubprogram(name: "oputs_", scope: !124, file: !124, line: 573, type: !264, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !266)
!264 = !DISubroutineType(cc: DW_CC_nocall, types: !265)
!265 = !{null, !194, !194}
!266 = !{!267, !268, !269, !272, !273, !274, !275, !279, !280, !281, !282, !284, !334, !335, !336, !338, !339}
!267 = !DILocalVariable(name: "program", arg: 1, scope: !263, file: !124, line: 573, type: !194)
!268 = !DILocalVariable(name: "option", arg: 2, scope: !263, file: !124, line: 573, type: !194)
!269 = !DILocalVariable(name: "term", scope: !270, file: !124, line: 585, type: !194)
!270 = distinct !DILexicalBlock(scope: !271, file: !124, line: 582, column: 5)
!271 = distinct !DILexicalBlock(scope: !263, file: !124, line: 581, column: 7)
!272 = !DILocalVariable(name: "double_space", scope: !263, file: !124, line: 594, type: !197)
!273 = !DILocalVariable(name: "first_word", scope: !263, file: !124, line: 595, type: !194)
!274 = !DILocalVariable(name: "option_text", scope: !263, file: !124, line: 596, type: !194)
!275 = !DILocalVariable(name: "s", scope: !276, file: !124, line: 608, type: !194)
!276 = distinct !DILexicalBlock(scope: !277, file: !124, line: 605, column: 5)
!277 = distinct !DILexicalBlock(scope: !278, file: !124, line: 604, column: 12)
!278 = distinct !DILexicalBlock(scope: !263, file: !124, line: 597, column: 7)
!279 = !DILocalVariable(name: "spaces", scope: !276, file: !124, line: 609, type: !191)
!280 = !DILocalVariable(name: "anchor_len", scope: !263, file: !124, line: 620, type: !191)
!281 = !DILocalVariable(name: "desc_text", scope: !263, file: !124, line: 625, type: !194)
!282 = !DILocalVariable(name: "__ptr", scope: !283, file: !124, line: 644, type: !194)
!283 = distinct !DILexicalBlock(scope: !263, file: !124, line: 644, column: 3)
!284 = !DILocalVariable(name: "__stream", scope: !283, file: !124, line: 644, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !287, line: 7, baseType: !288)
!287 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !289, line: 49, size: 1728, elements: !290)
!289 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !306, !308, !309, !310, !311, !312, !314, !315, !318, !320, !323, !326, !327, !328, !329, !330}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !288, file: !289, line: 51, baseType: !125, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !288, file: !289, line: 54, baseType: !189, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !288, file: !289, line: 55, baseType: !189, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !288, file: !289, line: 56, baseType: !189, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !288, file: !289, line: 57, baseType: !189, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !288, file: !289, line: 58, baseType: !189, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !288, file: !289, line: 59, baseType: !189, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !288, file: !289, line: 60, baseType: !189, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !288, file: !289, line: 61, baseType: !189, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !288, file: !289, line: 64, baseType: !189, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !288, file: !289, line: 65, baseType: !189, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !288, file: !289, line: 66, baseType: !189, size: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !288, file: !289, line: 68, baseType: !304, size: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !289, line: 36, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !288, file: !289, line: 70, baseType: !307, size: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !288, file: !289, line: 72, baseType: !125, size: 32, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !288, file: !289, line: 73, baseType: !125, size: 32, offset: 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !288, file: !289, line: 74, baseType: !186, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !288, file: !289, line: 77, baseType: !190, size: 16, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !288, file: !289, line: 78, baseType: !313, size: 8, offset: 1040)
!313 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !288, file: !289, line: 79, baseType: !91, size: 8, offset: 1048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !288, file: !289, line: 81, baseType: !316, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !289, line: 43, baseType: null)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !288, file: !289, line: 89, baseType: !319, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !187, line: 153, baseType: !188)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !288, file: !289, line: 91, baseType: !321, size: 64, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !289, line: 37, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !288, file: !289, line: 92, baseType: !324, size: 64, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !289, line: 38, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !288, file: !289, line: 93, baseType: !307, size: 64, offset: 1344)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !288, file: !289, line: 94, baseType: !181, size: 64, offset: 1408)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !288, file: !289, line: 95, baseType: !191, size: 64, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !288, file: !289, line: 96, baseType: !125, size: 32, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !288, file: !289, line: 98, baseType: !331, size: 160, offset: 1568)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 20)
!334 = !DILocalVariable(name: "__cnt", scope: !283, file: !124, line: 644, type: !191)
!335 = !DILocalVariable(name: "url_program", scope: !263, file: !124, line: 648, type: !194)
!336 = !DILocalVariable(name: "__ptr", scope: !337, file: !124, line: 686, type: !194)
!337 = distinct !DILexicalBlock(scope: !263, file: !124, line: 686, column: 3)
!338 = !DILocalVariable(name: "__stream", scope: !337, file: !124, line: 686, type: !285)
!339 = !DILocalVariable(name: "__cnt", scope: !337, file: !124, line: 686, type: !191)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !124, line: 585, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 5)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !124, line: 586, type: !342, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !124, line: 595, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 4)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !124, line: 620, type: !21, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !248, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !342, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !349, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !241, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !124, line: 650, type: !342, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !21, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !21, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !124, line: 652, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 7)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !124, line: 653, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !124, line: 654, type: !96, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !124, line: 655, type: !96, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !124, line: 656, type: !96, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !124, line: 657, type: !96, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !124, line: 663, type: !370, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !124, line: 664, type: !96, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 17)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 40)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 15)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 61)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !124, line: 679, type: !241, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !124, line: 683, type: !342, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !124, line: 688, type: !342, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !124, line: 691, type: !375, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !124, line: 839, type: !216, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !124, line: 840, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 22)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !124, line: 841, type: !402, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !124, line: 862, type: !349, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !124, line: 868, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 71)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !124, line: 875, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 27)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 51)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !231, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !21, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 151, type: !21, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 11)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !342, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !226, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 155, type: !370, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !375, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !342, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !342, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !375, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "remove_methods", scope: !108, file: !2, line: 125, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 96, elements: !242)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !370, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !342, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !211, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "remove_args", scope: !108, file: !2, line: 120, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 256, elements: !350)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 984, type: !392, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 989, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 45)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !392, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 864, type: !422, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 869, type: !436, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !236, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "patterns", scope: !108, file: !2, line: 697, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 1760, elements: !502)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!502 = !{!503}
!503 = !DISubrange(count: 55)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !221, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 476, type: !201, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 525, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 32)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !392, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 558, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 19)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !436, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 35)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 13)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !370, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !236, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !392, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !9, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1159, type: !331, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1071, type: !529, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1095, type: !221, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1105, type: !236, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1109, type: !231, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "nameset", scope: !108, file: !2, line: 998, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 520, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 65)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 2816, elements: !453)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !558, line: 50, size: 256, elements: !559)
!558 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!559 = !{!560, !561, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !558, line: 52, baseType: !194, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !557, file: !558, line: 55, baseType: !125, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !558, line: 56, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !557, file: !558, line: 57, baseType: !125, size: 32, offset: 192)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !567, line: 3, type: !402, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "Version", scope: !570, file: !567, line: 3, type: !194, isLocal: false, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C11, file: !567, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !571, splitDebugInlining: false, nameTableKind: None)
!571 = !{!565, !568}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !574, file: !575, line: 65, type: !594, isLocal: false, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C11, file: !575, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !577, globals: !578, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!576 = !{!129}
!577 = !{!181, !194, !196}
!578 = !{!572, !579, !581, !583, !588, !590, !592}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !575, line: 141, type: !370, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !575, line: 141, type: !436, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !575, line: 142, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 29)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !575, line: 160, type: !236, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !575, line: 165, type: !375, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !575, line: 170, type: !342, isLocal: true, isDefinition: true)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !595, line: 69, baseType: !596)
!595 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "file_name", scope: !601, file: !602, line: 45, type: !194, isLocal: true, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C11, file: !602, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !603, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!603 = !{!604, !606, !608, !610, !599, !612}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !602, line: 121, type: !370, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !602, line: 121, type: !231, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !602, line: 123, type: !370, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !602, line: 126, type: !241, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !601, file: !602, line: 55, type: !197, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !616, file: !617, line: 66, type: !596, isLocal: false, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C11, file: !617, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !618, globals: !619, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!618 = !{!181, !196}
!619 = !{!620, !622, !646, !648, !650, !652, !614, !654, !656, !658, !660, !662}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !617, line: 272, type: !342, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "old_file_name", scope: !624, file: !617, line: 304, type: !194, isLocal: true, isDefinition: true)
!624 = distinct !DISubprogram(name: "verror_at_line", scope: !617, file: !617, line: 298, type: !625, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !616, retainedNodes: !639)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !125, !125, !194, !111, !194, !627}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !185, line: 52, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !629, line: 14, baseType: !630)
!629 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !631, baseType: !632)
!631 = !DIFile(filename: "lib/error.c", directory: "/src")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !633)
!633 = !{!634, !635, !636, !637, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !632, file: !631, baseType: !181, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !632, file: !631, baseType: !181, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !632, file: !631, baseType: !181, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !632, file: !631, baseType: !125, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !632, file: !631, baseType: !125, size: 32, offset: 224)
!639 = !{!640, !641, !642, !643, !644, !645}
!640 = !DILocalVariable(name: "status", arg: 1, scope: !624, file: !617, line: 298, type: !125)
!641 = !DILocalVariable(name: "errnum", arg: 2, scope: !624, file: !617, line: 298, type: !125)
!642 = !DILocalVariable(name: "file_name", arg: 3, scope: !624, file: !617, line: 298, type: !194)
!643 = !DILocalVariable(name: "line_number", arg: 4, scope: !624, file: !617, line: 298, type: !111)
!644 = !DILocalVariable(name: "message", arg: 5, scope: !624, file: !617, line: 298, type: !194)
!645 = !DILocalVariable(name: "args", arg: 6, scope: !624, file: !617, line: 298, type: !627)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "old_line_number", scope: !624, file: !617, line: 305, type: !111, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !617, line: 338, type: !349, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !617, line: 346, type: !375, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !617, line: 346, type: !248, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "error_message_count", scope: !616, file: !617, line: 69, type: !111, isLocal: false, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !616, file: !617, line: 295, type: !125, isLocal: false, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !617, line: 208, type: !370, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !617, line: 208, type: !236, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !617, line: 214, type: !342, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !666, file: !667, line: 506, type: !125, isLocal: true, isDefinition: true)
!666 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !667, file: !667, line: 485, type: !668, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !670, retainedNodes: !672)
!667 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!668 = !DISubroutineType(types: !669)
!669 = !{!125, !125, !125}
!670 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !671, splitDebugInlining: false, nameTableKind: None)
!671 = !{!664}
!672 = !{!673, !674, !675, !676, !679}
!673 = !DILocalVariable(name: "fd", arg: 1, scope: !666, file: !667, line: 485, type: !125)
!674 = !DILocalVariable(name: "target", arg: 2, scope: !666, file: !667, line: 485, type: !125)
!675 = !DILocalVariable(name: "result", scope: !666, file: !667, line: 487, type: !125)
!676 = !DILocalVariable(name: "flags", scope: !677, file: !667, line: 530, type: !125)
!677 = distinct !DILexicalBlock(scope: !678, file: !667, line: 529, column: 5)
!678 = distinct !DILexicalBlock(scope: !666, file: !667, line: 528, column: 7)
!679 = !DILocalVariable(name: "saved_errno", scope: !680, file: !667, line: 533, type: !125)
!680 = distinct !DILexicalBlock(scope: !681, file: !667, line: 532, column: 9)
!681 = distinct !DILexicalBlock(scope: !677, file: !667, line: 531, column: 11)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !684, line: 161, type: !248, isLocal: true, isDefinition: true)
!684 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !684, line: 163, type: !91, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !684, line: 233, type: !21, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !684, line: 251, type: !21, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "power_letter", scope: !693, file: !684, line: 36, type: !723, isLocal: true, isDefinition: true)
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !703, globals: !704, splitDebugInlining: false, nameTableKind: None)
!694 = !{!164, !695}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !696, line: 30, baseType: !111, size: 32, elements: !697)
!696 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!697 = !{!698, !699, !700, !701, !702}
!698 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!699 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!700 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!701 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!702 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!703 = !{!182}
!704 = !{!682, !685, !687, !689, !691, !705, !707, !709, !711, !713, !715, !718, !721}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !684, line: 417, type: !452, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !684, line: 418, type: !96, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !684, line: 438, type: !221, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !684, line: 398, type: !402, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !684, line: 398, type: !241, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "block_size_args", scope: !693, file: !684, line: 398, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 192, elements: !242)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !693, file: !684, line: 399, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 64, elements: !249)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !684, line: 408, type: !216, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 88, elements: !453)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "program_name", scope: !726, file: !727, line: 31, type: !194, isLocal: false, isDefinition: true)
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, globals: !729, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!728 = !{!189}
!729 = !{!724, !730, !732}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !727, line: 46, type: !375, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !727, line: 49, type: !349, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "utf07FF", scope: !736, file: !737, line: 46, type: !764, isLocal: true, isDefinition: true)
!736 = distinct !DISubprogram(name: "proper_name_lite", scope: !737, file: !737, line: 38, type: !738, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !740, retainedNodes: !742)
!737 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!738 = !DISubroutineType(types: !739)
!739 = !{!194, !194, !194}
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !741, splitDebugInlining: false, nameTableKind: None)
!741 = !{!734}
!742 = !{!743, !744, !745, !746, !751}
!743 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !736, file: !737, line: 38, type: !194)
!744 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !736, file: !737, line: 38, type: !194)
!745 = !DILocalVariable(name: "translation", scope: !736, file: !737, line: 40, type: !194)
!746 = !DILocalVariable(name: "w", scope: !736, file: !737, line: 47, type: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !748, line: 37, baseType: !749)
!748 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !187, line: 57, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !187, line: 42, baseType: !111)
!751 = !DILocalVariable(name: "mbs", scope: !736, file: !737, line: 48, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !753, line: 6, baseType: !754)
!753 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !755, line: 21, baseType: !756)
!755 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 13, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !756, file: !755, line: 15, baseType: !125, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !756, file: !755, line: 20, baseType: !760, size: 32, offset: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !756, file: !755, line: 16, size: 32, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !760, file: !755, line: 18, baseType: !111, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !760, file: !755, line: 19, baseType: !349, size: 32)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 16, elements: !249)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !767, line: 78, type: !375, isLocal: true, isDefinition: true)
!767 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !767, line: 79, type: !21, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !767, line: 80, type: !529, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !767, line: 81, type: !529, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !767, line: 82, type: !331, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !767, line: 83, type: !248, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !767, line: 84, type: !375, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !767, line: 85, type: !370, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !767, line: 86, type: !370, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !767, line: 87, type: !375, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !788, file: !767, line: 76, type: !860, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !789, retainedTypes: !795, globals: !796, splitDebugInlining: false, nameTableKind: None)
!789 = !{!129, !790, !143}
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !130, line: 254, baseType: !111, size: 32, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!793 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!794 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!795 = !{!125, !190, !191}
!796 = !{!765, !768, !770, !772, !774, !776, !778, !780, !782, !784, !786, !797, !801, !811, !813, !818, !820, !822, !824, !826, !849, !856, !858}
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !788, file: !767, line: 92, type: !799, isLocal: false, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 320, elements: !97)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !788, file: !767, line: 1040, type: !803, isLocal: false, isDefinition: true)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !767, line: 56, size: 448, elements: !804)
!804 = !{!805, !806, !807, !809, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !803, file: !767, line: 59, baseType: !129, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !767, line: 62, baseType: !125, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !803, file: !767, line: 66, baseType: !808, size: 256, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !376)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !803, file: !767, line: 69, baseType: !194, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !803, file: !767, line: 72, baseType: !194, size: 64, offset: 384)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !788, file: !767, line: 107, type: !803, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "slot0", scope: !788, file: !767, line: 831, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 256)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !767, line: 321, type: !248, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !767, line: 357, type: !248, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !767, line: 358, type: !248, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !767, line: 199, type: !370, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quote", scope: !828, file: !767, line: 228, type: !847, isLocal: true, isDefinition: true)
!828 = distinct !DISubprogram(name: "gettext_quote", scope: !767, file: !767, line: 197, type: !829, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{!194, !194, !129}
!831 = !{!832, !833, !834, !835, !836}
!832 = !DILocalVariable(name: "msgid", arg: 1, scope: !828, file: !767, line: 197, type: !194)
!833 = !DILocalVariable(name: "s", arg: 2, scope: !828, file: !767, line: 197, type: !129)
!834 = !DILocalVariable(name: "translation", scope: !828, file: !767, line: 199, type: !194)
!835 = !DILocalVariable(name: "w", scope: !828, file: !767, line: 229, type: !747)
!836 = !DILocalVariable(name: "mbs", scope: !828, file: !767, line: 230, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !753, line: 6, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !755, line: 21, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 13, size: 64, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !839, file: !755, line: 15, baseType: !125, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !839, file: !755, line: 20, baseType: !843, size: 32, offset: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !839, file: !755, line: 16, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !843, file: !755, line: 18, baseType: !111, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !843, file: !755, line: 19, baseType: !349, size: 32)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !848)
!848 = !{!250, !351}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "slotvec", scope: !788, file: !767, line: 834, type: !851, isLocal: true, isDefinition: true)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !767, line: 823, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !852, file: !767, line: 825, baseType: !191, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !852, file: !767, line: 826, baseType: !189, size: 64, offset: 64)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "nslots", scope: !788, file: !767, line: 832, type: !125, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "slotvec0", scope: !788, file: !767, line: 833, type: !852, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 704, elements: !453)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !863, line: 183, type: !241, isLocal: true, isDefinition: true)
!863 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !863, line: 107, type: !529, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !863, line: 107, type: !402, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !863, line: 107, type: !870, isLocal: true, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 272, elements: !207)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !863, line: 108, type: !216, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !863, line: 108, type: !402, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !877, line: 67, type: !231, isLocal: true, isDefinition: true)
!877 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !877, line: 69, type: !370, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !877, line: 83, type: !370, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !877, line: 83, type: !349, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !877, line: 85, type: !248, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !877, line: 88, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 171)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !877, line: 88, type: !206, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !877, line: 105, type: !216, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !877, line: 109, type: !897, isLocal: true, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 23)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !877, line: 113, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 28)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !877, line: 120, type: !510, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !877, line: 127, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 36)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !877, line: 134, type: !397, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !877, line: 142, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 44)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !877, line: 150, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 48)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !877, line: 159, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 52)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !877, line: 170, type: !46, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !877, line: 248, type: !331, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !877, line: 248, type: !422, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !877, line: 254, type: !331, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !877, line: 254, type: !226, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !877, line: 254, type: !397, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !877, line: 259, type: !3, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !877, line: 259, type: !585, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !947, file: !948, line: 26, type: !950, isLocal: false, isDefinition: true)
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !948, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !949, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!949 = !{!945}
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 376, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 47)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "exit_failure", scope: !955, file: !956, line: 24, type: !958, isLocal: false, isDefinition: true)
!955 = distinct !DICompileUnit(language: DW_LANG_C11, file: !956, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !957, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!957 = !{!953}
!958 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !961, line: 34, type: !241, isLocal: true, isDefinition: true)
!961 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !961, line: 34, type: !370, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !961, line: 34, type: !392, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !968, line: 80, type: !370, isLocal: true, isDefinition: true)
!968 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !971, line: 108, type: !91, isLocal: true, isDefinition: true)
!971 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "internal_state", scope: !974, file: !971, line: 97, type: !977, isLocal: true, isDefinition: true)
!974 = distinct !DICompileUnit(language: DW_LANG_C11, file: !971, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !975, globals: !976, splitDebugInlining: false, nameTableKind: None)
!975 = !{!181, !191, !196}
!976 = !{!969, !972}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !753, line: 6, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !755, line: 21, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 13, size: 64, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !979, file: !755, line: 15, baseType: !125, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !979, file: !755, line: 20, baseType: !983, size: 32, offset: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !979, file: !755, line: 16, size: 32, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !983, file: !755, line: 18, baseType: !111, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !983, file: !755, line: 19, baseType: !349, size: 32)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !989, line: 35, type: !248, isLocal: true, isDefinition: true)
!989 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !989, line: 35, type: !21, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !994, line: 202, type: !370, isLocal: true, isDefinition: true)
!994 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !997, file: !994, line: 211, type: !1182, isLocal: true, isDefinition: true)
!997 = distinct !DISubprogram(name: "printf_fetchargs", scope: !994, file: !994, line: 42, type: !998, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1173, retainedNodes: !1177)
!998 = !DISubroutineType(types: !999)
!999 = !{!125, !1000, !1010}
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !629, line: 22, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1002, baseType: !1003)
!1002 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1003, file: !1002, baseType: !181, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1003, file: !1002, baseType: !181, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1003, file: !1002, baseType: !181, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1003, file: !1002, baseType: !125, size: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1003, file: !1002, baseType: !125, size: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1012, line: 185, baseType: !1013)
!1012 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1012, line: 179, size: 1920, elements: !1014)
!1014 = !{!1015, !1016, !1171}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1013, file: !1012, line: 181, baseType: !191, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1013, file: !1012, line: 182, baseType: !1017, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1012, line: 174, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1012, line: 111, size: 256, elements: !1020)
!1020 = !{!1021, !1072}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1019, file: !1012, line: 113, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1012, line: 108, baseType: !1023)
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1012, line: 47, baseType: !111, size: 32, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1025 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1026 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1027 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1028 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1029 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1030 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1031 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1032 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1033 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1034 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1035 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1036 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1037 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1038 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1039 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1040 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1041 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1042 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1043 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1044 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1045 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1046 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1047 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1048 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1049 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1050 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1051 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1052 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1053 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1054 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1055 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1056 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1057 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1058 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1059 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1060 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1061 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1062 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1063 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1064 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1065 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1066 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1067 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1068 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1069 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1070 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1071 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1019, file: !1012, line: 172, baseType: !1073, size: 128, offset: 128)
!1073 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1019, file: !1012, line: 114, size: 128, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1088, !1092, !1096, !1099, !1102, !1105, !1107, !1110, !1113, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1137, !1140, !1141, !1145, !1146, !1148, !1150, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1073, file: !1012, line: 116, baseType: !313, size: 8)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1073, file: !1012, line: 117, baseType: !196, size: 8)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1073, file: !1012, line: 118, baseType: !1078, size: 16)
!1078 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1073, file: !1012, line: 119, baseType: !190, size: 16)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1073, file: !1012, line: 120, baseType: !125, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1073, file: !1012, line: 121, baseType: !111, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1073, file: !1012, line: 122, baseType: !188, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !1073, file: !1012, line: 123, baseType: !193, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !1073, file: !1012, line: 124, baseType: !1085, size: 64)
!1085 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !1073, file: !1012, line: 125, baseType: !1087, size: 64)
!1087 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !1073, file: !1012, line: 126, baseType: !1089, size: 8)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1090, line: 24, baseType: !1091)
!1090 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !187, line: 37, baseType: !313)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !1073, file: !1012, line: 127, baseType: !1093, size: 8)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1094, line: 24, baseType: !1095)
!1094 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !187, line: 38, baseType: !196)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !1073, file: !1012, line: 128, baseType: !1097, size: 16)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1090, line: 25, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !187, line: 39, baseType: !1078)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !1073, file: !1012, line: 129, baseType: !1100, size: 16)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1094, line: 25, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !187, line: 40, baseType: !190)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !1073, file: !1012, line: 130, baseType: !1103, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1090, line: 26, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !187, line: 41, baseType: !125)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !1073, file: !1012, line: 131, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1094, line: 26, baseType: !750)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !1073, file: !1012, line: 132, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1090, line: 27, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 44, baseType: !188)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !1073, file: !1012, line: 133, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1094, line: 27, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !187, line: 45, baseType: !193)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !1073, file: !1012, line: 134, baseType: !1114, size: 8)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !1115, line: 58, baseType: !313)
!1115 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !1073, file: !1012, line: 135, baseType: !1117, size: 8)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !1115, line: 71, baseType: !196)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !1073, file: !1012, line: 136, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !1115, line: 60, baseType: !188)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !1073, file: !1012, line: 137, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !1115, line: 73, baseType: !193)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !1073, file: !1012, line: 138, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !1115, line: 61, baseType: !188)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !1073, file: !1012, line: 139, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !1115, line: 74, baseType: !193)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !1073, file: !1012, line: 140, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !1115, line: 62, baseType: !188)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !1073, file: !1012, line: 141, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !1115, line: 75, baseType: !193)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !1073, file: !1012, line: 142, baseType: !1131, size: 32)
!1131 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !1073, file: !1012, line: 143, baseType: !1133, size: 64)
!1133 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !1073, file: !1012, line: 144, baseType: !1135, size: 128)
!1135 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !1073, file: !1012, line: 145, baseType: !125, size: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !1073, file: !1012, line: 147, baseType: !1138, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1139, line: 20, baseType: !111)
!1139 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !1073, file: !1012, line: 149, baseType: !194, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !1073, file: !1012, line: 150, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !192, line: 74, baseType: !111)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !1073, file: !1012, line: 151, baseType: !181, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !1073, file: !1012, line: 152, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !1073, file: !1012, line: 153, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !1073, file: !1012, line: 154, baseType: !563, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !1073, file: !1012, line: 155, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !1073, file: !1012, line: 156, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !1073, file: !1012, line: 157, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !1073, file: !1012, line: 158, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !1073, file: !1012, line: 159, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !1073, file: !1012, line: 160, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !1073, file: !1012, line: 161, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !1073, file: !1012, line: 162, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !1073, file: !1012, line: 163, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !1073, file: !1012, line: 164, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !1013, file: !1012, line: 183, baseType: !1172, size: 1792, offset: 128)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 1792, elements: !371)
!1173 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1174, retainedTypes: !1175, globals: !1176, splitDebugInlining: false, nameTableKind: None)
!1174 = !{!1023}
!1175 = !{!181}
!1176 = !{!992, !995}
!1177 = !{!1178, !1179, !1180, !1181}
!1178 = !DILocalVariable(name: "args", arg: 1, scope: !997, file: !994, line: 42, type: !1000)
!1179 = !DILocalVariable(name: "a", arg: 2, scope: !997, file: !994, line: 42, type: !1010)
!1180 = !DILocalVariable(name: "i", scope: !997, file: !994, line: 44, type: !191)
!1181 = !DILocalVariable(name: "ap", scope: !997, file: !994, line: 45, type: !1017)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 224, elements: !371)
!1183 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1184, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, splitDebugInlining: false, nameTableKind: None)
!1184 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1185 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1186, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1186 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!1187 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1188, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1188 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!1189 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1190, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1190 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!1191 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1192, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1192 = !DIFile(filename: "lib/gethrxtime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2abae07bd356ebe51c13e20c33e0c4bf")
!1193 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1194, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1194 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1195 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1196, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1196 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!1197 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1198, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1198 = !DIFile(filename: "lib/randint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "11f435a81221ba750eb474b22ae06eb8")
!1199 = distinct !DICompileUnit(language: DW_LANG_C11, file: !863, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1200, globals: !1201, splitDebugInlining: false, nameTableKind: None)
!1200 = !{!191}
!1201 = !{!861, !864, !866, !868, !871, !873}
!1202 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1203, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1204, retainedTypes: !1257, splitDebugInlining: false, nameTableKind: None)
!1203 = !DIFile(filename: "lib/rand-isaac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d44161d8d093b6cf59f0cc9f71c527c2")
!1204 = !{!1205}
!1205 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1206, file: !1203, line: 100, baseType: !111, size: 32, elements: !1255)
!1206 = distinct !DISubprogram(name: "isaac_refill", scope: !1203, file: !1203, line: 90, type: !1207, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1202, retainedNodes: !1222)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1209, !1221}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !1211, line: 56, size: 16576, elements: !1212)
!1211 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4c70774edc5c86c3b7f59097e965130e")
!1212 = !{!1213, !1218, !1219, !1220}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1210, file: !1211, line: 58, baseType: !1214, size: 16384)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 16384, elements: !816)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !1211, line: 44, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !1115, line: 52, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !187, line: 59, baseType: !1112)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1210, file: !1211, line: 59, baseType: !1215, size: 64, offset: 16384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1210, file: !1211, line: 59, baseType: !1215, size: 64, offset: 16448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1210, file: !1211, line: 59, baseType: !1215, size: 64, offset: 16512)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1232, !1233, !1235, !1236, !1238, !1239, !1241, !1242, !1245, !1246, !1248, !1249, !1251, !1252, !1254}
!1223 = !DILocalVariable(name: "s", arg: 1, scope: !1206, file: !1203, line: 90, type: !1209)
!1224 = !DILocalVariable(name: "result", arg: 2, scope: !1206, file: !1203, line: 90, type: !1221)
!1225 = !DILocalVariable(name: "a", scope: !1206, file: !1203, line: 93, type: !1215)
!1226 = !DILocalVariable(name: "b", scope: !1206, file: !1203, line: 94, type: !1215)
!1227 = !DILocalVariable(name: "m", scope: !1206, file: !1203, line: 97, type: !1221)
!1228 = !DILocalVariable(name: "r", scope: !1206, file: !1203, line: 98, type: !1221)
!1229 = !DILocalVariable(name: "x", scope: !1230, file: !1203, line: 118, type: !1215)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !1203, line: 118, column: 7)
!1231 = distinct !DILexicalBlock(scope: !1206, file: !1203, line: 117, column: 5)
!1232 = !DILocalVariable(name: "y", scope: !1230, file: !1203, line: 118, type: !1215)
!1233 = !DILocalVariable(name: "x", scope: !1234, file: !1203, line: 119, type: !1215)
!1234 = distinct !DILexicalBlock(scope: !1231, file: !1203, line: 119, column: 7)
!1235 = !DILocalVariable(name: "y", scope: !1234, file: !1203, line: 119, type: !1215)
!1236 = !DILocalVariable(name: "x", scope: !1237, file: !1203, line: 120, type: !1215)
!1237 = distinct !DILexicalBlock(scope: !1231, file: !1203, line: 120, column: 7)
!1238 = !DILocalVariable(name: "y", scope: !1237, file: !1203, line: 120, type: !1215)
!1239 = !DILocalVariable(name: "x", scope: !1240, file: !1203, line: 121, type: !1215)
!1240 = distinct !DILexicalBlock(scope: !1231, file: !1203, line: 121, column: 7)
!1241 = !DILocalVariable(name: "y", scope: !1240, file: !1203, line: 121, type: !1215)
!1242 = !DILocalVariable(name: "x", scope: !1243, file: !1203, line: 128, type: !1215)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !1203, line: 128, column: 7)
!1244 = distinct !DILexicalBlock(scope: !1206, file: !1203, line: 127, column: 5)
!1245 = !DILocalVariable(name: "y", scope: !1243, file: !1203, line: 128, type: !1215)
!1246 = !DILocalVariable(name: "x", scope: !1247, file: !1203, line: 129, type: !1215)
!1247 = distinct !DILexicalBlock(scope: !1244, file: !1203, line: 129, column: 7)
!1248 = !DILocalVariable(name: "y", scope: !1247, file: !1203, line: 129, type: !1215)
!1249 = !DILocalVariable(name: "x", scope: !1250, file: !1203, line: 130, type: !1215)
!1250 = distinct !DILexicalBlock(scope: !1244, file: !1203, line: 130, column: 7)
!1251 = !DILocalVariable(name: "y", scope: !1250, file: !1203, line: 130, type: !1215)
!1252 = !DILocalVariable(name: "x", scope: !1253, file: !1203, line: 131, type: !1215)
!1253 = distinct !DILexicalBlock(scope: !1244, file: !1203, line: 131, column: 7)
!1254 = !DILocalVariable(name: "y", scope: !1253, file: !1203, line: 131, type: !1215)
!1255 = !{!1256}
!1256 = !DIEnumerator(name: "HALF", value: 128)
!1257 = !{!1215}
