; ModuleID = 'src/shuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.linebuffer = type { i64, i64, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.randint_source = type { ptr, i64, i64 }
%struct.randread_source = type { ptr, ptr, ptr, %union.anon.6 }
%union.anon.6 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 33)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 503, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 17)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 528, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !212, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 530, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 3)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 556, type: !71, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 11)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 577, type: !212, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 19)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !98, line: 729, type: !34, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !98, line: 736, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 75)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !245, file: !98, line: 575, type: !99, isLocal: true, isDefinition: true)
!245 = distinct !DISubprogram(name: "oputs_", scope: !98, file: !98, line: 573, type: !246, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !248)
!246 = !DISubroutineType(cc: DW_CC_nocall, types: !247)
!247 = !{null, !151, !151}
!248 = !{!249, !250, !251, !254, !256, !257, !258, !262, !263, !264, !265, !267, !314, !315, !316, !318, !319}
!249 = !DILocalVariable(name: "program", arg: 1, scope: !245, file: !98, line: 573, type: !151)
!250 = !DILocalVariable(name: "option", arg: 2, scope: !245, file: !98, line: 573, type: !151)
!251 = !DILocalVariable(name: "term", scope: !252, file: !98, line: 585, type: !151)
!252 = distinct !DILexicalBlock(scope: !253, file: !98, line: 582, column: 5)
!253 = distinct !DILexicalBlock(scope: !245, file: !98, line: 581, column: 7)
!254 = !DILocalVariable(name: "double_space", scope: !245, file: !98, line: 594, type: !255)
!255 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!256 = !DILocalVariable(name: "first_word", scope: !245, file: !98, line: 595, type: !151)
!257 = !DILocalVariable(name: "option_text", scope: !245, file: !98, line: 596, type: !151)
!258 = !DILocalVariable(name: "s", scope: !259, file: !98, line: 608, type: !151)
!259 = distinct !DILexicalBlock(scope: !260, file: !98, line: 605, column: 5)
!260 = distinct !DILexicalBlock(scope: !261, file: !98, line: 604, column: 12)
!261 = distinct !DILexicalBlock(scope: !245, file: !98, line: 597, column: 7)
!262 = !DILocalVariable(name: "spaces", scope: !259, file: !98, line: 609, type: !148)
!263 = !DILocalVariable(name: "anchor_len", scope: !245, file: !98, line: 620, type: !148)
!264 = !DILocalVariable(name: "desc_text", scope: !245, file: !98, line: 625, type: !151)
!265 = !DILocalVariable(name: "__ptr", scope: !266, file: !98, line: 644, type: !151)
!266 = distinct !DILexicalBlock(scope: !245, file: !98, line: 644, column: 3)
!267 = !DILocalVariable(name: "__stream", scope: !266, file: !98, line: 644, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !270, line: 7, baseType: !271)
!270 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, elements: !273)
!272 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !291, !292, !293, !294, !295, !297, !298, !301, !303, !306, !309, !310, !311, !312, !313}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !271, file: !272, line: 51, baseType: !99, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !271, file: !272, line: 54, baseType: !145, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !271, file: !272, line: 55, baseType: !145, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !271, file: !272, line: 56, baseType: !145, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !271, file: !272, line: 57, baseType: !145, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !271, file: !272, line: 58, baseType: !145, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !271, file: !272, line: 59, baseType: !145, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !271, file: !272, line: 60, baseType: !145, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !271, file: !272, line: 61, baseType: !145, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !271, file: !272, line: 64, baseType: !145, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !271, file: !272, line: 65, baseType: !145, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !271, file: !272, line: 66, baseType: !145, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !271, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !272, line: 36, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !271, file: !272, line: 70, baseType: !290, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !271, file: !272, line: 72, baseType: !99, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !271, file: !272, line: 73, baseType: !99, size: 32, offset: 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !271, file: !272, line: 74, baseType: !156, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !271, file: !272, line: 77, baseType: !147, size: 16, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !271, file: !272, line: 78, baseType: !296, size: 8, offset: 1040)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !271, file: !272, line: 79, baseType: !66, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !271, file: !272, line: 81, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !272, line: 43, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !271, file: !272, line: 89, baseType: !302, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !157, line: 153, baseType: !158)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !271, file: !272, line: 91, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !272, line: 37, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !271, file: !272, line: 92, baseType: !307, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !272, line: 38, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !271, file: !272, line: 93, baseType: !290, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !271, file: !272, line: 94, baseType: !146, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !271, file: !272, line: 95, baseType: !148, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !271, file: !272, line: 96, baseType: !99, size: 32, offset: 1536)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !271, file: !272, line: 98, baseType: !172, size: 160, offset: 1568)
!314 = !DILocalVariable(name: "__cnt", scope: !266, file: !98, line: 644, type: !148)
!315 = !DILocalVariable(name: "url_program", scope: !245, file: !98, line: 648, type: !151)
!316 = !DILocalVariable(name: "__ptr", scope: !317, file: !98, line: 686, type: !151)
!317 = distinct !DILexicalBlock(scope: !245, file: !98, line: 686, column: 3)
!318 = !DILocalVariable(name: "__stream", scope: !317, file: !98, line: 686, type: !268)
!319 = !DILocalVariable(name: "__cnt", scope: !317, file: !98, line: 686, type: !148)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !98, line: 585, type: !19, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !98, line: 586, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !98, line: 595, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !98, line: 620, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 6)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !212, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !98, line: 648, type: !19, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !326, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !98, line: 649, type: !219, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !98, line: 650, type: !19, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !98, line: 651, type: !331, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !98, line: 652, type: !167, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !98, line: 653, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !98, line: 654, type: !71, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !98, line: 655, type: !71, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !98, line: 656, type: !71, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !98, line: 657, type: !71, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !98, line: 663, type: !167, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !98, line: 664, type: !71, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !207, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !98, line: 669, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 40)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 15)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !98, line: 676, type: !24, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !98, line: 679, type: !219, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !98, line: 683, type: !19, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !98, line: 688, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !98, line: 691, type: !352, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !98, line: 839, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 16)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !98, line: 840, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 22)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !98, line: 841, type: !376, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !98, line: 862, type: !326, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !98, line: 868, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 71)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !98, line: 875, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 27)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 51)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !98, line: 877, type: !197, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !19, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !197, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !226, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !167, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !192, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !167, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !391, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !352, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 21)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !98, line: 952, type: !197, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2560, elements: !72)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !448, line: 50, size: 256, elements: !449)
!448 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!449 = !{!450, !451, !452, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !448, line: 52, baseType: !151, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !447, file: !448, line: 55, baseType: !99, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 56, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !448, line: 57, baseType: !99, size: 32, offset: 192)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !457, line: 3, type: !376, isLocal: true, isDefinition: true)
!457 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "Version", scope: !460, file: !457, line: 3, type: !151, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!461 = !{!455, !458}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "file_name", scope: !464, file: !465, line: 45, type: !151, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!466 = !{!467, !469, !471, !473, !462, !475}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !167, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !197, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !167, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 126, type: !219, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !464, file: !465, line: 55, type: !255, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !528, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!146, !153}
!482 = !{!483, !485, !510, !512, !514, !516, !477, !518, !520, !522, !524, !526}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 272, type: !19, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "old_file_name", scope: !487, file: !480, line: 304, type: !151, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !488, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !503)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !99, !99, !151, !87, !151, !490}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !491, line: 52, baseType: !492)
!491 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !493, line: 14, baseType: !494)
!493 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !495, baseType: !496)
!495 = !DIFile(filename: "lib/error.c", directory: "/src")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !496, file: !495, baseType: !146, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !496, file: !495, baseType: !146, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !496, file: !495, baseType: !146, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !496, file: !495, baseType: !99, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !496, file: !495, baseType: !99, size: 32, offset: 224)
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DILocalVariable(name: "status", arg: 1, scope: !487, file: !480, line: 298, type: !99)
!505 = !DILocalVariable(name: "errnum", arg: 2, scope: !487, file: !480, line: 298, type: !99)
!506 = !DILocalVariable(name: "file_name", arg: 3, scope: !487, file: !480, line: 298, type: !151)
!507 = !DILocalVariable(name: "line_number", arg: 4, scope: !487, file: !480, line: 298, type: !87)
!508 = !DILocalVariable(name: "message", arg: 5, scope: !487, file: !480, line: 298, type: !151)
!509 = !DILocalVariable(name: "args", arg: 6, scope: !487, file: !480, line: 298, type: !490)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "old_line_number", scope: !487, file: !480, line: 305, type: !87, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !480, line: 338, type: !326, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !352, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !212, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !87, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !99, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !167, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !440, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !480, line: 214, type: !19, isLocal: true, isDefinition: true)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !533, line: 40, type: !71, isLocal: true, isDefinition: true)
!533 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "program_name", scope: !536, file: !537, line: 31, type: !151, isLocal: false, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C11, file: !537, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !538, globals: !539, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!538 = !{!145}
!539 = !{!534, !540, !542}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !537, line: 46, type: !352, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !537, line: 49, type: !326, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "utf07FF", scope: !546, file: !547, line: 46, type: !574, isLocal: true, isDefinition: true)
!546 = distinct !DISubprogram(name: "proper_name_lite", scope: !547, file: !547, line: 38, type: !548, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !550, retainedNodes: !552)
!547 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!548 = !DISubroutineType(types: !549)
!549 = !{!151, !151, !151}
!550 = distinct !DICompileUnit(language: DW_LANG_C11, file: !547, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !551, splitDebugInlining: false, nameTableKind: None)
!551 = !{!544}
!552 = !{!553, !554, !555, !556, !561}
!553 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !546, file: !547, line: 38, type: !151)
!554 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !546, file: !547, line: 38, type: !151)
!555 = !DILocalVariable(name: "translation", scope: !546, file: !547, line: 40, type: !151)
!556 = !DILocalVariable(name: "w", scope: !546, file: !547, line: 47, type: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !558, line: 37, baseType: !559)
!558 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !157, line: 57, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !157, line: 42, baseType: !87)
!561 = !DILocalVariable(name: "mbs", scope: !546, file: !547, line: 48, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !563, line: 6, baseType: !564)
!563 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !565, line: 21, baseType: !566)
!565 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 13, size: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !566, file: !565, line: 15, baseType: !99, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !566, file: !565, line: 20, baseType: !570, size: 32, offset: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !565, line: 16, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !570, file: !565, line: 18, baseType: !87, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !570, file: !565, line: 19, baseType: !326, size: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !213)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !577, line: 78, type: !352, isLocal: true, isDefinition: true)
!577 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !577, line: 79, type: !331, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !577, line: 80, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 13)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !577, line: 81, type: !582, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !577, line: 82, type: !172, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !577, line: 83, type: !212, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !577, line: 84, type: !352, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !577, line: 85, type: !167, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !577, line: 86, type: !167, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !577, line: 87, type: !352, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !601, file: !577, line: 76, type: !673, isLocal: false, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C11, file: !577, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, retainedTypes: !608, globals: !609, splitDebugInlining: false, nameTableKind: None)
!602 = !{!103, !603, !129}
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !104, line: 254, baseType: !87, size: 32, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!606 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!607 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!608 = !{!99, !147, !148}
!609 = !{!575, !578, !580, !585, !587, !589, !591, !593, !595, !597, !599, !610, !614, !624, !626, !631, !633, !635, !637, !639, !662, !669, !671}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !601, file: !577, line: 92, type: !612, isLocal: false, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 320, elements: !72)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !601, file: !577, line: 1040, type: !616, isLocal: false, isDefinition: true)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !577, line: 56, size: 448, elements: !617)
!617 = !{!618, !619, !620, !622, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !616, file: !577, line: 59, baseType: !103, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !616, file: !577, line: 62, baseType: !99, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !616, file: !577, line: 66, baseType: !621, size: 256, offset: 64)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !353)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !616, file: !577, line: 69, baseType: !151, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !616, file: !577, line: 72, baseType: !151, size: 64, offset: 384)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !601, file: !577, line: 107, type: !616, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "slot0", scope: !601, file: !577, line: 831, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 256)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !577, line: 321, type: !212, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !577, line: 357, type: !212, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !577, line: 358, type: !212, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !577, line: 199, type: !167, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "quote", scope: !641, file: !577, line: 228, type: !660, isLocal: true, isDefinition: true)
!641 = distinct !DISubprogram(name: "gettext_quote", scope: !577, file: !577, line: 197, type: !642, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !601, retainedNodes: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{!151, !151, !103}
!644 = !{!645, !646, !647, !648, !649}
!645 = !DILocalVariable(name: "msgid", arg: 1, scope: !641, file: !577, line: 197, type: !151)
!646 = !DILocalVariable(name: "s", arg: 2, scope: !641, file: !577, line: 197, type: !103)
!647 = !DILocalVariable(name: "translation", scope: !641, file: !577, line: 199, type: !151)
!648 = !DILocalVariable(name: "w", scope: !641, file: !577, line: 229, type: !557)
!649 = !DILocalVariable(name: "mbs", scope: !641, file: !577, line: 230, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !563, line: 6, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !565, line: 21, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 13, size: 64, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !652, file: !565, line: 15, baseType: !99, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !652, file: !565, line: 20, baseType: !656, size: 32, offset: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !565, line: 16, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !656, file: !565, line: 18, baseType: !87, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !656, file: !565, line: 19, baseType: !326, size: 32)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !661)
!661 = !{!214, !328}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "slotvec", scope: !601, file: !577, line: 834, type: !664, isLocal: true, isDefinition: true)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !577, line: 823, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !577, line: 825, baseType: !148, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !665, file: !577, line: 826, baseType: !145, size: 64, offset: 64)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "nslots", scope: !601, file: !577, line: 832, type: !99, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "slotvec0", scope: !601, file: !577, line: 833, type: !665, isLocal: true, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 704, elements: !227)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !677, line: 183, type: !219, isLocal: true, isDefinition: true)
!677 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !677, line: 107, type: !582, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !677, line: 107, type: !376, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !677, line: 107, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 272, elements: !188)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !677, line: 108, type: !391, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !677, line: 108, type: !376, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !691, line: 192, type: !326, isLocal: true, isDefinition: true)
!691 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !691, line: 192, type: !219, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !696, line: 67, type: !197, isLocal: true, isDefinition: true)
!696 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !696, line: 69, type: !167, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !696, line: 83, type: !167, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !696, line: 83, type: !326, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !696, line: 85, type: !212, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !696, line: 88, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 171)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !696, line: 88, type: !187, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !696, line: 105, type: !391, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !696, line: 109, type: !177, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !696, line: 113, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 28)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !696, line: 120, type: !182, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !696, line: 127, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 36)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !696, line: 134, type: !371, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !696, line: 142, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 44)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !696, line: 150, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 48)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !696, line: 159, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 52)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !696, line: 170, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 60)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !696, line: 248, type: !172, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !696, line: 248, type: !396, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !696, line: 254, type: !172, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !696, line: 254, type: !192, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !696, line: 254, type: !371, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !696, line: 259, type: !3, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !696, line: 259, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 29)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !769, file: !770, line: 26, type: !772, isLocal: false, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !771, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!771 = !{!767}
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 47)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "exit_failure", scope: !777, file: !778, line: 24, type: !780, isLocal: false, isDefinition: true)
!777 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!779 = !{!775}
!780 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !219, isLocal: true, isDefinition: true)
!783 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !167, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !783, line: 34, type: !207, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !790, line: 226, type: !76, isLocal: true, isDefinition: true)
!790 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !790, line: 227, type: !76, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !790, line: 228, type: !202, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !790, line: 231, type: !76, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "default_tuning", scope: !799, file: !790, line: 134, type: !803, isLocal: true, isDefinition: true)
!799 = distinct !DICompileUnit(language: DW_LANG_C11, file: !790, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !800, globals: !802, splitDebugInlining: false, nameTableKind: None)
!800 = !{!150, !146, !801, !148}
!801 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!802 = !{!788, !791, !793, !795, !797}
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !805, line: 52, baseType: !806)
!805 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !805, line: 40, size: 160, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !806, file: !805, line: 45, baseType: !801, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !806, file: !805, line: 46, baseType: !801, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !806, file: !805, line: 47, baseType: !801, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !806, file: !805, line: 48, baseType: !801, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !806, file: !805, line: 49, baseType: !255, size: 8, offset: 128)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !815, line: 108, type: !66, isLocal: true, isDefinition: true)
!815 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "internal_state", scope: !818, file: !815, line: 97, type: !821, isLocal: true, isDefinition: true)
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, globals: !820, splitDebugInlining: false, nameTableKind: None)
!819 = !{!146, !148, !153}
!820 = !{!813, !816}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !563, line: 6, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !565, line: 21, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 13, size: 64, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !823, file: !565, line: 15, baseType: !99, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !823, file: !565, line: 20, baseType: !827, size: 32, offset: 32)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !823, file: !565, line: 16, size: 32, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !827, file: !565, line: 18, baseType: !87, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !827, file: !565, line: 19, baseType: !326, size: 32)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !833, file: !834, line: 506, type: !99, isLocal: true, isDefinition: true)
!833 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !834, file: !834, line: 485, type: !835, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !837, retainedNodes: !839)
!834 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!835 = !DISubroutineType(types: !836)
!836 = !{!99, !99, !99}
!837 = distinct !DICompileUnit(language: DW_LANG_C11, file: !834, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !838, splitDebugInlining: false, nameTableKind: None)
!838 = !{!831}
!839 = !{!840, !841, !842, !843, !846}
!840 = !DILocalVariable(name: "fd", arg: 1, scope: !833, file: !834, line: 485, type: !99)
!841 = !DILocalVariable(name: "target", arg: 2, scope: !833, file: !834, line: 485, type: !99)
!842 = !DILocalVariable(name: "result", scope: !833, file: !834, line: 487, type: !99)
!843 = !DILocalVariable(name: "flags", scope: !844, file: !834, line: 530, type: !99)
!844 = distinct !DILexicalBlock(scope: !845, file: !834, line: 529, column: 5)
!845 = distinct !DILexicalBlock(scope: !833, file: !834, line: 528, column: 7)
!846 = !DILocalVariable(name: "saved_errno", scope: !847, file: !834, line: 533, type: !99)
!847 = distinct !DILexicalBlock(scope: !848, file: !834, line: 532, column: 9)
!848 = distinct !DILexicalBlock(scope: !844, file: !834, line: 531, column: 11)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !851, line: 35, type: !212, isLocal: true, isDefinition: true)
!851 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !851, line: 35, type: !331, isLocal: true, isDefinition: true)
!854 = distinct !DICompileUnit(language: DW_LANG_C11, file: !855, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!856 = !{!117}
!857 = distinct !DICompileUnit(language: DW_LANG_C11, file: !858, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!859 = distinct !DICompileUnit(language: DW_LANG_C11, file: !860, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!861 = !{!146}
!862 = distinct !DICompileUnit(language: DW_LANG_C11, file: !863, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!864 = distinct !DICompileUnit(language: DW_LANG_C11, file: !533, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !865, splitDebugInlining: false, nameTableKind: None)
!865 = !{!531}
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!868 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!870 = distinct !DICompileUnit(language: DW_LANG_C11, file: !871, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !872, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !874, line: 102, baseType: !875)
!874 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !157, line: 73, baseType: !150)
!876 = distinct !DICompileUnit(language: DW_LANG_C11, file: !877, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !878, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!880 = distinct !DICompileUnit(language: DW_LANG_C11, file: !881, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "lib/randint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "11f435a81221ba750eb474b22ae06eb8")
!882 = distinct !DICompileUnit(language: DW_LANG_C11, file: !883, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !884, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/randperm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "40d9ef006b04474ffd3ed51e1e91ea2b")
!884 = !{!255, !150, !146}
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !677, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !886, globals: !887, splitDebugInlining: false, nameTableKind: None)
!886 = !{!148}
!887 = !{!675, !678, !680, !682, !685, !687}
!888 = distinct !DICompileUnit(language: DW_LANG_C11, file: !889, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !890, retainedTypes: !944, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "lib/rand-isaac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d44161d8d093b6cf59f0cc9f71c527c2")
!890 = !{!891}
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !892, file: !889, line: 100, baseType: !87, size: 32, elements: !942)
!892 = distinct !DISubprogram(name: "isaac_refill", scope: !889, file: !889, line: 90, type: !893, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !888, retainedNodes: !909)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !895, !908}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !897, line: 56, size: 16576, elements: !898)
!897 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4c70774edc5c86c3b7f59097e965130e")
!898 = !{!899, !905, !906, !907}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !896, file: !897, line: 58, baseType: !900, size: 16384)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 16384, elements: !629)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !897, line: 44, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !874, line: 52, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !157, line: 59, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !157, line: 45, baseType: !150)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !896, file: !897, line: 59, baseType: !901, size: 64, offset: 16384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !896, file: !897, line: 59, baseType: !901, size: 64, offset: 16448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !896, file: !897, line: 59, baseType: !901, size: 64, offset: 16512)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !919, !920, !922, !923, !925, !926, !928, !929, !932, !933, !935, !936, !938, !939, !941}
!910 = !DILocalVariable(name: "s", arg: 1, scope: !892, file: !889, line: 90, type: !895)
!911 = !DILocalVariable(name: "result", arg: 2, scope: !892, file: !889, line: 90, type: !908)
!912 = !DILocalVariable(name: "a", scope: !892, file: !889, line: 93, type: !901)
!913 = !DILocalVariable(name: "b", scope: !892, file: !889, line: 94, type: !901)
!914 = !DILocalVariable(name: "m", scope: !892, file: !889, line: 97, type: !908)
!915 = !DILocalVariable(name: "r", scope: !892, file: !889, line: 98, type: !908)
!916 = !DILocalVariable(name: "x", scope: !917, file: !889, line: 118, type: !901)
!917 = distinct !DILexicalBlock(scope: !918, file: !889, line: 118, column: 7)
!918 = distinct !DILexicalBlock(scope: !892, file: !889, line: 117, column: 5)
!919 = !DILocalVariable(name: "y", scope: !917, file: !889, line: 118, type: !901)
!920 = !DILocalVariable(name: "x", scope: !921, file: !889, line: 119, type: !901)
!921 = distinct !DILexicalBlock(scope: !918, file: !889, line: 119, column: 7)
!922 = !DILocalVariable(name: "y", scope: !921, file: !889, line: 119, type: !901)
!923 = !DILocalVariable(name: "x", scope: !924, file: !889, line: 120, type: !901)
!924 = distinct !DILexicalBlock(scope: !918, file: !889, line: 120, column: 7)
!925 = !DILocalVariable(name: "y", scope: !924, file: !889, line: 120, type: !901)
!926 = !DILocalVariable(name: "x", scope: !927, file: !889, line: 121, type: !901)
!927 = distinct !DILexicalBlock(scope: !918, file: !889, line: 121, column: 7)
!928 = !DILocalVariable(name: "y", scope: !927, file: !889, line: 121, type: !901)
!929 = !DILocalVariable(name: "x", scope: !930, file: !889, line: 128, type: !901)
!930 = distinct !DILexicalBlock(scope: !931, file: !889, line: 128, column: 7)
!931 = distinct !DILexicalBlock(scope: !892, file: !889, line: 127, column: 5)
!932 = !DILocalVariable(name: "y", scope: !930, file: !889, line: 128, type: !901)
!933 = !DILocalVariable(name: "x", scope: !934, file: !889, line: 129, type: !901)
!934 = distinct !DILexicalBlock(scope: !931, file: !889, line: 129, column: 7)
!935 = !DILocalVariable(name: "y", scope: !934, file: !889, line: 129, type: !901)
!936 = !DILocalVariable(name: "x", scope: !937, file: !889, line: 130, type: !901)
!937 = distinct !DILexicalBlock(scope: !931, file: !889, line: 130, column: 7)
!938 = !DILocalVariable(name: "y", scope: !937, file: !889, line: 130, type: !901)
!939 = !DILocalVariable(name: "x", scope: !940, file: !889, line: 131, type: !901)
!940 = distinct !DILexicalBlock(scope: !931, file: !889, line: 131, column: 7)
!941 = !DILocalVariable(name: "y", scope: !940, file: !889, line: 131, type: !901)
!942 = !{!943}
!943 = !DIEnumerator(name: "HALF", value: 128)
!944 = !{!901}
!945 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !946, globals: !947, splitDebugInlining: false, nameTableKind: None)
!946 = !{!146, !150}
!947 = !{!689, !692}
!948 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !949, retainedTypes: !861, globals: !953, splitDebugInlining: false, nameTableKind: None)
!949 = !{!950}
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 40, baseType: !87, size: 32, elements: !951)
!951 = !{!952}
!952 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!953 = !{!694, !697, !699, !701, !703, !705, !710, !712, !714, !716, !721, !723, !728, !730, !735, !740, !745, !750, !752, !754, !756, !758, !760, !762}
!954 = distinct !DICompileUnit(language: DW_LANG_C11, file: !955, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !956, retainedTypes: !987, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!956 = !{!957, !969}
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !958, file: !955, line: 188, baseType: !87, size: 32, elements: !967)
!958 = distinct !DISubprogram(name: "x2nrealloc", scope: !955, file: !955, line: 176, type: !959, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !954, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{!146, !146, !961, !148}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!962 = !{!963, !964, !965, !966}
!963 = !DILocalVariable(name: "p", arg: 1, scope: !958, file: !955, line: 176, type: !146)
!964 = !DILocalVariable(name: "pn", arg: 2, scope: !958, file: !955, line: 176, type: !961)
!965 = !DILocalVariable(name: "s", arg: 3, scope: !958, file: !955, line: 176, type: !148)
!966 = !DILocalVariable(name: "n", scope: !958, file: !955, line: 178, type: !148)
!967 = !{!968}
!968 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !970, file: !955, line: 228, baseType: !87, size: 32, elements: !967)
!970 = distinct !DISubprogram(name: "xpalloc", scope: !955, file: !955, line: 223, type: !971, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !954, retainedNodes: !977)
!971 = !DISubroutineType(types: !972)
!972 = !{!146, !146, !973, !974, !976, !974}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !975, line: 130, baseType: !976)
!975 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !149, line: 35, baseType: !158)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986}
!978 = !DILocalVariable(name: "pa", arg: 1, scope: !970, file: !955, line: 223, type: !146)
!979 = !DILocalVariable(name: "pn", arg: 2, scope: !970, file: !955, line: 223, type: !973)
!980 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !970, file: !955, line: 223, type: !974)
!981 = !DILocalVariable(name: "n_max", arg: 4, scope: !970, file: !955, line: 223, type: !976)
!982 = !DILocalVariable(name: "s", arg: 5, scope: !970, file: !955, line: 223, type: !974)
!983 = !DILocalVariable(name: "n0", scope: !970, file: !955, line: 230, type: !974)
!984 = !DILocalVariable(name: "n", scope: !970, file: !955, line: 237, type: !974)
!985 = !DILocalVariable(name: "nbytes", scope: !970, file: !955, line: 248, type: !974)
!986 = !DILocalVariable(name: "adjusted_nbytes", scope: !970, file: !955, line: 252, type: !974)
!987 = !{!145, !146, !255, !158, !150}
!988 = distinct !DICompileUnit(language: DW_LANG_C11, file: !783, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !989, splitDebugInlining: false, nameTableKind: None)
!989 = !{!781, !784, !786}
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !992, retainedTypes: !993, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!992 = !{!85, !129}
!993 = !{!99, !147, !145, !255, !150, !873}
!994 = distinct !DICompileUnit(language: DW_LANG_C11, file: !995, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!996 = distinct !DICompileUnit(language: DW_LANG_C11, file: !997, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!997 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!998 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1000 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1001, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!1002 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1003, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!1004 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1005, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !884, splitDebugInlining: false, nameTableKind: None)
!1005 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1006 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1007, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1007 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1008 = distinct !DICompileUnit(language: DW_LANG_C11, file: !851, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1009, splitDebugInlining: false, nameTableKind: None)
!1009 = !{!849, !852}
!1010 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1011, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1012 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1013, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!1013 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1014 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1015 = !{i32 7, !"Dwarf Version", i32 5}
!1016 = !{i32 2, !"Debug Info Version", i32 3}
!1017 = !{i32 1, !"wchar_size", i32 4}
!1018 = !{i32 8, !"PIC Level", i32 2}
!1019 = !{i32 7, !"PIE Level", i32 2}
!1020 = !{i32 7, !"uwtable", i32 2}
!1021 = !{i32 7, !"frame-pointer", i32 1}
!1022 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 50, type: !1023, scopeLine: 51, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1025)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{null, !99}
!1025 = !{!1026}
!1026 = !DILocalVariable(name: "status", arg: 1, scope: !1022, file: !2, line: 50, type: !99)
!1027 = !DILocation(line: 0, scope: !1022)
!1028 = !DILocation(line: 52, column: 14, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 52, column: 7)
!1030 = !DILocation(line: 52, column: 7, scope: !1022)
!1031 = !DILocation(line: 53, column: 5, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 53, column: 5)
!1033 = !{!1034, !1034, i64 0}
!1034 = !{!"any pointer", !1035, i64 0}
!1035 = !{!"omnipotent char", !1036, i64 0}
!1036 = !{!"Simple C/C++ TBAA"}
!1037 = !DILocation(line: 56, column: 7, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 55, column: 5)
!1039 = !DILocation(line: 62, column: 7, scope: !1038)
!1040 = !DILocation(line: 729, column: 3, scope: !1041, inlinedAt: !1043)
!1041 = distinct !DISubprogram(name: "emit_stdin_note", scope: !98, file: !98, line: 727, type: !529, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1042)
!1042 = !{}
!1043 = distinct !DILocation(line: 66, column: 7, scope: !1038)
!1044 = !DILocation(line: 736, column: 3, scope: !1045, inlinedAt: !1046)
!1045 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !98, file: !98, line: 734, type: !529, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1042)
!1046 = distinct !DILocation(line: 67, column: 7, scope: !1038)
!1047 = !DILocation(line: 69, column: 7, scope: !1038)
!1048 = !DILocation(line: 72, column: 7, scope: !1038)
!1049 = !DILocation(line: 75, column: 7, scope: !1038)
!1050 = !DILocation(line: 78, column: 7, scope: !1038)
!1051 = !DILocation(line: 81, column: 7, scope: !1038)
!1052 = !DILocation(line: 84, column: 7, scope: !1038)
!1053 = !DILocation(line: 87, column: 7, scope: !1038)
!1054 = !DILocation(line: 90, column: 7, scope: !1038)
!1055 = !DILocation(line: 91, column: 7, scope: !1038)
!1056 = !DILocalVariable(name: "program", arg: 1, scope: !1057, file: !98, line: 836, type: !151)
!1057 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !98, file: !98, line: 836, type: !1058, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !151}
!1060 = !{!1056, !1061, !1068, !1069, !1071, !1072}
!1061 = !DILocalVariable(name: "infomap", scope: !1057, file: !98, line: 838, type: !1062)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 896, elements: !168)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1057, file: !98, line: 838, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1064, file: !98, line: 838, baseType: !151, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1064, file: !98, line: 838, baseType: !151, size: 64, offset: 64)
!1068 = !DILocalVariable(name: "node", scope: !1057, file: !98, line: 848, type: !151)
!1069 = !DILocalVariable(name: "map_prog", scope: !1057, file: !98, line: 849, type: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1071 = !DILocalVariable(name: "lc_messages", scope: !1057, file: !98, line: 861, type: !151)
!1072 = !DILocalVariable(name: "url_program", scope: !1057, file: !98, line: 874, type: !151)
!1073 = !DILocation(line: 0, scope: !1057, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 92, column: 7, scope: !1038)
!1075 = !DILocation(line: 857, column: 3, scope: !1057, inlinedAt: !1074)
!1076 = !DILocation(line: 861, column: 29, scope: !1057, inlinedAt: !1074)
!1077 = !DILocation(line: 862, column: 7, scope: !1078, inlinedAt: !1074)
!1078 = distinct !DILexicalBlock(scope: !1057, file: !98, line: 862, column: 7)
!1079 = !DILocation(line: 862, column: 19, scope: !1078, inlinedAt: !1074)
!1080 = !DILocation(line: 862, column: 22, scope: !1078, inlinedAt: !1074)
!1081 = !DILocation(line: 862, column: 7, scope: !1057, inlinedAt: !1074)
!1082 = !DILocation(line: 868, column: 7, scope: !1083, inlinedAt: !1074)
!1083 = distinct !DILexicalBlock(scope: !1078, file: !98, line: 863, column: 5)
!1084 = !DILocation(line: 870, column: 5, scope: !1083, inlinedAt: !1074)
!1085 = !DILocation(line: 875, column: 3, scope: !1057, inlinedAt: !1074)
!1086 = !DILocation(line: 877, column: 3, scope: !1057, inlinedAt: !1074)
!1087 = !DILocation(line: 95, column: 3, scope: !1022)
!1088 = !DISubprogram(name: "dcgettext", scope: !1089, file: !1089, line: 51, type: !1090, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1089 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!145, !151, !151, !99}
!1092 = !DISubprogram(name: "__fprintf_chk", scope: !1093, file: !1093, line: 93, type: !1094, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1093 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!99, !1096, !99, !1097, null}
!1096 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!1097 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!1098 = !DISubprogram(name: "__printf_chk", scope: !1093, file: !1093, line: 95, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!99, !99, !1097, null}
!1101 = !DISubprogram(name: "fputs_unlocked", scope: !491, file: !491, line: 691, type: !1102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!99, !1097, !1096}
!1104 = !DILocation(line: 0, scope: !245)
!1105 = !DILocation(line: 581, column: 7, scope: !253)
!1106 = !{!1107, !1107, i64 0}
!1107 = !{!"int", !1035, i64 0}
!1108 = !DILocation(line: 581, column: 19, scope: !253)
!1109 = !DILocation(line: 581, column: 7, scope: !245)
!1110 = !DILocation(line: 585, column: 26, scope: !252)
!1111 = !DILocation(line: 0, scope: !252)
!1112 = !DILocation(line: 586, column: 23, scope: !252)
!1113 = !DILocation(line: 586, column: 28, scope: !252)
!1114 = !DILocation(line: 586, column: 32, scope: !252)
!1115 = !{!1035, !1035, i64 0}
!1116 = !DILocation(line: 586, column: 38, scope: !252)
!1117 = !DILocalVariable(name: "__s1", arg: 1, scope: !1118, file: !1119, line: 1359, type: !151)
!1118 = distinct !DISubprogram(name: "streq", scope: !1119, file: !1119, line: 1359, type: !1120, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1122)
!1119 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!255, !151, !151}
!1122 = !{!1117, !1123}
!1123 = !DILocalVariable(name: "__s2", arg: 2, scope: !1118, file: !1119, line: 1359, type: !151)
!1124 = !DILocation(line: 0, scope: !1118, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 586, column: 41, scope: !252)
!1126 = !DILocation(line: 1361, column: 11, scope: !1118, inlinedAt: !1125)
!1127 = !DILocation(line: 1361, column: 10, scope: !1118, inlinedAt: !1125)
!1128 = !DILocation(line: 586, column: 19, scope: !252)
!1129 = !DILocation(line: 587, column: 5, scope: !252)
!1130 = !DILocation(line: 588, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !245, file: !98, line: 588, column: 7)
!1132 = !DILocation(line: 588, column: 7, scope: !245)
!1133 = !DILocation(line: 590, column: 7, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1131, file: !98, line: 589, column: 5)
!1135 = !DILocation(line: 591, column: 7, scope: !1134)
!1136 = !DILocation(line: 595, column: 37, scope: !245)
!1137 = !DILocation(line: 595, column: 35, scope: !245)
!1138 = !DILocation(line: 596, column: 29, scope: !245)
!1139 = !DILocation(line: 597, column: 8, scope: !261)
!1140 = !DILocation(line: 597, column: 7, scope: !245)
!1141 = !DILocation(line: 604, column: 24, scope: !260)
!1142 = !DILocation(line: 604, column: 12, scope: !261)
!1143 = !DILocation(line: 0, scope: !259)
!1144 = !DILocation(line: 610, column: 16, scope: !259)
!1145 = !DILocation(line: 610, column: 7, scope: !259)
!1146 = !DILocation(line: 611, column: 21, scope: !259)
!1147 = !{!1148, !1148, i64 0}
!1148 = !{!"short", !1035, i64 0}
!1149 = !DILocation(line: 611, column: 19, scope: !259)
!1150 = !DILocation(line: 611, column: 16, scope: !259)
!1151 = !DILocation(line: 610, column: 30, scope: !259)
!1152 = distinct !{!1152, !1145, !1146, !1153}
!1153 = !{!"llvm.loop.mustprogress"}
!1154 = !DILocation(line: 612, column: 18, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !259, file: !98, line: 612, column: 11)
!1156 = !DILocation(line: 612, column: 11, scope: !259)
!1157 = !DILocation(line: 620, column: 23, scope: !245)
!1158 = !DILocation(line: 625, column: 39, scope: !245)
!1159 = !DILocation(line: 626, column: 3, scope: !245)
!1160 = !DILocation(line: 626, column: 10, scope: !245)
!1161 = !DILocation(line: 626, column: 21, scope: !245)
!1162 = !DILocation(line: 628, column: 44, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !98, line: 628, column: 11)
!1164 = distinct !DILexicalBlock(scope: !245, file: !98, line: 627, column: 5)
!1165 = !DILocation(line: 628, column: 32, scope: !1163)
!1166 = !DILocation(line: 628, column: 49, scope: !1163)
!1167 = !DILocation(line: 628, column: 11, scope: !1164)
!1168 = !DILocation(line: 630, column: 11, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1164, file: !98, line: 630, column: 11)
!1170 = !DILocation(line: 630, column: 11, scope: !1164)
!1171 = !DILocation(line: 632, column: 26, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !98, line: 632, column: 15)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !98, line: 631, column: 9)
!1174 = !DILocation(line: 632, column: 34, scope: !1172)
!1175 = !DILocation(line: 632, column: 37, scope: !1172)
!1176 = !DILocation(line: 632, column: 15, scope: !1173)
!1177 = !DILocation(line: 640, column: 16, scope: !1164)
!1178 = distinct !{!1178, !1159, !1179, !1153}
!1179 = !DILocation(line: 641, column: 5, scope: !245)
!1180 = !DILocation(line: 644, column: 3, scope: !245)
!1181 = !DILocation(line: 0, scope: !1118, inlinedAt: !1182)
!1182 = distinct !DILocation(line: 648, column: 31, scope: !245)
!1183 = !DILocation(line: 0, scope: !1118, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 649, column: 31, scope: !245)
!1185 = !DILocation(line: 0, scope: !1118, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 650, column: 31, scope: !245)
!1187 = !DILocation(line: 0, scope: !1118, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 651, column: 31, scope: !245)
!1189 = !DILocation(line: 0, scope: !1118, inlinedAt: !1190)
!1190 = distinct !DILocation(line: 652, column: 31, scope: !245)
!1191 = !DILocation(line: 0, scope: !1118, inlinedAt: !1192)
!1192 = distinct !DILocation(line: 653, column: 31, scope: !245)
!1193 = !DILocation(line: 0, scope: !1118, inlinedAt: !1194)
!1194 = distinct !DILocation(line: 654, column: 31, scope: !245)
!1195 = !DILocation(line: 0, scope: !1118, inlinedAt: !1196)
!1196 = distinct !DILocation(line: 655, column: 31, scope: !245)
!1197 = !DILocation(line: 0, scope: !1118, inlinedAt: !1198)
!1198 = distinct !DILocation(line: 656, column: 31, scope: !245)
!1199 = !DILocation(line: 0, scope: !1118, inlinedAt: !1200)
!1200 = distinct !DILocation(line: 657, column: 31, scope: !245)
!1201 = !DILocation(line: 663, column: 7, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !245, file: !98, line: 663, column: 7)
!1203 = !DILocation(line: 664, column: 7, scope: !1202)
!1204 = !DILocation(line: 664, column: 10, scope: !1202)
!1205 = !DILocation(line: 663, column: 7, scope: !245)
!1206 = !DILocation(line: 669, column: 7, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1202, file: !98, line: 665, column: 5)
!1208 = !DILocation(line: 671, column: 5, scope: !1207)
!1209 = !DILocation(line: 676, column: 7, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1202, file: !98, line: 673, column: 5)
!1211 = !DILocation(line: 679, column: 3, scope: !245)
!1212 = !DILocation(line: 683, column: 3, scope: !245)
!1213 = !DILocation(line: 686, column: 3, scope: !245)
!1214 = !DILocation(line: 688, column: 3, scope: !245)
!1215 = !DILocation(line: 691, column: 3, scope: !245)
!1216 = !DILocation(line: 695, column: 3, scope: !245)
!1217 = !DILocation(line: 696, column: 1, scope: !245)
!1218 = !DISubprogram(name: "setlocale", scope: !1219, file: !1219, line: 122, type: !1220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1219 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!145, !99, !151}
!1222 = !DISubprogram(name: "strncmp", scope: !1223, file: !1223, line: 159, type: !1224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1223 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!99, !151, !151, !148}
!1226 = !DISubprogram(name: "exit", scope: !1227, file: !1227, line: 624, type: !1023, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1227 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1228 = !DISubprogram(name: "getenv", scope: !1227, file: !1227, line: 641, type: !1229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!145, !151}
!1231 = !DISubprogram(name: "strcmp", scope: !1223, file: !1223, line: 156, type: !1232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!99, !151, !151}
!1234 = !DISubprogram(name: "strspn", scope: !1223, file: !1223, line: 297, type: !1235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!150, !151, !151}
!1237 = !DISubprogram(name: "strchr", scope: !1223, file: !1223, line: 246, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!145, !151, !99}
!1240 = !DISubprogram(name: "__ctype_b_loc", scope: !130, file: !130, line: 79, type: !1241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!1246 = !DISubprogram(name: "strcspn", scope: !1223, file: !1223, line: 293, type: !1235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1247 = !DISubprogram(name: "fwrite_unlocked", scope: !491, file: !491, line: 704, type: !1248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1042)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!148, !1250, !148, !148, !1096}
!1250 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1253 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 377, type: !1254, scopeLine: 378, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !1257)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!99, !99, !1256}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1284, !1288, !1289, !1290, !1293, !1294, !1296, !1298, !1299}
!1258 = !DILocalVariable(name: "argc", arg: 1, scope: !1253, file: !2, line: 377, type: !99)
!1259 = !DILocalVariable(name: "argv", arg: 2, scope: !1253, file: !2, line: 377, type: !1256)
!1260 = !DILocalVariable(name: "echo", scope: !1253, file: !2, line: 379, type: !255)
!1261 = !DILocalVariable(name: "input_range", scope: !1253, file: !2, line: 380, type: !255)
!1262 = !DILocalVariable(name: "lo_input", scope: !1253, file: !2, line: 381, type: !148)
!1263 = !DILocalVariable(name: "hi_input", scope: !1253, file: !2, line: 382, type: !148)
!1264 = !DILocalVariable(name: "head_lines", scope: !1253, file: !2, line: 383, type: !974)
