; ModuleID = 'src/sleep.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [249 x i8] c"Usage: %s NUMBER[SUFFIX]...\0A  or:  %s OPTION\0APause for NUMBER seconds, where NUMBER is an integer or floating-point.\0ASUFFIX may be 's','m','h', or 'd', for seconds, minutes, hours, days.\0AWith multiple arguments, pause for the sum of their values.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"sleep\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !22

!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 40)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !75, line: 676, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 15)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !75, line: 676, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 61)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !75, line: 679, type: !132, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !75, line: 683, type: !109, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !75, line: 688, type: !109, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !75, line: 691, type: !148, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !75, line: 839, type: !59, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !75, line: 840, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 22)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !75, line: 841, type: !175, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !75, line: 862, type: !116, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !75, line: 868, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 71)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !75, line: 875, type: !69, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !75, line: 877, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 51)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !75, line: 877, type: !54, isLocal: true, isDefinition: true)
!216 = !{!217, !218, !219, !222, !224, !225, !226, !230, !231, !232, !233, !235, !289, !290, !291, !293, !294}
!217 = !DILocalVariable(name: "program", arg: 1, scope: !74, file: !75, line: 573, type: !78)
!218 = !DILocalVariable(name: "option", arg: 2, scope: !74, file: !75, line: 573, type: !78)
!219 = !DILocalVariable(name: "term", scope: !220, file: !75, line: 585, type: !78)
!220 = distinct !DILexicalBlock(scope: !221, file: !75, line: 582, column: 5)
!221 = distinct !DILexicalBlock(scope: !74, file: !75, line: 581, column: 7)
!222 = !DILocalVariable(name: "double_space", scope: !74, file: !75, line: 594, type: !223)
!223 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!224 = !DILocalVariable(name: "first_word", scope: !74, file: !75, line: 595, type: !78)
!225 = !DILocalVariable(name: "option_text", scope: !74, file: !75, line: 596, type: !78)
!226 = !DILocalVariable(name: "s", scope: !227, file: !75, line: 608, type: !78)
!227 = distinct !DILexicalBlock(scope: !228, file: !75, line: 605, column: 5)
!228 = distinct !DILexicalBlock(scope: !229, file: !75, line: 604, column: 12)
!229 = distinct !DILexicalBlock(scope: !74, file: !75, line: 597, column: 7)
!230 = !DILocalVariable(name: "spaces", scope: !227, file: !75, line: 609, type: !102)
!231 = !DILocalVariable(name: "anchor_len", scope: !74, file: !75, line: 620, type: !102)
!232 = !DILocalVariable(name: "desc_text", scope: !74, file: !75, line: 625, type: !78)
!233 = !DILocalVariable(name: "__ptr", scope: !234, file: !75, line: 644, type: !78)
!234 = distinct !DILexicalBlock(scope: !74, file: !75, line: 644, column: 3)
!235 = !DILocalVariable(name: "__stream", scope: !234, file: !75, line: 644, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !239)
!238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!241 = !{!242, !243, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !258, !260, !261, !262, !266, !267, !269, !270, !273, !275, !278, !281, !282, !283, !284, !285}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !240, line: 51, baseType: !100, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !240, line: 54, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !240, line: 55, baseType: !244, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !240, line: 56, baseType: !244, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !240, line: 57, baseType: !244, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !240, line: 58, baseType: !244, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !240, line: 59, baseType: !244, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !240, line: 60, baseType: !244, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !240, line: 61, baseType: !244, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !240, line: 64, baseType: !244, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !240, line: 65, baseType: !244, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !240, line: 66, baseType: !244, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !240, line: 68, baseType: !256, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !240, line: 36, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !240, line: 70, baseType: !259, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !240, line: 72, baseType: !100, size: 32, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !240, line: 73, baseType: !100, size: 32, offset: 928)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !240, line: 74, baseType: !263, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !264, line: 152, baseType: !265)
!264 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!265 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !240, line: 77, baseType: !101, size: 16, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !240, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !240, line: 79, baseType: !29, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !240, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !240, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !240, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !264, line: 153, baseType: !265)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !239, file: !240, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !240, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !239, file: !240, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !240, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !239, file: !240, line: 93, baseType: !259, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !239, file: !240, line: 94, baseType: !99, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !240, line: 95, baseType: !102, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !240, line: 96, baseType: !100, size: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !240, line: 98, baseType: !286, size: 160, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !DILocalVariable(name: "__cnt", scope: !234, file: !75, line: 644, type: !102)
!290 = !DILocalVariable(name: "url_program", scope: !74, file: !75, line: 648, type: !78)
!291 = !DILocalVariable(name: "__ptr", scope: !292, file: !75, line: 686, type: !78)
!292 = distinct !DILexicalBlock(scope: !74, file: !75, line: 686, column: 3)
!293 = !DILocalVariable(name: "__stream", scope: !292, file: !75, line: 686, type: !236)
!294 = !DILocalVariable(name: "__cnt", scope: !292, file: !75, line: 686, type: !102)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !297, line: 3, type: !175, isLocal: true, isDefinition: true)
!297 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "Version", scope: !300, file: !297, line: 3, type: !78, isLocal: false, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C11, file: !297, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !301, splitDebugInlining: false, nameTableKind: None)
!301 = !{!295, !298}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "file_name", scope: !304, file: !305, line: 45, type: !78, isLocal: true, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C11, file: !305, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !306, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!306 = !{!307, !309, !311, !313, !302, !315}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !305, line: 121, type: !143, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !305, line: 121, type: !54, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !305, line: 123, type: !143, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !305, line: 126, type: !132, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !304, file: !305, line: 55, type: !223, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !319, file: !320, line: 66, type: !371, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!321 = !{!99, !105}
!322 = !{!323, !325, !350, !352, !354, !356, !317, !358, !360, !362, !364, !369}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !320, line: 272, type: !109, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "old_file_name", scope: !327, file: !320, line: 304, type: !78, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "verror_at_line", scope: !320, file: !320, line: 298, type: !328, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !343)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !100, !100, !78, !84, !78, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !331, line: 52, baseType: !332)
!331 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !333, line: 14, baseType: !334)
!333 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !335, baseType: !336)
!335 = !DIFile(filename: "lib/error.c", directory: "/src")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !337)
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !336, file: !335, baseType: !99, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !336, file: !335, baseType: !99, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !336, file: !335, baseType: !99, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !336, file: !335, baseType: !100, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !336, file: !335, baseType: !100, size: 32, offset: 224)
!343 = !{!344, !345, !346, !347, !348, !349}
!344 = !DILocalVariable(name: "status", arg: 1, scope: !327, file: !320, line: 298, type: !100)
!345 = !DILocalVariable(name: "errnum", arg: 2, scope: !327, file: !320, line: 298, type: !100)
!346 = !DILocalVariable(name: "file_name", arg: 3, scope: !327, file: !320, line: 298, type: !78)
!347 = !DILocalVariable(name: "line_number", arg: 4, scope: !327, file: !320, line: 298, type: !84)
!348 = !DILocalVariable(name: "message", arg: 5, scope: !327, file: !320, line: 298, type: !78)
!349 = !DILocalVariable(name: "args", arg: 6, scope: !327, file: !320, line: 298, type: !330)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "old_line_number", scope: !327, file: !320, line: 305, type: !84, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !320, line: 338, type: !116, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !320, line: 346, type: !148, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !320, line: 346, type: !123, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "error_message_count", scope: !319, file: !320, line: 69, type: !84, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !319, file: !320, line: 295, type: !100, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !320, line: 208, type: !143, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !320, line: 208, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 21)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !320, line: 214, type: !109, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !376, line: 60, type: !123, isLocal: true, isDefinition: true)
!376 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "long_options", scope: !379, file: !376, line: 34, type: !387, isLocal: true, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C11, file: !376, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !380, splitDebugInlining: false, nameTableKind: None)
!380 = !{!374, !381, !383, !385, !377}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !376, line: 112, type: !29, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !376, line: 36, type: !109, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !376, line: 37, type: !148, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 768, elements: !133)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !390, line: 50, size: 256, elements: !391)
!390 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!391 = !{!392, !393, !394, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !390, line: 52, baseType: !78, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !389, file: !390, line: 55, baseType: !100, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !389, file: !390, line: 56, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !389, file: !390, line: 57, baseType: !100, size: 32, offset: 192)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "program_name", scope: !399, file: !400, line: 31, type: !78, isLocal: false, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C11, file: !400, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !401, globals: !402, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!401 = !{!244}
!402 = !{!397, !403, !405}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !400, line: 46, type: !148, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !400, line: 49, type: !116, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "utf07FF", scope: !409, file: !410, line: 46, type: !437, isLocal: true, isDefinition: true)
!409 = distinct !DISubprogram(name: "proper_name_lite", scope: !410, file: !410, line: 38, type: !411, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !413, retainedNodes: !415)
!410 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!411 = !DISubroutineType(types: !412)
!412 = !{!78, !78, !78}
!413 = distinct !DICompileUnit(language: DW_LANG_C11, file: !410, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !414, splitDebugInlining: false, nameTableKind: None)
!414 = !{!407}
!415 = !{!416, !417, !418, !419, !424}
!416 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !409, file: !410, line: 38, type: !78)
!417 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !409, file: !410, line: 38, type: !78)
!418 = !DILocalVariable(name: "translation", scope: !409, file: !410, line: 40, type: !78)
!419 = !DILocalVariable(name: "w", scope: !409, file: !410, line: 47, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !421, line: 37, baseType: !422)
!421 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !264, line: 57, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !264, line: 42, baseType: !84)
!424 = !DILocalVariable(name: "mbs", scope: !409, file: !410, line: 48, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !426, line: 6, baseType: !427)
!426 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !428, line: 21, baseType: !429)
!428 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 13, size: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !429, file: !428, line: 15, baseType: !100, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !429, file: !428, line: 20, baseType: !433, size: 32, offset: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !428, line: 16, size: 32, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !433, file: !428, line: 18, baseType: !84, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !433, file: !428, line: 19, baseType: !116, size: 32)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 16, elements: !124)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !440, line: 78, type: !148, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !440, line: 79, type: !14, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !440, line: 80, type: !49, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !440, line: 81, type: !49, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !440, line: 82, type: !286, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !440, line: 83, type: !123, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !440, line: 84, type: !148, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !440, line: 85, type: !143, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !440, line: 86, type: !143, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !440, line: 87, type: !148, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !461, file: !440, line: 76, type: !547, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C11, file: !440, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !482, globals: !483, splitDebugInlining: false, nameTableKind: None)
!462 = !{!463, !477, !82}
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !464, line: 42, baseType: !84, size: 32, elements: !465)
!464 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!466 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!467 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!468 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!469 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!470 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!471 = !DIEnumerator(name: "c_quoting_style", value: 5)
!472 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!473 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!474 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!475 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!476 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !464, line: 254, baseType: !84, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!480 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!481 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!482 = !{!100, !101, !102}
!483 = !{!438, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !484, !488, !498, !500, !505, !507, !509, !511, !513, !536, !543, !545}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !461, file: !440, line: 92, type: !486, isLocal: false, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !35)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !461, file: !440, line: 1040, type: !490, isLocal: false, isDefinition: true)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !440, line: 56, size: 448, elements: !491)
!491 = !{!492, !493, !494, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !490, file: !440, line: 59, baseType: !463, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !490, file: !440, line: 62, baseType: !100, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !490, file: !440, line: 66, baseType: !495, size: 256, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !149)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !490, file: !440, line: 69, baseType: !78, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !490, file: !440, line: 72, baseType: !78, size: 64, offset: 384)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !461, file: !440, line: 107, type: !490, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "slot0", scope: !461, file: !440, line: 831, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 256)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !440, line: 321, type: !123, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !440, line: 357, type: !123, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !440, line: 358, type: !123, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !440, line: 199, type: !143, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quote", scope: !515, file: !440, line: 228, type: !534, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "gettext_quote", scope: !440, file: !440, line: 197, type: !516, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!78, !78, !463}
!518 = !{!519, !520, !521, !522, !523}
!519 = !DILocalVariable(name: "msgid", arg: 1, scope: !515, file: !440, line: 197, type: !78)
!520 = !DILocalVariable(name: "s", arg: 2, scope: !515, file: !440, line: 197, type: !463)
!521 = !DILocalVariable(name: "translation", scope: !515, file: !440, line: 199, type: !78)
!522 = !DILocalVariable(name: "w", scope: !515, file: !440, line: 229, type: !420)
!523 = !DILocalVariable(name: "mbs", scope: !515, file: !440, line: 230, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !426, line: 6, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !428, line: 21, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 13, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !526, file: !428, line: 15, baseType: !100, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !526, file: !428, line: 20, baseType: !530, size: 32, offset: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !428, line: 16, size: 32, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !530, file: !428, line: 18, baseType: !84, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !530, file: !428, line: 19, baseType: !116, size: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !535)
!535 = !{!125, !118}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "slotvec", scope: !461, file: !440, line: 834, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !440, line: 823, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !440, line: 825, baseType: !102, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !440, line: 826, baseType: !244, size: 64, offset: 64)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "nslots", scope: !461, file: !440, line: 832, type: !100, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec0", scope: !461, file: !440, line: 833, type: !539, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 704, elements: !549)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!549 = !{!550}
!550 = !DISubrange(count: 11)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !553, line: 67, type: !54, isLocal: true, isDefinition: true)
!553 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !553, line: 69, type: !143, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !143, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !116, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !553, line: 85, type: !123, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 171)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 34)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !553, line: 105, type: !59, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !553, line: 109, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 23)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !553, line: 113, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 28)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !553, line: 120, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 32)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !553, line: 127, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 36)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !553, line: 134, type: !170, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !553, line: 142, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 44)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !553, line: 150, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 48)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !553, line: 159, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 52)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !553, line: 170, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 60)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !286, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !195, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !286, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !44, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !170, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !3, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 29)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !635, file: !636, line: 26, type: !638, isLocal: false, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !636, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!637 = !{!633}
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 376, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 47)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "exit_failure", scope: !643, file: !644, line: 24, type: !646, isLocal: false, isDefinition: true)
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !645, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!645 = !{!641}
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !132, isLocal: true, isDefinition: true)
!649 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !143, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !165, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !656, file: !657, line: 58, type: !682, isLocal: true, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !657, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !658, globals: !679, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!658 = !{!244, !659}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !660, line: 24, baseType: !661)
!660 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !662, line: 41, baseType: !663)
!662 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !662, line: 27, size: 1856, elements: !665)
!665 = !{!666, !670, !673, !676, !677}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !664, file: !662, line: 30, baseType: !667, size: 832)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 832, elements: !50)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !662, line: 30, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !664, file: !662, line: 33, baseType: !671, size: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !664, file: !662, line: 34, baseType: !674, size: 64, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !664, file: !662, line: 35, baseType: !674, size: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !664, file: !662, line: 38, baseType: !678, size: 832, offset: 1024)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 832, elements: !50)
!679 = !{!680, !654}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !657, line: 66, type: !123, isLocal: true, isDefinition: true)
!682 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !659)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !685, line: 108, type: !29, isLocal: true, isDefinition: true)
!685 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "internal_state", scope: !688, file: !685, line: 97, type: !691, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !685, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !689, globals: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !{!99, !102, !105}
!690 = !{!683, !686}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !426, line: 6, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !428, line: 21, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 13, size: 64, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !693, file: !428, line: 15, baseType: !100, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !693, file: !428, line: 20, baseType: !697, size: 32, offset: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !693, file: !428, line: 16, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !697, file: !428, line: 18, baseType: !84, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !697, file: !428, line: 19, baseType: !116, size: 32)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !703, line: 35, type: !123, isLocal: true, isDefinition: true)
!703 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !703, line: 35, type: !14, isLocal: true, isDefinition: true)
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !707, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !553, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !711, retainedTypes: !715, globals: !716, splitDebugInlining: false, nameTableKind: None)
!711 = !{!712}
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 40, baseType: !84, size: 32, elements: !713)
!713 = !{!714}
!714 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!715 = !{!99}
!716 = !{!551, !554, !556, !558, !560, !562, !567, !572, !574, !579, !584, !589, !594, !596, !601, !606, !611, !616, !618, !620, !622, !624, !626, !628}
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !750, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!719 = !{!720, !732}
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !721, file: !718, line: 188, baseType: !84, size: 32, elements: !730)
!721 = distinct !DISubprogram(name: "x2nrealloc", scope: !718, file: !718, line: 176, type: !722, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !717, retainedNodes: !725)
!722 = !DISubroutineType(types: !723)
!723 = !{!99, !99, !724, !102}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!725 = !{!726, !727, !728, !729}
!726 = !DILocalVariable(name: "p", arg: 1, scope: !721, file: !718, line: 176, type: !99)
!727 = !DILocalVariable(name: "pn", arg: 2, scope: !721, file: !718, line: 176, type: !724)
!728 = !DILocalVariable(name: "s", arg: 3, scope: !721, file: !718, line: 176, type: !102)
!729 = !DILocalVariable(name: "n", scope: !721, file: !718, line: 178, type: !102)
!730 = !{!731}
!731 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !733, file: !718, line: 228, baseType: !84, size: 32, elements: !730)
!733 = distinct !DISubprogram(name: "xpalloc", scope: !718, file: !718, line: 223, type: !734, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !717, retainedNodes: !740)
!734 = !DISubroutineType(types: !735)
!735 = !{!99, !99, !736, !737, !739, !737}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !738, line: 130, baseType: !739)
!738 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !103, line: 35, baseType: !265)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749}
!741 = !DILocalVariable(name: "pa", arg: 1, scope: !733, file: !718, line: 223, type: !99)
!742 = !DILocalVariable(name: "pn", arg: 2, scope: !733, file: !718, line: 223, type: !736)
!743 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !733, file: !718, line: 223, type: !737)
!744 = !DILocalVariable(name: "n_max", arg: 4, scope: !733, file: !718, line: 223, type: !739)
!745 = !DILocalVariable(name: "s", arg: 5, scope: !733, file: !718, line: 223, type: !737)
!746 = !DILocalVariable(name: "n0", scope: !733, file: !718, line: 230, type: !737)
!747 = !DILocalVariable(name: "n", scope: !733, file: !718, line: 237, type: !737)
!748 = !DILocalVariable(name: "nbytes", scope: !733, file: !718, line: 248, type: !737)
!749 = !DILocalVariable(name: "adjusted_nbytes", scope: !733, file: !718, line: 252, type: !737)
!750 = !{!244, !99, !223, !265, !104}
!751 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !752, splitDebugInlining: false, nameTableKind: None)
!752 = !{!647, !650, !652}
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !755, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/xnanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b6a69034949aee1e9f05553e779b94d2")
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !757, line: 10, baseType: !758)
!757 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !264, line: 160, baseType: !265)
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !763, retainedTypes: !755, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!763 = !{!764}
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 44, baseType: !84, size: 32, elements: !766)
!765 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!766 = !{!767}
!767 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !715, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !715, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/nanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ea6d8d4443a961090653c9a262702e98")
!776 = !{!777}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !775, line: 37, baseType: !84, size: 32, elements: !778)
!778 = !{!779}
!779 = !DIEnumerator(name: "BILLION", value: 1000000000)
!780 = distinct !DICompileUnit(language: DW_LANG_C11, file: !781, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !782, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!782 = !{!223, !104, !99}
!783 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !784, splitDebugInlining: false, nameTableKind: None)
!784 = !{!701, !704}
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!787 = distinct !DICompileUnit(language: DW_LANG_C11, file: !788, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !715, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!789 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!790 = !{i32 7, !"Dwarf Version", i32 5}
!791 = !{i32 2, !"Debug Info Version", i32 3}
!792 = !{i32 1, !"wchar_size", i32 4}
!793 = !{i32 8, !"PIC Level", i32 2}
!794 = !{i32 7, !"PIE Level", i32 2}
!795 = !{i32 7, !"uwtable", i32 2}
!796 = !{i32 7, !"frame-pointer", i32 1}
!797 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !798, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !100}
!800 = !{!801}
!801 = !DILocalVariable(name: "status", arg: 1, scope: !797, file: !2, line: 36, type: !100)
!802 = !DILocation(line: 0, scope: !797)
!803 = !DILocation(line: 38, column: 14, scope: !804)
!804 = distinct !DILexicalBlock(scope: !797, file: !2, line: 38, column: 7)
!805 = !DILocation(line: 38, column: 7, scope: !797)
!806 = !DILocation(line: 39, column: 5, scope: !807)
!807 = distinct !DILexicalBlock(scope: !804, file: !2, line: 39, column: 5)
!808 = !{!809, !809, i64 0}
!809 = !{!"any pointer", !810, i64 0}
!810 = !{!"omnipotent char", !811, i64 0}
!811 = !{!"Simple C/C++ TBAA"}
!812 = !DILocation(line: 42, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !804, file: !2, line: 41, column: 5)
!814 = !DILocation(line: 51, column: 7, scope: !813)
!815 = !DILocation(line: 52, column: 7, scope: !813)
!816 = !DILocalVariable(name: "program", arg: 1, scope: !817, file: !75, line: 836, type: !78)
!817 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !75, file: !75, line: 836, type: !818, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !78}
!820 = !{!816, !821, !828, !829, !831, !832}
!821 = !DILocalVariable(name: "infomap", scope: !817, file: !75, line: 838, type: !822)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 896, elements: !144)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !817, file: !75, line: 838, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !824, file: !75, line: 838, baseType: !78, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !824, file: !75, line: 838, baseType: !78, size: 64, offset: 64)
!828 = !DILocalVariable(name: "node", scope: !817, file: !75, line: 848, type: !78)
!829 = !DILocalVariable(name: "map_prog", scope: !817, file: !75, line: 849, type: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!831 = !DILocalVariable(name: "lc_messages", scope: !817, file: !75, line: 861, type: !78)
!832 = !DILocalVariable(name: "url_program", scope: !817, file: !75, line: 874, type: !78)
!833 = !DILocation(line: 0, scope: !817, inlinedAt: !834)
!834 = distinct !DILocation(line: 53, column: 7, scope: !813)
!835 = !DILocation(line: 857, column: 3, scope: !817, inlinedAt: !834)
!836 = !DILocation(line: 861, column: 29, scope: !817, inlinedAt: !834)
!837 = !DILocation(line: 862, column: 7, scope: !838, inlinedAt: !834)
!838 = distinct !DILexicalBlock(scope: !817, file: !75, line: 862, column: 7)
!839 = !DILocation(line: 862, column: 19, scope: !838, inlinedAt: !834)
!840 = !DILocation(line: 862, column: 22, scope: !838, inlinedAt: !834)
!841 = !DILocation(line: 862, column: 7, scope: !817, inlinedAt: !834)
!842 = !DILocation(line: 868, column: 7, scope: !843, inlinedAt: !834)
!843 = distinct !DILexicalBlock(scope: !838, file: !75, line: 863, column: 5)
!844 = !DILocation(line: 870, column: 5, scope: !843, inlinedAt: !834)
!845 = !DILocation(line: 875, column: 3, scope: !817, inlinedAt: !834)
!846 = !DILocation(line: 877, column: 3, scope: !817, inlinedAt: !834)
!847 = !DILocation(line: 55, column: 3, scope: !797)
!848 = !DISubprogram(name: "dcgettext", scope: !849, file: !849, line: 51, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!849 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!850 = !DISubroutineType(types: !851)
!851 = !{!244, !78, !78, !100}
!852 = !{}
!853 = !DISubprogram(name: "__fprintf_chk", scope: !854, file: !854, line: 93, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!854 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!855 = !DISubroutineType(types: !856)
!856 = !{!100, !857, !100, !858, null}
!857 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !236)
!858 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !78)
!859 = !DISubprogram(name: "__printf_chk", scope: !854, file: !854, line: 95, type: !860, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!860 = !DISubroutineType(types: !861)
!861 = !{!100, !100, !858, null}
!862 = !DILocation(line: 0, scope: !74)
!863 = !DILocation(line: 581, column: 7, scope: !221)
!864 = !{!865, !865, i64 0}
!865 = !{!"int", !810, i64 0}
!866 = !DILocation(line: 581, column: 19, scope: !221)
!867 = !DILocation(line: 581, column: 7, scope: !74)
!868 = !DILocation(line: 585, column: 26, scope: !220)
!869 = !DILocation(line: 0, scope: !220)
!870 = !DILocation(line: 586, column: 23, scope: !220)
!871 = !DILocation(line: 586, column: 28, scope: !220)
!872 = !DILocation(line: 586, column: 32, scope: !220)
!873 = !{!810, !810, i64 0}
!874 = !DILocation(line: 586, column: 38, scope: !220)
!875 = !DILocalVariable(name: "__s1", arg: 1, scope: !876, file: !877, line: 1359, type: !78)
!876 = distinct !DISubprogram(name: "streq", scope: !877, file: !877, line: 1359, type: !878, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !880)
!877 = !DIFile(filename: "./lib/string.h", directory: "/src")
!878 = !DISubroutineType(types: !879)
!879 = !{!223, !78, !78}
!880 = !{!875, !881}
!881 = !DILocalVariable(name: "__s2", arg: 2, scope: !876, file: !877, line: 1359, type: !78)
!882 = !DILocation(line: 0, scope: !876, inlinedAt: !883)
!883 = distinct !DILocation(line: 586, column: 41, scope: !220)
!884 = !DILocation(line: 1361, column: 11, scope: !876, inlinedAt: !883)
!885 = !DILocation(line: 1361, column: 10, scope: !876, inlinedAt: !883)
!886 = !DILocation(line: 586, column: 19, scope: !220)
!887 = !DILocation(line: 587, column: 5, scope: !220)
!888 = !DILocation(line: 588, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !74, file: !75, line: 588, column: 7)
!890 = !DILocation(line: 588, column: 7, scope: !74)
!891 = !DILocation(line: 590, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !75, line: 589, column: 5)
!893 = !DILocation(line: 591, column: 7, scope: !892)
!894 = !DILocation(line: 595, column: 37, scope: !74)
!895 = !DILocation(line: 595, column: 35, scope: !74)
!896 = !DILocation(line: 596, column: 29, scope: !74)
!897 = !DILocation(line: 597, column: 8, scope: !229)
!898 = !DILocation(line: 597, column: 7, scope: !74)
!899 = !DILocation(line: 604, column: 24, scope: !228)
!900 = !DILocation(line: 604, column: 12, scope: !229)
!901 = !DILocation(line: 0, scope: !227)
!902 = !DILocation(line: 610, column: 16, scope: !227)
!903 = !DILocation(line: 610, column: 7, scope: !227)
!904 = !DILocation(line: 611, column: 21, scope: !227)
!905 = !{!906, !906, i64 0}
!906 = !{!"short", !810, i64 0}
!907 = !DILocation(line: 611, column: 19, scope: !227)
!908 = !DILocation(line: 611, column: 16, scope: !227)
!909 = !DILocation(line: 610, column: 30, scope: !227)
!910 = distinct !{!910, !903, !904, !911}
!911 = !{!"llvm.loop.mustprogress"}
!912 = !DILocation(line: 612, column: 18, scope: !913)
!913 = distinct !DILexicalBlock(scope: !227, file: !75, line: 612, column: 11)
!914 = !DILocation(line: 612, column: 11, scope: !227)
!915 = !DILocation(line: 620, column: 23, scope: !74)
!916 = !DILocation(line: 625, column: 39, scope: !74)
!917 = !DILocation(line: 626, column: 3, scope: !74)
!918 = !DILocation(line: 626, column: 10, scope: !74)
!919 = !DILocation(line: 626, column: 21, scope: !74)
!920 = !DILocation(line: 628, column: 44, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !75, line: 628, column: 11)
!922 = distinct !DILexicalBlock(scope: !74, file: !75, line: 627, column: 5)
!923 = !DILocation(line: 628, column: 32, scope: !921)
!924 = !DILocation(line: 628, column: 49, scope: !921)
!925 = !DILocation(line: 628, column: 11, scope: !922)
!926 = !DILocation(line: 630, column: 11, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !75, line: 630, column: 11)
!928 = !DILocation(line: 630, column: 11, scope: !922)
!929 = !DILocation(line: 632, column: 26, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !75, line: 632, column: 15)
!931 = distinct !DILexicalBlock(scope: !927, file: !75, line: 631, column: 9)
!932 = !DILocation(line: 632, column: 34, scope: !930)
!933 = !DILocation(line: 632, column: 37, scope: !930)
!934 = !DILocation(line: 632, column: 15, scope: !931)
!935 = !DILocation(line: 640, column: 16, scope: !922)
!936 = distinct !{!936, !917, !937, !911}
!937 = !DILocation(line: 641, column: 5, scope: !74)
!938 = !DILocation(line: 644, column: 3, scope: !74)
!939 = !DILocation(line: 0, scope: !876, inlinedAt: !940)
!940 = distinct !DILocation(line: 648, column: 31, scope: !74)
!941 = !DILocation(line: 0, scope: !876, inlinedAt: !942)
!942 = distinct !DILocation(line: 649, column: 31, scope: !74)
!943 = !DILocation(line: 0, scope: !876, inlinedAt: !944)
!944 = distinct !DILocation(line: 650, column: 31, scope: !74)
!945 = !DILocation(line: 0, scope: !876, inlinedAt: !946)
!946 = distinct !DILocation(line: 651, column: 31, scope: !74)
!947 = !DILocation(line: 0, scope: !876, inlinedAt: !948)
!948 = distinct !DILocation(line: 652, column: 31, scope: !74)
!949 = !DILocation(line: 0, scope: !876, inlinedAt: !950)
!950 = distinct !DILocation(line: 653, column: 31, scope: !74)
!951 = !DILocation(line: 0, scope: !876, inlinedAt: !952)
!952 = distinct !DILocation(line: 654, column: 31, scope: !74)
!953 = !DILocation(line: 0, scope: !876, inlinedAt: !954)
!954 = distinct !DILocation(line: 655, column: 31, scope: !74)
!955 = !DILocation(line: 0, scope: !876, inlinedAt: !956)
!956 = distinct !DILocation(line: 656, column: 31, scope: !74)
!957 = !DILocation(line: 0, scope: !876, inlinedAt: !958)
!958 = distinct !DILocation(line: 657, column: 31, scope: !74)
!959 = !DILocation(line: 663, column: 7, scope: !960)
!960 = distinct !DILexicalBlock(scope: !74, file: !75, line: 663, column: 7)
!961 = !DILocation(line: 664, column: 7, scope: !960)
!962 = !DILocation(line: 664, column: 10, scope: !960)
!963 = !DILocation(line: 663, column: 7, scope: !74)
!964 = !DILocation(line: 669, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !960, file: !75, line: 665, column: 5)
!966 = !DILocation(line: 671, column: 5, scope: !965)
!967 = !DILocation(line: 676, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !960, file: !75, line: 673, column: 5)
!969 = !DILocation(line: 679, column: 3, scope: !74)
!970 = !DILocation(line: 683, column: 3, scope: !74)
!971 = !DILocation(line: 686, column: 3, scope: !74)
!972 = !DILocation(line: 688, column: 3, scope: !74)
!973 = !DILocation(line: 691, column: 3, scope: !74)
!974 = !DILocation(line: 695, column: 3, scope: !74)
!975 = !DILocation(line: 696, column: 1, scope: !74)
!976 = !DISubprogram(name: "setlocale", scope: !977, file: !977, line: 122, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!977 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!978 = !DISubroutineType(types: !979)
!979 = !{!244, !100, !78}
!980 = !DISubprogram(name: "strncmp", scope: !981, file: !981, line: 159, type: !982, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!981 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!982 = !DISubroutineType(types: !983)
!983 = !{!100, !78, !78, !102}
!984 = !DISubprogram(name: "fputs_unlocked", scope: !331, file: !331, line: 691, type: !985, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!985 = !DISubroutineType(types: !986)
!986 = !{!100, !858, !857}
!987 = !DISubprogram(name: "exit", scope: !988, file: !988, line: 624, type: !798, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !852)
!988 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!989 = !DISubprogram(name: "getenv", scope: !988, file: !988, line: 641, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!990 = !DISubroutineType(types: !991)
!991 = !{!244, !78}
!992 = !DISubprogram(name: "strcmp", scope: !981, file: !981, line: 156, type: !993, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!993 = !DISubroutineType(types: !994)
!994 = !{!100, !78, !78}
!995 = !DISubprogram(name: "strspn", scope: !981, file: !981, line: 297, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!996 = !DISubroutineType(types: !997)
!997 = !{!104, !78, !78}
!998 = !DISubprogram(name: "strchr", scope: !981, file: !981, line: 246, type: !999, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!244, !78, !100}
!1001 = !DISubprogram(name: "__ctype_b_loc", scope: !83, file: !83, line: 79, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!1005 = !DISubprogram(name: "strcspn", scope: !981, file: !981, line: 293, type: !996, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1006 = !DISubprogram(name: "fwrite_unlocked", scope: !331, file: !331, line: 704, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!102, !1009, !102, !102, !857}
!1009 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1012 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 94, type: !1013, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1016)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!100, !100, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!1016 = !{!1017, !1018, !1019, !1021, !1022, !1024, !1027, !1028}
!1017 = !DILocalVariable(name: "argc", arg: 1, scope: !1012, file: !2, line: 94, type: !100)
!1018 = !DILocalVariable(name: "argv", arg: 2, scope: !1012, file: !2, line: 94, type: !1015)
!1019 = !DILocalVariable(name: "seconds", scope: !1012, file: !2, line: 96, type: !1020)
!1020 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1021 = !DILocalVariable(name: "ok", scope: !1012, file: !2, line: 97, type: !223)
!1022 = !DILocalVariable(name: "i", scope: !1023, file: !2, line: 117, type: !100)
!1023 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 117, column: 3)
!1024 = !DILocalVariable(name: "p", scope: !1025, file: !2, line: 119, type: !244)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !2, line: 118, column: 5)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !2, line: 117, column: 3)
!1027 = !DILocalVariable(name: "duration", scope: !1025, file: !2, line: 121, type: !1020)
!1028 = !DILocalVariable(name: "s", scope: !1025, file: !2, line: 122, type: !1020)
!1029 = !DILocation(line: 0, scope: !1012)
!1030 = !DILocation(line: 100, column: 21, scope: !1012)
!1031 = !DILocation(line: 100, column: 3, scope: !1012)
!1032 = !DILocation(line: 101, column: 3, scope: !1012)
!1033 = !DILocation(line: 102, column: 3, scope: !1012)
!1034 = !DILocation(line: 103, column: 3, scope: !1012)
!1035 = !DILocation(line: 105, column: 3, scope: !1012)
!1036 = !DILocation(line: 108, column: 36, scope: !1012)
!1037 = !DILocation(line: 108, column: 58, scope: !1012)
!1038 = !DILocation(line: 107, column: 3, scope: !1012)
!1039 = !DILocation(line: 111, column: 12, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 111, column: 7)
!1041 = !DILocation(line: 111, column: 7, scope: !1012)
!1042 = !DILocation(line: 113, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 112, column: 5)
!1044 = !DILocation(line: 114, column: 7, scope: !1043)
!1045 = !DILocation(line: 117, column: 16, scope: !1023)
!1046 = !DILocation(line: 0, scope: !1023)
!1047 = !DILocation(line: 117, column: 26, scope: !1026)
!1048 = !DILocation(line: 117, column: 3, scope: !1023)
!1049 = !DILocation(line: 138, column: 7, scope: !1012)
!1050 = !DILocation(line: 119, column: 7, scope: !1025)
!1051 = !DILocation(line: 120, column: 13, scope: !1025)
!1052 = !DILocation(line: 121, column: 36, scope: !1025)
!1053 = !DILocation(line: 0, scope: !1025)
!1054 = !DILocation(line: 121, column: 25, scope: !1025)
!1055 = !DILocation(line: 122, column: 45, scope: !1025)
!1056 = !DILocalVariable(name: "c", arg: 1, scope: !1057, file: !1058, line: 54, type: !1020)
!1057 = distinct !DISubprogram(name: "dtimespec_bound", scope: !1058, file: !1058, line: 54, type: !1059, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1061)
!1058 = !DIFile(filename: "./lib/dtimespec-bound.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1c1d0447ed5234421679b9baaf454c86")
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1020, !1020, !100}
!1061 = !{!1056, !1062, !1063}
!1062 = !DILocalVariable(name: "err", arg: 2, scope: !1057, file: !1058, line: 54, type: !100)
!1063 = !DILocalVariable(name: "phi", scope: !1057, file: !1058, line: 70, type: !1020)
!1064 = !DILocation(line: 0, scope: !1057, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 122, column: 18, scope: !1025)
!1066 = !DILocation(line: 60, column: 11, scope: !1067, inlinedAt: !1065)
!1067 = distinct !DILexicalBlock(scope: !1057, file: !1058, line: 60, column: 7)
!1068 = !DILocation(line: 60, column: 21, scope: !1067, inlinedAt: !1065)
!1069 = !DILocation(line: 123, column: 11, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 123, column: 11)
!1071 = !DILocation(line: 123, column: 22, scope: !1070)
!1072 = !DILocation(line: 123, column: 19, scope: !1070)
!1073 = !DILocation(line: 125, column: 11, scope: !1070)
!1074 = !DILocation(line: 127, column: 15, scope: !1070)
!1075 = !DILocation(line: 127, column: 18, scope: !1070)
!1076 = !DILocation(line: 127, column: 25, scope: !1070)
!1077 = !DILocation(line: 127, column: 21, scope: !1070)
!1078 = !DILocation(line: 129, column: 11, scope: !1070)
!1079 = !DILocalVariable(name: "x", arg: 1, scope: !1080, file: !2, line: 65, type: !1083)
!1080 = distinct !DISubprogram(name: "apply_suffix", scope: !2, file: !2, line: 65, type: !1081, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !1084)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!223, !1083, !4}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1084 = !{!1079, !1085, !1086}
!1085 = !DILocalVariable(name: "suffix_char", arg: 2, scope: !1080, file: !2, line: 65, type: !4)
!1086 = !DILocalVariable(name: "multiplier", scope: !1080, file: !2, line: 67, type: !100)
!1087 = !DILocation(line: 0, scope: !1080, inlinedAt: !1088)
!1088 = distinct !DILocation(line: 129, column: 16, scope: !1070)
!1089 = !DILocation(line: 69, column: 3, scope: !1080, inlinedAt: !1088)
!1090 = !DILocation(line: 77, column: 7, scope: !1091, inlinedAt: !1088)
!1091 = distinct !DILexicalBlock(scope: !1080, file: !2, line: 70, column: 5)
!1092 = !DILocation(line: 80, column: 7, scope: !1091, inlinedAt: !1088)
!1093 = !DILocation(line: 83, column: 7, scope: !1091, inlinedAt: !1088)
!1094 = !DILocation(line: 88, column: 28, scope: !1080, inlinedAt: !1088)
!1095 = !DILocation(line: 0, scope: !1057, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 88, column: 8, scope: !1080, inlinedAt: !1088)
!1097 = !DILocation(line: 60, column: 21, scope: !1067, inlinedAt: !1096)
!1098 = !DILocation(line: 123, column: 11, scope: !1025)
!1099 = !DILocation(line: 131, column: 11, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1070, file: !2, line: 130, column: 9)
!1101 = !DILocation(line: 133, column: 9, scope: !1100)
!1102 = !DILocation(line: 122, column: 14, scope: !1025)
!1103 = !DILocation(line: 135, column: 42, scope: !1025)
!1104 = !DILocation(line: 0, scope: !1057, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 135, column: 17, scope: !1025)
!1106 = !DILocation(line: 60, column: 21, scope: !1067, inlinedAt: !1105)
!1107 = !DILocation(line: 136, column: 5, scope: !1026)
!1108 = !DILocation(line: 117, column: 35, scope: !1026)
!1109 = distinct !{!1109, !1048, !1110, !911}
!1110 = !DILocation(line: 136, column: 5, scope: !1023)
!1111 = !DILocation(line: 139, column: 5, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 138, column: 7)
!1113 = !DILocation(line: 141, column: 7, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 141, column: 7)
!1115 = !DILocation(line: 141, column: 7, scope: !1012)
!1116 = !DILocation(line: 142, column: 5, scope: !1114)
!1117 = !DILocation(line: 144, column: 3, scope: !1012)
!1118 = !DISubprogram(name: "bindtextdomain", scope: !849, file: !849, line: 86, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!244, !78, !78}
!1121 = !DISubprogram(name: "textdomain", scope: !849, file: !849, line: 82, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1122 = !DISubprogram(name: "atexit", scope: !988, file: !988, line: 602, type: !1123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!100, !371}
!1125 = !DISubprogram(name: "__errno_location", scope: !1126, file: !1126, line: 37, type: !1127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1126 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!395}
!1129 = distinct !DISubprogram(name: "cl_strtod", scope: !707, file: !707, line: 59, type: !1130, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !706, retainedNodes: !1133)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1020, !78, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1015)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1141, !1142}
!1134 = !DILocalVariable(name: "nptr", arg: 1, scope: !1129, file: !707, line: 59, type: !78)
!1135 = !DILocalVariable(name: "endptr", arg: 2, scope: !1129, file: !707, line: 59, type: !1132)
!1136 = !DILocalVariable(name: "end", scope: !1129, file: !707, line: 61, type: !244)
!1137 = !DILocalVariable(name: "d", scope: !1129, file: !707, line: 62, type: !1020)
!1138 = !DILocalVariable(name: "strtod_errno", scope: !1139, file: !707, line: 65, type: !100)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !707, line: 64, column: 5)
!1140 = distinct !DILexicalBlock(scope: !1129, file: !707, line: 63, column: 7)
!1141 = !DILocalVariable(name: "c_end", scope: !1139, file: !707, line: 66, type: !244)
!1142 = !DILocalVariable(name: "c", scope: !1139, file: !707, line: 67, type: !1020)
!1143 = !DILocation(line: 0, scope: !1129)
!1144 = !DILocation(line: 61, column: 3, scope: !1129)
!1145 = !DILocation(line: 62, column: 14, scope: !1129)
!1146 = !DILocation(line: 63, column: 8, scope: !1140)
!1147 = !DILocation(line: 63, column: 7, scope: !1140)
!1148 = !DILocation(line: 63, column: 7, scope: !1129)
!1149 = !DILocation(line: 65, column: 26, scope: !1139)
!1150 = !DILocation(line: 0, scope: !1139)
!1151 = !DILocation(line: 66, column: 7, scope: !1139)
!1152 = !DILocation(line: 67, column: 18, scope: !1139)
!1153 = !DILocation(line: 68, column: 17, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1139, file: !707, line: 68, column: 11)
!1155 = !DILocation(line: 68, column: 15, scope: !1154)
!1156 = !DILocation(line: 68, column: 11, scope: !1139)
!1157 = !DILocation(line: 71, column: 15, scope: !1154)
!1158 = !DILocation(line: 72, column: 5, scope: !1140)
!1159 = !DILocation(line: 72, column: 5, scope: !1139)
!1160 = !DILocation(line: 73, column: 7, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1129, file: !707, line: 73, column: 7)
!1162 = !DILocation(line: 73, column: 7, scope: !1129)
!1163 = !DILocation(line: 74, column: 13, scope: !1161)
!1164 = !DILocation(line: 74, column: 5, scope: !1161)
!1165 = !DILocation(line: 76, column: 1, scope: !1129)
!1166 = !DILocation(line: 75, column: 3, scope: !1129)
!1167 = !DISubprogram(name: "strtod", scope: !988, file: !988, line: 118, type: !1168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!1020, !858, !1132}
!1170 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !305, file: !305, line: 50, type: !818, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1171)
!1171 = !{!1172}
!1172 = !DILocalVariable(name: "file", arg: 1, scope: !1170, file: !305, line: 50, type: !78)
!1173 = !DILocation(line: 0, scope: !1170)
!1174 = !DILocation(line: 52, column: 13, scope: !1170)
!1175 = !DILocation(line: 53, column: 1, scope: !1170)
!1176 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !305, file: !305, line: 87, type: !1177, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1179)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{null, !223}
!1179 = !{!1180}
!1180 = !DILocalVariable(name: "ignore", arg: 1, scope: !1176, file: !305, line: 87, type: !223)
!1181 = !DILocation(line: 0, scope: !1176)
!1182 = !DILocation(line: 89, column: 16, scope: !1176)
!1183 = !{!1184, !1184, i64 0}
!1184 = !{!"_Bool", !810, i64 0}
!1185 = !DILocation(line: 90, column: 1, scope: !1176)
!1186 = distinct !DISubprogram(name: "close_stdout", scope: !305, file: !305, line: 116, type: !372, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !304, retainedNodes: !1187)
!1187 = !{!1188}
!1188 = !DILocalVariable(name: "write_error", scope: !1189, file: !305, line: 121, type: !78)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !305, line: 120, column: 5)
!1190 = distinct !DILexicalBlock(scope: !1186, file: !305, line: 118, column: 7)
!1191 = !DILocation(line: 118, column: 21, scope: !1190)
!1192 = !DILocation(line: 118, column: 7, scope: !1190)
!1193 = !DILocation(line: 118, column: 29, scope: !1190)
!1194 = !DILocation(line: 119, column: 7, scope: !1190)
!1195 = !DILocation(line: 119, column: 12, scope: !1190)
!1196 = !{i8 0, i8 2}
!1197 = !DILocation(line: 119, column: 25, scope: !1190)
!1198 = !DILocation(line: 119, column: 28, scope: !1190)
!1199 = !DILocation(line: 119, column: 34, scope: !1190)
!1200 = !DILocation(line: 118, column: 7, scope: !1186)
!1201 = !DILocation(line: 121, column: 33, scope: !1189)
!1202 = !DILocation(line: 0, scope: !1189)
!1203 = !DILocation(line: 122, column: 11, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1189, file: !305, line: 122, column: 11)
!1205 = !DILocation(line: 0, scope: !1204)
!1206 = !DILocation(line: 122, column: 11, scope: !1189)
!1207 = !DILocation(line: 123, column: 9, scope: !1204)
!1208 = !DILocation(line: 126, column: 9, scope: !1204)
!1209 = !DILocation(line: 128, column: 14, scope: !1189)
!1210 = !DILocation(line: 128, column: 7, scope: !1189)
!1211 = !DILocation(line: 133, column: 42, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1186, file: !305, line: 133, column: 7)
!1213 = !DILocation(line: 133, column: 28, scope: !1212)
!1214 = !DILocation(line: 133, column: 50, scope: !1212)
!1215 = !DILocation(line: 133, column: 7, scope: !1186)
!1216 = !DILocation(line: 134, column: 12, scope: !1212)
!1217 = !DILocation(line: 134, column: 5, scope: !1212)
!1218 = !DILocation(line: 135, column: 1, scope: !1186)
!1219 = !DISubprogram(name: "_exit", scope: !1220, file: !1220, line: 624, type: !798, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !852)
!1220 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1221 = distinct !DISubprogram(name: "verror", scope: !320, file: !320, line: 251, type: !1222, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1224)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !100, !100, !78, !330}
!1224 = !{!1225, !1226, !1227, !1228}
!1225 = !DILocalVariable(name: "status", arg: 1, scope: !1221, file: !320, line: 251, type: !100)
!1226 = !DILocalVariable(name: "errnum", arg: 2, scope: !1221, file: !320, line: 251, type: !100)
!1227 = !DILocalVariable(name: "message", arg: 3, scope: !1221, file: !320, line: 251, type: !78)
!1228 = !DILocalVariable(name: "args", arg: 4, scope: !1221, file: !320, line: 251, type: !330)
!1229 = !DILocation(line: 0, scope: !1221)
!1230 = !DILocation(line: 251, column: 1, scope: !1221)
!1231 = !DILocation(line: 261, column: 3, scope: !1221)
!1232 = !DILocation(line: 265, column: 7, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1221, file: !320, line: 265, column: 7)
!1234 = !DILocation(line: 265, column: 7, scope: !1221)
!1235 = !DILocation(line: 266, column: 5, scope: !1233)
!1236 = !DILocation(line: 272, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1233, file: !320, line: 268, column: 5)
!1238 = !DILocation(line: 276, column: 3, scope: !1221)
!1239 = !{i64 0, i64 8, !808, i64 8, i64 8, !808, i64 16, i64 8, !808, i64 24, i64 4, !864, i64 28, i64 4, !864}
!1240 = !DILocation(line: 282, column: 1, scope: !1221)
!1241 = distinct !DISubprogram(name: "flush_stdout", scope: !320, file: !320, line: 163, type: !372, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1242)
!1242 = !{!1243}
!1243 = !DILocalVariable(name: "stdout_fd", scope: !1241, file: !320, line: 166, type: !100)
!1244 = !DILocation(line: 0, scope: !1241)
!1245 = !DILocalVariable(name: "fd", arg: 1, scope: !1246, file: !320, line: 145, type: !100)
!1246 = distinct !DISubprogram(name: "is_open", scope: !320, file: !320, line: 145, type: !1247, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1249)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!100, !100}
!1249 = !{!1245}
!1250 = !DILocation(line: 0, scope: !1246, inlinedAt: !1251)
!1251 = distinct !DILocation(line: 182, column: 25, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1241, file: !320, line: 182, column: 7)
!1253 = !DILocation(line: 157, column: 15, scope: !1246, inlinedAt: !1251)
!1254 = !DILocation(line: 157, column: 12, scope: !1246, inlinedAt: !1251)
!1255 = !DILocation(line: 182, column: 7, scope: !1241)
!1256 = !DILocation(line: 184, column: 5, scope: !1252)
!1257 = !DILocation(line: 185, column: 1, scope: !1241)
!1258 = distinct !DISubprogram(name: "error_tail", scope: !320, file: !320, line: 219, type: !1222, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1259)
!1259 = !{!1260, !1261, !1262, !1263}
!1260 = !DILocalVariable(name: "status", arg: 1, scope: !1258, file: !320, line: 219, type: !100)
!1261 = !DILocalVariable(name: "errnum", arg: 2, scope: !1258, file: !320, line: 219, type: !100)
!1262 = !DILocalVariable(name: "message", arg: 3, scope: !1258, file: !320, line: 219, type: !78)
!1263 = !DILocalVariable(name: "args", arg: 4, scope: !1258, file: !320, line: 219, type: !330)
!1264 = !DILocation(line: 0, scope: !1258)
!1265 = !DILocation(line: 219, column: 1, scope: !1258)
!1266 = !DILocation(line: 229, column: 13, scope: !1258)
!1267 = !DILocation(line: 135, column: 10, scope: !1268, inlinedAt: !1310)
!1268 = distinct !DISubprogram(name: "vfprintf", scope: !854, file: !854, line: 132, type: !1269, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !319, retainedNodes: !1306)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!100, !1271, !858, !332}
!1271 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1274, file: !240, line: 51, baseType: !100, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1274, file: !240, line: 54, baseType: !244, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1274, file: !240, line: 55, baseType: !244, size: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1274, file: !240, line: 56, baseType: !244, size: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1274, file: !240, line: 57, baseType: !244, size: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1274, file: !240, line: 58, baseType: !244, size: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1274, file: !240, line: 59, baseType: !244, size: 64, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1274, file: !240, line: 60, baseType: !244, size: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1274, file: !240, line: 61, baseType: !244, size: 64, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1274, file: !240, line: 64, baseType: !244, size: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1274, file: !240, line: 65, baseType: !244, size: 64, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1274, file: !240, line: 66, baseType: !244, size: 64, offset: 704)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1274, file: !240, line: 68, baseType: !256, size: 64, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1274, file: !240, line: 70, baseType: !1290, size: 64, offset: 832)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1274, file: !240, line: 72, baseType: !100, size: 32, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1274, file: !240, line: 73, baseType: !100, size: 32, offset: 928)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1274, file: !240, line: 74, baseType: !263, size: 64, offset: 960)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1274, file: !240, line: 77, baseType: !101, size: 16, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1274, file: !240, line: 78, baseType: !268, size: 8, offset: 1040)
