; ModuleID = 'src/sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.month = type { ptr, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.rlimit, %struct.rlimit, %struct.rlimit, [2 x i32] }
%struct.rlimit = type { i64, i64 }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.line = type { ptr, i64, ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.buffer = type { ptr, i64, i64, i64, i64, i64, i8 }
%struct.merge_node_queue = type { ptr, %union.pthread_mutex_t, %union.pthread_cond_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s, [8 x i8] }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i32, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }

!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 936, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 117)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 562, type: !48, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 566, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 50)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 567, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 62)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 568, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4832, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 604)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1880, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 235)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4446, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 16)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4457, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 1)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4458, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 10)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4458, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 24)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !200, file: !2, line: 153, type: !234, isLocal: true, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !201, retainedTypes: !1103, globals: !1109, splitDebugInlining: false, nameTableKind: None)
!201 = !{!202, !207, !210, !587, !592, !602, !605, !610, !624, !630, !633, !648, !1034, !1042, !1064, !1073, !1084, !1089, !1093, !1096, !1100}
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 110, baseType: !203, size: 32, elements: !204)
!203 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!204 = !{!205, !206}
!205 = !DIEnumerator(name: "SORT_OUT_OF_ORDER", value: 1)
!206 = !DIEnumerator(name: "SORT_FAILURE", value: 2)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 334, baseType: !203, size: 32, elements: !208)
!208 = !{!209}
!209 = !DIEnumerator(name: "NON_CHAR", value: 256)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !211, file: !2, line: 4490, baseType: !203, size: 32, elements: !585)
!211 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 4432, type: !212, scopeLine: 4433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !200, retainedNodes: !217)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !214, !215}
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!217 = !{!218, !219, !220, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !326, !327, !328, !359, !468, !470, !472, !474, !479, !486, !491, !493, !496, !547, !551, !557, !560, !578, !580, !584}
!218 = !DILocalVariable(name: "argc", arg: 1, scope: !211, file: !2, line: 4432, type: !214)
!219 = !DILocalVariable(name: "argv", arg: 2, scope: !211, file: !2, line: 4432, type: !215)
!220 = !DILocalVariable(name: "key", scope: !211, file: !2, line: 4434, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !2, line: 192, size: 576, elements: !223)
!223 = !{!224, !228, !229, !230, !231, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !222, file: !2, line: 194, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 46, baseType: !227)
!226 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!227 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !222, file: !2, line: 195, baseType: !225, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !222, file: !2, line: 196, baseType: !225, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !222, file: !2, line: 197, baseType: !225, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !222, file: !2, line: 198, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !222, file: !2, line: 199, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !222, file: !2, line: 200, baseType: !234, size: 8, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !222, file: !2, line: 201, baseType: !234, size: 8, offset: 392)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !222, file: !2, line: 202, baseType: !234, size: 8, offset: 400)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !222, file: !2, line: 205, baseType: !234, size: 8, offset: 408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !222, file: !2, line: 206, baseType: !234, size: 8, offset: 416)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !222, file: !2, line: 208, baseType: !234, size: 8, offset: 424)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !222, file: !2, line: 210, baseType: !234, size: 8, offset: 432)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !222, file: !2, line: 211, baseType: !234, size: 8, offset: 440)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !222, file: !2, line: 212, baseType: !234, size: 8, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !222, file: !2, line: 213, baseType: !234, size: 8, offset: 456)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !2, line: 214, baseType: !221, size: 64, offset: 512)
!249 = !DILocalVariable(name: "key_buf", scope: !211, file: !2, line: 4435, type: !222)
!250 = !DILocalVariable(name: "gkey", scope: !211, file: !2, line: 4436, type: !222)
!251 = !DILocalVariable(name: "gkey_only", scope: !211, file: !2, line: 4437, type: !234)
!252 = !DILocalVariable(name: "s", scope: !211, file: !2, line: 4438, type: !236)
!253 = !DILocalVariable(name: "c", scope: !211, file: !2, line: 4439, type: !214)
!254 = !DILocalVariable(name: "checkonly", scope: !211, file: !2, line: 4440, type: !4)
!255 = !DILocalVariable(name: "mergeonly", scope: !211, file: !2, line: 4441, type: !234)
!256 = !DILocalVariable(name: "random_source", scope: !211, file: !2, line: 4442, type: !216)
!257 = !DILocalVariable(name: "need_random", scope: !211, file: !2, line: 4443, type: !234)
!258 = !DILocalVariable(name: "nthreads", scope: !211, file: !2, line: 4444, type: !225)
!259 = !DILocalVariable(name: "nfiles", scope: !211, file: !2, line: 4445, type: !225)
!260 = !DILocalVariable(name: "posixly_correct", scope: !211, file: !2, line: 4446, type: !234)
!261 = !DILocalVariable(name: "posix_ver", scope: !211, file: !2, line: 4447, type: !214)
!262 = !DILocalVariable(name: "traditional_usage", scope: !211, file: !2, line: 4448, type: !234)
!263 = !DILocalVariable(name: "files", scope: !211, file: !2, line: 4449, type: !215)
!264 = !DILocalVariable(name: "files_from", scope: !211, file: !2, line: 4450, type: !216)
!265 = !DILocalVariable(name: "tok", scope: !211, file: !2, line: 4451, type: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !267, line: 32, size: 2304, elements: !268)
!267 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!268 = !{!269, !270, !271, !273, !324, !325}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !266, file: !267, line: 34, baseType: !225, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !266, file: !267, line: 35, baseType: !215, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !266, file: !267, line: 36, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !266, file: !267, line: 37, baseType: !274, size: 704, offset: 192)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !275, line: 210, size: 704, elements: !276)
!275 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!276 = !{!277, !278, !288, !289, !290, !291, !297, !298, !309, !320, !321, !322, !323}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !274, file: !275, line: 212, baseType: !225, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !274, file: !275, line: 213, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !275, line: 203, size: 128, elements: !281)
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !280, file: !275, line: 205, baseType: !216, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !275, line: 206, baseType: !279, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !280, file: !275, line: 207, baseType: !285, offset: 128)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: -1)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !274, file: !275, line: 214, baseType: !216, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !274, file: !275, line: 215, baseType: !216, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !274, file: !275, line: 216, baseType: !216, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !274, file: !275, line: 221, baseType: !292, size: 64, offset: 320)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !275, line: 217, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !292, file: !275, line: 219, baseType: !225, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !292, file: !275, line: 220, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !274, file: !275, line: 222, baseType: !225, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !274, file: !275, line: 229, baseType: !299, size: 64, offset: 448)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !275, line: 225, size: 64, elements: !300)
!300 = !{!301, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !299, file: !275, line: 227, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!296, !225}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !299, file: !275, line: 228, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!296, !296, !225}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !274, file: !275, line: 234, baseType: !310, size: 64, offset: 512)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !275, line: 230, size: 64, elements: !311)
!311 = !{!312, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !310, file: !275, line: 232, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !296}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !310, file: !275, line: 233, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !296, !296}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !274, file: !275, line: 236, baseType: !296, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !274, file: !275, line: 237, baseType: !203, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !274, file: !275, line: 238, baseType: !203, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !274, file: !275, line: 242, baseType: !203, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !266, file: !267, line: 38, baseType: !274, size: 704, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !266, file: !267, line: 39, baseType: !274, size: 704, offset: 1600)
!326 = !DILocalVariable(name: "outfile", scope: !211, file: !2, line: 4452, type: !236)
!327 = !DILocalVariable(name: "locale_ok", scope: !211, file: !2, line: 4453, type: !234)
!328 = !DILocalVariable(name: "locale", scope: !329, file: !2, line: 4470, type: !330)
!329 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4469, column: 3)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !333, line: 51, size: 768, elements: !334)
!333 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !332, file: !333, line: 55, baseType: !216, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !332, file: !333, line: 56, baseType: !216, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !332, file: !333, line: 62, baseType: !216, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !332, file: !333, line: 68, baseType: !216, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !332, file: !333, line: 69, baseType: !216, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !332, file: !333, line: 70, baseType: !216, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !332, file: !333, line: 71, baseType: !216, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !332, file: !333, line: 72, baseType: !216, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !332, file: !333, line: 73, baseType: !216, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !332, file: !333, line: 74, baseType: !216, size: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !332, file: !333, line: 75, baseType: !4, size: 8, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !332, file: !333, line: 76, baseType: !4, size: 8, offset: 648)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !332, file: !333, line: 78, baseType: !4, size: 8, offset: 656)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !332, file: !333, line: 80, baseType: !4, size: 8, offset: 664)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !332, file: !333, line: 82, baseType: !4, size: 8, offset: 672)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !332, file: !333, line: 84, baseType: !4, size: 8, offset: 680)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !332, file: !333, line: 91, baseType: !4, size: 8, offset: 688)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !332, file: !333, line: 92, baseType: !4, size: 8, offset: 696)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !332, file: !333, line: 95, baseType: !4, size: 8, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !332, file: !333, line: 97, baseType: !4, size: 8, offset: 712)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !332, file: !333, line: 99, baseType: !4, size: 8, offset: 720)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !332, file: !333, line: 101, baseType: !4, size: 8, offset: 728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !332, file: !333, line: 108, baseType: !4, size: 8, offset: 736)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !332, file: !333, line: 109, baseType: !4, size: 8, offset: 744)
!359 = !DILocalVariable(name: "act", scope: !360, file: !2, line: 4492, type: !361)
!360 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4489, column: 3)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !362, line: 27, size: 1216, elements: !363)
!362 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!363 = !{!364, !456, !463, !464}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !361, file: !362, line: 38, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !362, line: 31, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !365, file: !362, line: 34, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !369, line: 72, baseType: !370)
!369 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !214}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !365, file: !362, line: 36, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !214, !377, !296}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !379, line: 124, baseType: !380)
!379 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 36, size: 1024, elements: !381)
!381 = !{!382, !383, !384, !385, !386}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !380, file: !379, line: 38, baseType: !214, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !380, file: !379, line: 40, baseType: !214, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !380, file: !379, line: 42, baseType: !214, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !380, file: !379, line: 48, baseType: !214, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !380, file: !379, line: 123, baseType: !387, size: 896, offset: 128)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !380, file: !379, line: 51, size: 896, elements: !388)
!388 = !{!389, !393, !401, !413, !419, !429, !445, !450}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !387, file: !379, line: 53, baseType: !390, size: 896)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 896, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 28)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !387, file: !379, line: 60, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 56, size: 64, elements: !395)
!395 = !{!396, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !394, file: !379, line: 58, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !398, line: 154, baseType: !214)
!398 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !394, file: !379, line: 59, baseType: !400, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !398, line: 146, baseType: !203)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !387, file: !379, line: 68, baseType: !402, size: 128)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 63, size: 128, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !402, file: !379, line: 65, baseType: !214, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !402, file: !379, line: 66, baseType: !214, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !402, file: !379, line: 67, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !408, line: 30, baseType: !409)
!408 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !408, line: 24, size: 64, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !409, file: !408, line: 26, baseType: !214, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !409, file: !408, line: 27, baseType: !296, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !387, file: !379, line: 76, baseType: !414, size: 128)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 71, size: 128, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !414, file: !379, line: 73, baseType: !397, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !414, file: !379, line: 74, baseType: !400, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !414, file: !379, line: 75, baseType: !407, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !387, file: !379, line: 86, baseType: !420, size: 256)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 79, size: 256, elements: !421)
!421 = !{!422, !423, !424, !425, !428}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !420, file: !379, line: 81, baseType: !397, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !420, file: !379, line: 82, baseType: !400, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !420, file: !379, line: 83, baseType: !214, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !420, file: !379, line: 84, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !398, line: 156, baseType: !427)
!427 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !420, file: !379, line: 85, baseType: !426, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !387, file: !379, line: 105, baseType: !430, size: 256)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 89, size: 256, elements: !431)
!431 = !{!432, !433, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !430, file: !379, line: 91, baseType: !296, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !430, file: !379, line: 93, baseType: !434, size: 16, offset: 64)
!434 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !430, file: !379, line: 104, baseType: !436, size: 128, offset: 128)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !430, file: !379, line: 94, size: 128, elements: !437)
!437 = !{!438, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !436, file: !379, line: 101, baseType: !439, size: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !379, line: 97, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !439, file: !379, line: 99, baseType: !296, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !439, file: !379, line: 100, baseType: !296, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !436, file: !379, line: 103, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !398, line: 42, baseType: !203)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !387, file: !379, line: 112, baseType: !446, size: 128)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 108, size: 128, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !446, file: !379, line: 110, baseType: !427, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !446, file: !379, line: 111, baseType: !214, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !387, file: !379, line: 121, baseType: !451, size: 128)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !379, line: 116, size: 128, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !451, file: !379, line: 118, baseType: !296, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !451, file: !379, line: 119, baseType: !214, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !451, file: !379, line: 120, baseType: !203, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !361, file: !362, line: 46, baseType: !457, size: 1024, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !458, line: 8, baseType: !459)
!458 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 5, size: 1024, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !459, file: !458, line: 7, baseType: !462, size: 1024)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 1024, elements: !181)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !361, file: !362, line: 49, baseType: !214, size: 32, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !361, file: !362, line: 52, baseType: !465, size: 64, offset: 1152)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null}
!468 = !DILocalVariable(name: "i", scope: !469, file: !2, line: 4495, type: !225)
!469 = distinct !DILexicalBlock(scope: !360, file: !2, line: 4495, column: 5)
!470 = !DILocalVariable(name: "i", scope: !471, file: !2, line: 4508, type: !225)
!471 = distinct !DILexicalBlock(scope: !360, file: !2, line: 4508, column: 5)
!472 = !DILocalVariable(name: "oi", scope: !473, file: !2, line: 4532, type: !214)
!473 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4527, column: 5)
!474 = !DILocalVariable(name: "minus_pos_usage", scope: !475, file: !2, line: 4555, type: !234)
!475 = distinct !DILexicalBlock(scope: !476, file: !2, line: 4554, column: 13)
!476 = distinct !DILexicalBlock(scope: !477, file: !2, line: 4553, column: 15)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 4550, column: 9)
!478 = distinct !DILexicalBlock(scope: !473, file: !2, line: 4534, column: 11)
!479 = !DILocalVariable(name: "optarg1", scope: !480, file: !2, line: 4574, type: !236)
!480 = distinct !DILexicalBlock(scope: !481, file: !2, line: 4573, column: 25)
!481 = distinct !DILexicalBlock(scope: !482, file: !2, line: 4572, column: 27)
!482 = distinct !DILexicalBlock(scope: !483, file: !2, line: 4571, column: 21)
!483 = distinct !DILexicalBlock(scope: !484, file: !2, line: 4568, column: 23)
!484 = distinct !DILexicalBlock(scope: !485, file: !2, line: 4559, column: 17)
!485 = distinct !DILexicalBlock(scope: !475, file: !2, line: 4558, column: 19)
!486 = !DILocalVariable(name: "str", scope: !487, file: !2, line: 4618, type: !488)
!487 = distinct !DILexicalBlock(scope: !477, file: !2, line: 4617, column: 11)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DILocalVariable(name: "newtab", scope: !492, file: !2, line: 4732, type: !4)
!492 = distinct !DILexicalBlock(scope: !477, file: !2, line: 4731, column: 11)
!493 = !DILocalVariable(name: "p", scope: !494, file: !2, line: 4780, type: !236)
!494 = distinct !DILexicalBlock(scope: !495, file: !2, line: 4779, column: 13)
!495 = distinct !DILexicalBlock(scope: !477, file: !2, line: 4778, column: 15)
!496 = !DILocalVariable(name: "stream", scope: !497, file: !2, line: 4817, type: !499)
!497 = distinct !DILexicalBlock(scope: !498, file: !2, line: 4806, column: 5)
!498 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4805, column: 7)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !501, line: 7, baseType: !502)
!501 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !503, line: 49, size: 1728, elements: !504)
!503 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !522, !523, !524, !526, !528, !530, !531, !534, !536, !539, !542, !543, !544, !545, !546}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !502, file: !503, line: 51, baseType: !214, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !502, file: !503, line: 54, baseType: !216, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !502, file: !503, line: 55, baseType: !216, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !502, file: !503, line: 56, baseType: !216, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !502, file: !503, line: 57, baseType: !216, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !502, file: !503, line: 58, baseType: !216, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !502, file: !503, line: 59, baseType: !216, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !502, file: !503, line: 60, baseType: !216, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !502, file: !503, line: 61, baseType: !216, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !502, file: !503, line: 64, baseType: !216, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !502, file: !503, line: 65, baseType: !216, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !502, file: !503, line: 66, baseType: !216, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !502, file: !503, line: 68, baseType: !518, size: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !503, line: 36, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !502, file: !503, line: 70, baseType: !521, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !502, file: !503, line: 72, baseType: !214, size: 32, offset: 896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !502, file: !503, line: 73, baseType: !214, size: 32, offset: 928)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !502, file: !503, line: 74, baseType: !525, size: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !398, line: 152, baseType: !427)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !502, file: !503, line: 77, baseType: !527, size: 16, offset: 1024)
!527 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !502, file: !503, line: 78, baseType: !529, size: 8, offset: 1040)
!529 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !502, file: !503, line: 79, baseType: !185, size: 8, offset: 1048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !502, file: !503, line: 81, baseType: !532, size: 64, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !503, line: 43, baseType: null)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !502, file: !503, line: 89, baseType: !535, size: 64, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !398, line: 153, baseType: !427)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !502, file: !503, line: 91, baseType: !537, size: 64, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !503, line: 37, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !502, file: !503, line: 92, baseType: !540, size: 64, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !503, line: 38, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !502, file: !503, line: 93, baseType: !521, size: 64, offset: 1344)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !502, file: !503, line: 94, baseType: !296, size: 64, offset: 1408)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !502, file: !503, line: 95, baseType: !225, size: 64, offset: 1472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !502, file: !503, line: 96, baseType: !214, size: 32, offset: 1536)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !502, file: !503, line: 98, baseType: !19, size: 160, offset: 1568)
!547 = !DILocalVariable(name: "i", scope: !548, file: !2, line: 4831, type: !225)
!548 = distinct !DILexicalBlock(scope: !549, file: !2, line: 4831, column: 11)
!549 = distinct !DILexicalBlock(scope: !550, file: !2, line: 4827, column: 9)
!550 = distinct !DILexicalBlock(scope: !497, file: !2, line: 4826, column: 11)
!551 = !DILocalVariable(name: "file_number", scope: !552, file: !2, line: 4843, type: !227)
!552 = distinct !DILexicalBlock(scope: !553, file: !2, line: 4839, column: 17)
!553 = distinct !DILexicalBlock(scope: !554, file: !2, line: 4838, column: 24)
!554 = distinct !DILexicalBlock(scope: !555, file: !2, line: 4833, column: 19)
!555 = distinct !DILexicalBlock(scope: !556, file: !2, line: 4832, column: 13)
!556 = distinct !DILexicalBlock(scope: !548, file: !2, line: 4831, column: 11)
!557 = !DILocalVariable(name: "tmp_dir", scope: !558, file: !2, line: 4920, type: !236)
!558 = distinct !DILexicalBlock(scope: !559, file: !2, line: 4919, column: 5)
!559 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4918, column: 7)
!560 = !DILocalVariable(name: "sortfiles", scope: !561, file: !2, line: 4963, type: !563)
!561 = distinct !DILexicalBlock(scope: !562, file: !2, line: 4962, column: 5)
!562 = distinct !DILexicalBlock(scope: !211, file: !2, line: 4961, column: 7)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !2, line: 720, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !2, line: 723, baseType: !236, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !564, file: !2, line: 726, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !2, line: 368, size: 128, elements: !570)
!570 = !{!571, !573, !576, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !2, line: 370, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !568)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !569, file: !2, line: 371, baseType: !574, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !575, line: 38, baseType: !397)
!575 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!576 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !569, file: !2, line: 372, baseType: !4, size: 8, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !2, line: 373, baseType: !285, offset: 104)
!578 = !DILocalVariable(name: "i", scope: !579, file: !2, line: 4965, type: !225)
!579 = distinct !DILexicalBlock(scope: !561, file: !2, line: 4965, column: 7)
!580 = !DILocalVariable(name: "np", scope: !581, file: !2, line: 4974, type: !227)
!581 = distinct !DILexicalBlock(scope: !582, file: !2, line: 4973, column: 9)
!582 = distinct !DILexicalBlock(scope: !583, file: !2, line: 4972, column: 11)
!583 = distinct !DILexicalBlock(scope: !562, file: !2, line: 4971, column: 5)
!584 = !DILocalVariable(name: "nthreads_max", scope: !583, file: !2, line: 4979, type: !225)
!585 = !{!586}
!586 = !DIEnumerator(name: "nsigs", value: 22)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !2, line: 161, baseType: !203, size: 32, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIEnumerator(name: "bl_start", value: 0)
!590 = !DIEnumerator(name: "bl_end", value: 1)
!591 = !DIEnumerator(name: "bl_both", value: 2)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 597, baseType: !203, size: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "CHECK_OPTION", value: 256)
!595 = !DIEnumerator(name: "COMPRESS_PROGRAM_OPTION", value: 257)
!596 = !DIEnumerator(name: "DEBUG_PROGRAM_OPTION", value: 258)
!597 = !DIEnumerator(name: "FILES0_FROM_OPTION", value: 259)
!598 = !DIEnumerator(name: "NMERGE_OPTION", value: 260)
!599 = !DIEnumerator(name: "RANDOM_SOURCE_OPTION", value: 261)
!600 = !DIEnumerator(name: "SORT_OPTION", value: 262)
!601 = !DIEnumerator(name: "PARALLEL_OPTION", value: 263)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 337, baseType: !203, size: 32, elements: !603)
!603 = !{!604}
!604 = !DIEnumerator(name: "TAB_DEFAULT", value: 256)
!605 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !606, line: 337, baseType: !214, size: 32, elements: !607)
!606 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!607 = !{!608, !609}
!608 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!609 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !611, line: 42, baseType: !203, size: 32, elements: !612)
!611 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!613 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!614 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!615 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!616 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!617 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!618 = !DIEnumerator(name: "c_quoting_style", value: 5)
!619 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!620 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!621 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!622 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!623 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !625, line: 32, baseType: !203, size: 32, elements: !626)
!625 = !DIFile(filename: "./lib/nproc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dd1b9803a99598e46cd95fdfb7d0bf6e")
!626 = !{!627, !628, !629}
!627 = !DIEnumerator(name: "NPROC_ALL", value: 0)
!628 = !DIEnumerator(name: "NPROC_CURRENT", value: 1)
!629 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 107, baseType: !203, size: 32, elements: !631)
!631 = !{!632}
!632 = !DIEnumerator(name: "DEFAULT_MAX_THREADS", value: 8)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 46, baseType: !203, size: 32, elements: !635)
!634 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!636 = !DIEnumerator(name: "_ISupper", value: 256)
!637 = !DIEnumerator(name: "_ISlower", value: 512)
!638 = !DIEnumerator(name: "_ISalpha", value: 1024)
!639 = !DIEnumerator(name: "_ISdigit", value: 2048)
!640 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!641 = !DIEnumerator(name: "_ISspace", value: 8192)
!642 = !DIEnumerator(name: "_ISprint", value: 16384)
!643 = !DIEnumerator(name: "_ISgraph", value: 32768)
!644 = !DIEnumerator(name: "_ISblank", value: 1)
!645 = !DIEnumerator(name: "_IScntrl", value: 2)
!646 = !DIEnumerator(name: "_ISpunct", value: 4)
!647 = !DIEnumerator(name: "_ISalnum", value: 8)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !649, line: 41, baseType: !203, size: 32, elements: !650)
!649 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!651 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!652 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!653 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!654 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!655 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!656 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!657 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!658 = !DIEnumerator(name: "DAY_1", value: 131079)
!659 = !DIEnumerator(name: "DAY_2", value: 131080)
!660 = !DIEnumerator(name: "DAY_3", value: 131081)
!661 = !DIEnumerator(name: "DAY_4", value: 131082)
!662 = !DIEnumerator(name: "DAY_5", value: 131083)
!663 = !DIEnumerator(name: "DAY_6", value: 131084)
!664 = !DIEnumerator(name: "DAY_7", value: 131085)
!665 = !DIEnumerator(name: "ABMON_1", value: 131086)
!666 = !DIEnumerator(name: "ABMON_2", value: 131087)
!667 = !DIEnumerator(name: "ABMON_3", value: 131088)
!668 = !DIEnumerator(name: "ABMON_4", value: 131089)
!669 = !DIEnumerator(name: "ABMON_5", value: 131090)
!670 = !DIEnumerator(name: "ABMON_6", value: 131091)
!671 = !DIEnumerator(name: "ABMON_7", value: 131092)
!672 = !DIEnumerator(name: "ABMON_8", value: 131093)
!673 = !DIEnumerator(name: "ABMON_9", value: 131094)
!674 = !DIEnumerator(name: "ABMON_10", value: 131095)
!675 = !DIEnumerator(name: "ABMON_11", value: 131096)
!676 = !DIEnumerator(name: "ABMON_12", value: 131097)
!677 = !DIEnumerator(name: "MON_1", value: 131098)
!678 = !DIEnumerator(name: "MON_2", value: 131099)
!679 = !DIEnumerator(name: "MON_3", value: 131100)
!680 = !DIEnumerator(name: "MON_4", value: 131101)
!681 = !DIEnumerator(name: "MON_5", value: 131102)
!682 = !DIEnumerator(name: "MON_6", value: 131103)
!683 = !DIEnumerator(name: "MON_7", value: 131104)
!684 = !DIEnumerator(name: "MON_8", value: 131105)
!685 = !DIEnumerator(name: "MON_9", value: 131106)
!686 = !DIEnumerator(name: "MON_10", value: 131107)
!687 = !DIEnumerator(name: "MON_11", value: 131108)
!688 = !DIEnumerator(name: "MON_12", value: 131109)
!689 = !DIEnumerator(name: "AM_STR", value: 131110)
!690 = !DIEnumerator(name: "PM_STR", value: 131111)
!691 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!692 = !DIEnumerator(name: "D_FMT", value: 131113)
!693 = !DIEnumerator(name: "T_FMT", value: 131114)
!694 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!695 = !DIEnumerator(name: "ERA", value: 131116)
!696 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!697 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!698 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!699 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!700 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!701 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!702 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!703 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!704 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!705 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!706 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!707 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!708 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!709 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!710 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!711 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!712 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!713 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!714 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!715 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!716 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!717 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!718 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!719 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!720 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!721 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!722 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!723 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!724 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!725 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!726 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!727 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!728 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!729 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!730 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!731 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!732 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!733 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!734 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!735 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!736 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!737 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!738 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!739 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!740 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!741 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!742 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!743 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!744 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!745 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!746 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!747 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!748 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!749 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!750 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!751 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!752 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!753 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!754 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!755 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!756 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!757 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!758 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!759 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!760 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!761 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!762 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!763 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!764 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!765 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!766 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!767 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!768 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!769 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!770 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!771 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!772 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!773 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!774 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!775 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!776 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!777 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!778 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!779 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!780 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!781 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!782 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!783 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!784 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!785 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!786 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!787 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!788 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!789 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!790 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!791 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!792 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!793 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!794 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!795 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!796 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!797 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!798 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!799 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!800 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!801 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!802 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!803 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!804 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!805 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!806 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!807 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!808 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!809 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!810 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!811 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!812 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!813 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!814 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!815 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!816 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!817 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!818 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!819 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!820 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!821 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!822 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!823 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!824 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!825 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!826 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!827 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!828 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!829 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!830 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!831 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!832 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!833 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!834 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!835 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!836 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!837 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!838 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!839 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!840 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!841 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!842 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!843 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!844 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!845 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!846 = !DIEnumerator(name: "CODESET", value: 14)
!847 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!848 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!849 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!850 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!857 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!858 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!859 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!860 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!861 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!862 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!863 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!864 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!865 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!866 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!867 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!868 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!869 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!870 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!871 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!872 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!877 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!878 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!879 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!880 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!881 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!882 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!883 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!884 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!885 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!886 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!887 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!888 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!889 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!890 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!891 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!892 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!893 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!894 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!895 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!896 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!897 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!898 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!899 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!900 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!901 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!902 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!903 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!904 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!905 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!906 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!907 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!908 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!909 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!910 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!911 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!912 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!913 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!914 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!915 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!916 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!917 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!918 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!919 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!920 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!921 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!922 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!923 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!924 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!925 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!926 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!927 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!928 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!929 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!930 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!931 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!932 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!933 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!934 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!935 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!936 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!937 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!938 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!939 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!940 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!942 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!945 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!946 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!947 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!948 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!949 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!950 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!951 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!952 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!953 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!954 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!955 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!956 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!957 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!958 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!959 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!960 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!961 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!962 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!963 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!964 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!965 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!966 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!967 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!968 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!969 = !DIEnumerator(name: "THOUSEP", value: 65537)
!970 = !DIEnumerator(name: "__GROUPING", value: 65538)
!971 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!972 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!973 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!974 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!975 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!976 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!977 = !DIEnumerator(name: "__YESSTR", value: 327682)
!978 = !DIEnumerator(name: "__NOSTR", value: 327683)
!979 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!980 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!981 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!982 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!983 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!984 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!985 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!986 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!987 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!988 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!989 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!990 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!991 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!992 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!993 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!994 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!995 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!996 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!997 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!998 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!999 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1000 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1001 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1002 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1003 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1004 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1005 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1006 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1007 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1008 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1009 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1010 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1011 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1012 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1013 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1014 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1015 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1016 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1017 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1018 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1019 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1020 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1021 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1022 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1023 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1024 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1025 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1026 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1027 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1028 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1029 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1030 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1031 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1032 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1033 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1034 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !1035, line: 30, baseType: !203, size: 32, elements: !1036)
!1035 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!1036 = !{!1037, !1038, !1039, !1040, !1041}
!1037 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!1038 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!1039 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!1040 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!1041 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!1042 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !1043, line: 31, baseType: !203, size: 32, elements: !1044)
!1043 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1045 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!1046 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!1047 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!1048 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!1049 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!1050 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!1051 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!1052 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!1053 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!1054 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!1055 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!1056 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!1057 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!1058 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!1059 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!1060 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!1061 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!1062 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!1063 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!1064 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1065, line: 44, baseType: !203, size: 32, elements: !1066)
!1065 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!1068 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!1069 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!1070 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!1071 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!1072 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!1073 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1074, file: !606, line: 209, baseType: !203, size: 32, elements: !1082)
!1074 = distinct !DISubprogram(name: "select_plural", scope: !606, file: !606, line: 205, type: !1075, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !200, retainedNodes: !1080)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!227, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1078, line: 102, baseType: !1079)
!1078 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !398, line: 73, baseType: !227)
!1080 = !{!1081}
!1081 = !DILocalVariable(name: "n", arg: 1, scope: !1074, file: !606, line: 205, type: !1077)
!1082 = !{!1083}
!1083 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!1084 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 717, baseType: !203, size: 32, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIEnumerator(name: "UNCOMPRESSED", value: 0)
!1087 = !DIEnumerator(name: "UNREAPED", value: 1)
!1088 = !DIEnumerator(name: "REAPED", value: 2)
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 121, baseType: !203, size: 32, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIEnumerator(name: "MAX_TRIES_COMPRESS", value: 4)
!1092 = !DIEnumerator(name: "MAX_TRIES_DECOMPRESS", value: 9)
!1093 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 732, baseType: !203, size: 32, elements: !1094)
!1094 = !{!1095}
!1095 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47)
!1096 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 135, baseType: !203, size: 32, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIEnumerator(name: "MERGE_END", value: 0)
!1099 = !DIEnumerator(name: "MERGE_ROOT", value: 1)
!1100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 102, baseType: !203, size: 32, elements: !1101)
!1101 = !{!1102}
!1102 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072)
!1103 = !{!296, !368, !1104, !216, !214, !527, !225, !236, !1106, !234, !227, !1107}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1106 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!1109 = !{!0, !7, !12, !17, !22, !27, !32, !37, !39, !41, !46, !51, !56, !61, !66, !71, !76, !81, !86, !91, !96, !98, !103, !108, !113, !118, !123, !125, !130, !132, !137, !142, !147, !149, !151, !156, !158, !163, !168, !173, !178, !183, !188, !193, !1110, !1115, !1117, !1122, !1127, !1132, !1137, !1142, !1144, !1149, !1151, !1153, !1158, !1163, !1165, !1167, !1172, !1174, !1179, !1184, !1189, !1194, !1199, !1204, !1206, !1211, !1213, !1215, !1220, !1222, !1224, !1226, !1228, !1233, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !198, !1252, !1254, !1256, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1277, !1281, !1286, !1291, !1321, !1323, !1325, !1327, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1360, !1362, !1364, !1369, !1374, !1379, !1381, !1383, !1385, !1387, !1389, !1394, !1396, !1398, !1400, !1405, !1410, !1412, !1417, !1419, !1421, !1424, !1426, !1428, !1430, !1432, !1434, !1436, !1438, !1440, !1442, !1444, !1446, !1448, !1455, !1460, !1462, !1465, !1467, !1469, !1471, !1473, !1475, !1477, !1479, !1481, !1486, !1488, !1490, !1495, !1497, !1499, !1501, !1503, !1505, !1507, !1509, !1511, !1513, !1515, !1517, !1519, !1521, !1523, !1528, !1530, !1532, !1544, !1549, !1554, !1557, !1559, !1561, !1563, !1565, !1567, !1571, !1574, !1576, !1578, !1580, !1583, !1585, !1587, !1590, !1592, !1594, !1599, !1601, !1603, !1605, !1608, !1610, !1612, !1614, !1616, !1621, !1623, !1628, !1669, !1671, !1673, !1675, !1677, !1679, !1681, !1686, !1691, !1693, !1695, !1697, !1699, !1704, !1706, !1711, !1716, !1718, !1723, !1725, !1727, !1743, !1745, !1747, !1749, !1751, !1753, !1755, !1758, !1763, !1768, !1770, !1772, !1774, !1776, !1778, !1780, !1786, !1788, !1790, !1792, !1794, !1799, !1801, !1803, !1806, !1821, !1823, !1825, !1845, !1847, !1849, !1873, !1875, !1883, !1885}
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4576, type: !1112, isLocal: true, isDefinition: true)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 25)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4579, type: !1112, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4592, type: !1119, isLocal: true, isDefinition: true)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 30)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4604, type: !1124, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 7)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4627, type: !1129, isLocal: true, isDefinition: true)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 8)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4633, type: !1134, isLocal: true, isDefinition: true)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 3)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4639, type: !1139, isLocal: true, isDefinition: true)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 37)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4656, type: !1119, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4660, type: !1146, isLocal: true, isDefinition: true)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 21)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4669, type: !1112, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4684, type: !1112, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4712, type: !1155, isLocal: true, isDefinition: true)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 32)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4718, type: !1160, isLocal: true, isDefinition: true)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1161)
!1161 = !{!1162}
!1162 = !DISubrange(count: 34)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4734, type: !190, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4737, type: !1134, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4745, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 23)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4750, type: !88, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4793, type: !1176, isLocal: true, isDefinition: true)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 14)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4793, type: !1181, isLocal: true, isDefinition: true)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1182)
!1182 = !{!1183}
!1183 = !DISubrange(count: 13)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4793, type: !1186, isLocal: true, isDefinition: true)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !1187)
!1187 = !{!1188}
!1188 = !DISubrange(count: 12)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4811, type: !1191, isLocal: true, isDefinition: true)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 17)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4812, type: !1196, isLocal: true, isDefinition: true)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !1197)
!1197 = !{!1198}
!1198 = !DISubrange(count: 4)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4812, type: !1201, isLocal: true, isDefinition: true)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1202)
!1202 = !{!1203}
!1203 = !DISubrange(count: 52)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4817, type: !488, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4822, type: !1208, isLocal: true, isDefinition: true)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1209)
!1209 = !{!1210}
!1210 = !DISubrange(count: 31)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4833, type: !488, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4834, type: !43, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4844, type: !1217, isLocal: true, isDefinition: true)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !1218)
!1218 = !{!1219}
!1219 = !DISubrange(count: 38)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4851, type: !1191, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(name: "opts", scope: !211, file: !2, line: 4889, type: !190, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4902, type: !1134, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4902, type: !1146, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4904, type: !1230, isLocal: true, isDefinition: true)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !1231)
!1231 = !{!1232}
!1232 = !DISubrange(count: 47)
!1233 = !DIGlobalVariableExpression(var: !1234, expr: !DIExpression())
!1234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4907, type: !1235, isLocal: true, isDefinition: true)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !1236)
!1236 = !{!1237}
!1237 = !DISubrange(count: 53)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4920, type: !1124, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4940, type: !1217, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "opts", scope: !211, file: !2, line: 4945, type: !1134, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4986, type: !1181, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(name: "decimal_point", scope: !200, file: !2, line: 145, type: !4, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !200, file: !2, line: 148, type: !214, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(name: "thousands_sep_ignored", scope: !200, file: !2, line: 150, type: !234, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !200, file: !2, line: 155, type: !234, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "sort_size", scope: !200, file: !2, line: 307, type: !225, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !200, file: !2, line: 320, type: !1258, isLocal: true, isDefinition: true)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1259, line: 130, baseType: !1260)
!1259 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !226, line: 35, baseType: !427)
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(name: "reverse", scope: !200, file: !2, line: 326, type: !234, isLocal: true, isDefinition: true)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "stable", scope: !200, file: !2, line: 331, type: !234, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(name: "unique", scope: !200, file: !2, line: 346, type: !234, isLocal: true, isDefinition: true)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !200, file: !2, line: 349, type: !234, isLocal: true, isDefinition: true)
!1269 = !DIGlobalVariableExpression(var: !1270, expr: !DIExpression())
!1270 = distinct !DIGlobalVariable(name: "keylist", scope: !200, file: !2, line: 352, type: !221, isLocal: true, isDefinition: true)
!1271 = !DIGlobalVariableExpression(var: !1272, expr: !DIExpression())
!1272 = distinct !DIGlobalVariable(name: "compress_program", scope: !200, file: !2, line: 355, type: !236, isLocal: true, isDefinition: true)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(name: "debug", scope: !200, file: !2, line: 358, type: !234, isLocal: true, isDefinition: true)
!1275 = !DIGlobalVariableExpression(var: !1276, expr: !DIExpression())
!1276 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !200, file: !2, line: 365, type: !234, isLocal: true, isDefinition: true)
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(name: "caught_signals", scope: !200, file: !2, line: 686, type: !1279, isLocal: true, isDefinition: true)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !1280, line: 7, baseType: !457)
!1280 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(scope: null, file: !606, line: 729, type: !1283, isLocal: true, isDefinition: true)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !1284)
!1284 = !{!1285}
!1285 = !DISubrange(count: 56)
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(scope: null, file: !606, line: 736, type: !1288, isLocal: true, isDefinition: true)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !1289)
!1289 = !{!1290}
!1290 = !DISubrange(count: 75)
!1291 = !DIGlobalVariableExpression(var: !1292, expr: !DIExpression())
!1292 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !1293, file: !606, line: 575, type: !214, isLocal: true, isDefinition: true)
!1293 = distinct !DISubprogram(name: "oputs_", scope: !606, file: !606, line: 573, type: !1294, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !200, retainedNodes: !1296)
!1294 = !DISubroutineType(cc: DW_CC_nocall, types: !1295)
!1295 = !{null, !236, !236}
!1296 = !{!1297, !1298, !1299, !1302, !1303, !1304, !1305, !1309, !1310, !1311, !1312, !1314, !1315, !1316, !1317, !1319, !1320}
!1297 = !DILocalVariable(name: "program", arg: 1, scope: !1293, file: !606, line: 573, type: !236)
!1298 = !DILocalVariable(name: "option", arg: 2, scope: !1293, file: !606, line: 573, type: !236)
!1299 = !DILocalVariable(name: "term", scope: !1300, file: !606, line: 585, type: !236)
!1300 = distinct !DILexicalBlock(scope: !1301, file: !606, line: 582, column: 5)
!1301 = distinct !DILexicalBlock(scope: !1293, file: !606, line: 581, column: 7)
!1302 = !DILocalVariable(name: "double_space", scope: !1293, file: !606, line: 594, type: !234)
!1303 = !DILocalVariable(name: "first_word", scope: !1293, file: !606, line: 595, type: !236)
!1304 = !DILocalVariable(name: "option_text", scope: !1293, file: !606, line: 596, type: !236)
!1305 = !DILocalVariable(name: "s", scope: !1306, file: !606, line: 608, type: !236)
!1306 = distinct !DILexicalBlock(scope: !1307, file: !606, line: 605, column: 5)
!1307 = distinct !DILexicalBlock(scope: !1308, file: !606, line: 604, column: 12)
!1308 = distinct !DILexicalBlock(scope: !1293, file: !606, line: 597, column: 7)
!1309 = !DILocalVariable(name: "spaces", scope: !1306, file: !606, line: 609, type: !225)
!1310 = !DILocalVariable(name: "anchor_len", scope: !1293, file: !606, line: 620, type: !225)
!1311 = !DILocalVariable(name: "desc_text", scope: !1293, file: !606, line: 625, type: !236)
!1312 = !DILocalVariable(name: "__ptr", scope: !1313, file: !606, line: 644, type: !236)
!1313 = distinct !DILexicalBlock(scope: !1293, file: !606, line: 644, column: 3)
!1314 = !DILocalVariable(name: "__stream", scope: !1313, file: !606, line: 644, type: !499)
!1315 = !DILocalVariable(name: "__cnt", scope: !1313, file: !606, line: 644, type: !225)
!1316 = !DILocalVariable(name: "url_program", scope: !1293, file: !606, line: 648, type: !236)
!1317 = !DILocalVariable(name: "__ptr", scope: !1318, file: !606, line: 686, type: !236)
!1318 = distinct !DILexicalBlock(scope: !1293, file: !606, line: 686, column: 3)
!1319 = !DILocalVariable(name: "__stream", scope: !1318, file: !606, line: 686, type: !499)
!1320 = !DILocalVariable(name: "__cnt", scope: !1318, file: !606, line: 686, type: !225)
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(scope: null, file: !606, line: 585, type: !24, isLocal: true, isDefinition: true)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(scope: null, file: !606, line: 586, type: !24, isLocal: true, isDefinition: true)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(scope: null, file: !606, line: 595, type: !1196, isLocal: true, isDefinition: true)
!1327 = !DIGlobalVariableExpression(var: !1328, expr: !DIExpression())
