; ModuleID = 'src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.numname = type { i32, [8 x i8] }
%struct.__mbstate_t = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.posix_spawnattr_t = type { i16, i32, %struct.__sigset_t, %struct.__sigset_t, %struct.sched_param, i32, [16 x i32] }
%struct.__sigset_t = type { [16 x i64] }
%struct.posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon }
%union.anon = type { fp128 }


!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 20)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1623, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 63)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 28)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1637, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1656, type: !293, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1664, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 64)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1670, type: !340, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1672, type: !240, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1684, type: !264, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1701, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 31)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1750, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 184, elements: !272)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "filter_command", scope: !110, file: !2, line: 56, type: !216, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "filter_pid", scope: !110, file: !2, line: 59, type: !373, isLocal: true, isDefinition: true)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !374, line: 97, baseType: !375)
!374 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !203, line: 154, baseType: !107)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !110, file: !2, line: 67, type: !206, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "outfile", scope: !110, file: !2, line: 73, type: !109, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "suffix_length", scope: !110, file: !2, line: 83, type: !382, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !383, line: 130, baseType: !384)
!383 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !215, line: 35, baseType: !204)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !110, file: !2, line: 89, type: !216, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !110, file: !2, line: 92, type: !216, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !110, file: !2, line: 98, type: !391, isLocal: true, isDefinition: true)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !392, line: 44, size: 1024, elements: !393)
!392 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!393 = !{!394, !396, !398, !400, !402, !404, !406, !407, !408, !409, !411, !412, !414, !422, !423, !424}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !391, file: !392, line: 46, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !203, line: 145, baseType: !207)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !391, file: !392, line: 47, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !203, line: 148, baseType: !207)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !391, file: !392, line: 48, baseType: !399, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !203, line: 150, baseType: !113)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !391, file: !392, line: 49, baseType: !401, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !203, line: 151, baseType: !113)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !391, file: !392, line: 50, baseType: !403, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !203, line: 146, baseType: !113)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !391, file: !392, line: 51, baseType: !405, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !203, line: 147, baseType: !113)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !391, file: !392, line: 52, baseType: !395, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !391, file: !392, line: 53, baseType: !395, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !391, file: !392, line: 54, baseType: !202, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !391, file: !392, line: 55, baseType: !410, size: 32, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !203, line: 175, baseType: !107)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !391, file: !392, line: 56, baseType: !107, size: 32, offset: 480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !391, file: !392, line: 57, baseType: !413, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !203, line: 180, baseType: !204)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !391, file: !392, line: 65, baseType: !415, size: 128, offset: 576)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !416, line: 11, size: 128, elements: !417)
!416 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !415, file: !416, line: 16, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !203, line: 160, baseType: !204)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !415, file: !416, line: 21, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !203, line: 197, baseType: !204)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !391, file: !392, line: 66, baseType: !415, size: 128, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !391, file: !392, line: 67, baseType: !415, size: 128, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !391, file: !392, line: 79, baseType: !425, size: 64, offset: 960)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !341)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "verbose", scope: !110, file: !2, line: 105, type: !206, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !110, file: !2, line: 108, type: !206, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "unbuffered", scope: !110, file: !2, line: 112, type: !206, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !156, line: 729, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 56)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !156, line: 736, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 75)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !444, file: !156, line: 575, type: !107, isLocal: true, isDefinition: true)
!444 = distinct !DISubprogram(name: "oputs_", scope: !156, file: !156, line: 573, type: !445, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !447)
!445 = !DISubroutineType(cc: DW_CC_nocall, types: !446)
!446 = !{null, !216, !216}
!447 = !{!448, !449, !450, !453, !454, !455, !456, !460, !461, !462, !463, !465, !511, !512, !513, !515, !516}
!448 = !DILocalVariable(name: "program", arg: 1, scope: !444, file: !156, line: 573, type: !216)
!449 = !DILocalVariable(name: "option", arg: 2, scope: !444, file: !156, line: 573, type: !216)
!450 = !DILocalVariable(name: "term", scope: !451, file: !156, line: 585, type: !216)
!451 = distinct !DILexicalBlock(scope: !452, file: !156, line: 582, column: 5)
!452 = distinct !DILexicalBlock(scope: !444, file: !156, line: 581, column: 7)
!453 = !DILocalVariable(name: "double_space", scope: !444, file: !156, line: 594, type: !206)
!454 = !DILocalVariable(name: "first_word", scope: !444, file: !156, line: 595, type: !216)
!455 = !DILocalVariable(name: "option_text", scope: !444, file: !156, line: 596, type: !216)
!456 = !DILocalVariable(name: "s", scope: !457, file: !156, line: 608, type: !216)
!457 = distinct !DILexicalBlock(scope: !458, file: !156, line: 605, column: 5)
!458 = distinct !DILexicalBlock(scope: !459, file: !156, line: 604, column: 12)
!459 = distinct !DILexicalBlock(scope: !444, file: !156, line: 597, column: 7)
!460 = !DILocalVariable(name: "spaces", scope: !457, file: !156, line: 609, type: !214)
!461 = !DILocalVariable(name: "anchor_len", scope: !444, file: !156, line: 620, type: !214)
!462 = !DILocalVariable(name: "desc_text", scope: !444, file: !156, line: 625, type: !216)
!463 = !DILocalVariable(name: "__ptr", scope: !464, file: !156, line: 644, type: !216)
!464 = distinct !DILexicalBlock(scope: !444, file: !156, line: 644, column: 3)
!465 = !DILocalVariable(name: "__stream", scope: !464, file: !156, line: 644, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !468, line: 7, baseType: !469)
!468 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !470, line: 49, size: 1728, elements: !471)
!470 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !487, !489, !490, !491, !492, !493, !494, !495, !498, !500, !503, !506, !507, !508, !509, !510}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !470, line: 51, baseType: !107, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !470, line: 54, baseType: !109, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !470, line: 55, baseType: !109, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !470, line: 56, baseType: !109, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !470, line: 57, baseType: !109, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !470, line: 58, baseType: !109, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !470, line: 59, baseType: !109, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !470, line: 60, baseType: !109, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !470, line: 61, baseType: !109, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !470, line: 64, baseType: !109, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !470, line: 65, baseType: !109, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !470, line: 66, baseType: !109, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !470, line: 68, baseType: !485, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !470, line: 36, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !470, line: 70, baseType: !488, size: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !470, line: 72, baseType: !107, size: 32, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !470, line: 73, baseType: !107, size: 32, offset: 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !470, line: 74, baseType: !202, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !470, line: 77, baseType: !205, size: 16, offset: 1024)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !470, line: 78, baseType: !221, size: 8, offset: 1040)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !470, line: 79, baseType: !225, size: 8, offset: 1048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !470, line: 81, baseType: !496, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !470, line: 43, baseType: null)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !470, line: 89, baseType: !499, size: 64, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !204)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !470, line: 91, baseType: !501, size: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !470, line: 37, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !470, line: 92, baseType: !504, size: 64, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !470, line: 38, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !470, line: 93, baseType: !488, size: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !470, line: 94, baseType: !208, size: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !470, line: 95, baseType: !214, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !470, line: 96, baseType: !107, size: 32, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !470, line: 98, baseType: !325, size: 160, offset: 1568)
!511 = !DILocalVariable(name: "__cnt", scope: !464, file: !156, line: 644, type: !214)
!512 = !DILocalVariable(name: "url_program", scope: !444, file: !156, line: 648, type: !216)
!513 = !DILocalVariable(name: "__ptr", scope: !514, file: !156, line: 686, type: !216)
!514 = distinct !DILexicalBlock(scope: !444, file: !156, line: 686, column: 3)
!515 = !DILocalVariable(name: "__stream", scope: !514, file: !156, line: 686, type: !466)
!516 = !DILocalVariable(name: "__cnt", scope: !514, file: !156, line: 686, type: !214)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !156, line: 585, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 5)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !156, line: 586, type: !519, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !156, line: 595, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 4)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !156, line: 620, type: !16, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !340, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !156, line: 648, type: !519, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !526, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !156, line: 649, type: !264, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !156, line: 650, type: !519, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !156, line: 651, type: !16, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !156, line: 652, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 7)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !156, line: 653, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 8)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !156, line: 654, type: !230, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !156, line: 655, type: !230, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !156, line: 656, type: !230, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !156, line: 657, type: !230, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !156, line: 663, type: !547, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !156, line: 664, type: !230, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !293, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !156, line: 669, type: !283, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 15)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !156, line: 676, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 61)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !156, line: 679, type: !264, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !156, line: 683, type: !519, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !156, line: 688, type: !519, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !156, line: 691, type: !552, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !156, line: 744, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 216)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !156, line: 839, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 16)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !156, line: 840, type: !245, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !156, line: 841, type: !573, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !156, line: 862, type: !526, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !156, line: 868, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 71)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !156, line: 875, type: !240, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 51)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !156, line: 877, type: !363, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !16, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !16, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 138, type: !288, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 139, type: !547, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !315, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !288, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !310, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !315, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !293, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 13)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !547, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !552, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !230, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !363, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !519, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !552, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "longopts", scope: !110, file: !2, line: 134, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 4352, elements: !294)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !659, line: 50, size: 256, elements: !660)
!659 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!660 = !{!661, !662, !663, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !659, line: 52, baseType: !216, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !658, file: !659, line: 55, baseType: !107, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !659, line: 56, baseType: !664, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !658, file: !659, line: 57, baseType: !107, size: 32, offset: 192)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1363, type: !547, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1396, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 25)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1398, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 21)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "eolchar", scope: !110, file: !2, line: 115, type: !107, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !240, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !110, file: !2, line: 86, type: !216, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 209, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 42)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !110, file: !2, line: 80, type: !206, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "infile", scope: !110, file: !2, line: 95, type: !216, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !340, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "outbase", scope: !110, file: !2, line: 70, type: !216, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "sufindex", scope: !699, file: !2, line: 409, type: !712, isLocal: true, isDefinition: true)
!699 = distinct !DISubprogram(name: "next_file_name", scope: !2, file: !2, line: 406, type: !700, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{null}
!702 = !{!703, !706, !707, !708, !711, !713, !715}
!703 = !DILocalVariable(name: "overflow", scope: !704, file: !2, line: 416, type: !206)
!704 = distinct !DILexicalBlock(scope: !705, file: !2, line: 415, column: 5)
!705 = distinct !DILexicalBlock(scope: !699, file: !2, line: 414, column: 7)
!706 = !DILocalVariable(name: "widen", scope: !704, file: !2, line: 416, type: !206)
!707 = !DILocalVariable(name: "outfile_size", scope: !704, file: !2, line: 441, type: !382)
!708 = !DILocalVariable(name: "i", scope: !709, file: !2, line: 470, type: !382)
!709 = distinct !DILexicalBlock(scope: !710, file: !2, line: 466, column: 9)
!710 = distinct !DILexicalBlock(scope: !704, file: !2, line: 465, column: 11)
!711 = !DILocalVariable(name: "sufindex_end", scope: !709, file: !2, line: 474, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!713 = !DILocalVariable(name: "i", scope: !714, file: !2, line: 497, type: !382)
!714 = distinct !DILexicalBlock(scope: !705, file: !2, line: 494, column: 5)
!715 = !DILabel(scope: !704, name: "new_name", file: !2, line: 418)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "outbase_length", scope: !699, file: !2, line: 410, type: !382, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "outfile_length", scope: !699, file: !2, line: 411, type: !382, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !699, file: !2, line: 412, type: !382, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !552, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 208, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 26)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !358, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !110, file: !2, line: 77, type: !109, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !315, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 532, type: !315, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 534, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 35)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 538, type: !675, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !519, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !283, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !2, line: 548, type: !235, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 569, type: !255, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !245, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 592, type: !670, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 595, type: !16, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !552, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !2, line: 598, type: !264, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !255, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 611, type: !240, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !110, file: !2, line: 64, type: !107, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "open_pipes", scope: !110, file: !2, line: 62, type: !664, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !110, file: !2, line: 63, type: !382, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !596, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1074, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 608, elements: !64)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !363, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !2, line: 945, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 592, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 74)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !156, line: 952, type: !363, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1197, type: !340, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !727)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 654, type: !264, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 41)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 664, type: !3, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !739, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "output_desc", scope: !110, file: !2, line: 101, type: !107, isLocal: true, isDefinition: true)
!804 = !{!805, !806, !807, !808, !809, !810, !814, !815, !816, !817, !818, !820, !823, !825, !826, !829}
!805 = !DILocalVariable(name: "argc", arg: 1, scope: !104, file: !2, line: 1407, type: !107)
!806 = !DILocalVariable(name: "argv", arg: 2, scope: !104, file: !2, line: 1407, type: !108)
!807 = !DILocalVariable(name: "split_type", scope: !104, file: !2, line: 1409, type: !112)
!808 = !DILocalVariable(name: "in_blk_size", scope: !104, file: !2, line: 1410, type: !382)
!809 = !DILocalVariable(name: "page_size", scope: !104, file: !2, line: 1411, type: !382)
!810 = !DILocalVariable(name: "k_units", scope: !104, file: !2, line: 1412, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !812, line: 101, baseType: !813)
!812 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !203, line: 72, baseType: !204)
!814 = !DILocalVariable(name: "n_units", scope: !104, file: !2, line: 1413, type: !811)
!815 = !DILocalVariable(name: "c", scope: !104, file: !2, line: 1416, type: !107)
!816 = !DILocalVariable(name: "digits_optind", scope: !104, file: !2, line: 1417, type: !107)
!817 = !DILocalVariable(name: "file_size", scope: !104, file: !2, line: 1418, type: !200)
!818 = !DILocalVariable(name: "this_optind", scope: !819, file: !2, line: 1433, type: !107)
!819 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1431, column: 5)
!820 = !DILocalVariable(name: "suffix_len", scope: !821, file: !2, line: 1449, type: !107)
!821 = distinct !DILexicalBlock(scope: !822, file: !2, line: 1448, column: 11)
!822 = distinct !DILexicalBlock(scope: !819, file: !2, line: 1441, column: 9)
!823 = !DILocalVariable(name: "neweol", scope: !824, file: !2, line: 1512, type: !4)
!824 = distinct !DILexicalBlock(scope: !822, file: !2, line: 1511, column: 11)
!825 = !DILocalVariable(name: "buf", scope: !104, file: !2, line: 1693, type: !109)
!826 = !DILocalVariable(name: "initial_read", scope: !104, file: !2, line: 1694, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !201, line: 77, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !203, line: 194, baseType: !204)
!829 = !DILocalVariable(name: "files", scope: !830, file: !2, line: 1744, type: !832)
!830 = distinct !DILexicalBlock(scope: !831, file: !2, line: 1743, column: 7)
!831 = distinct !DILexicalBlock(scope: !104, file: !2, line: 1712, column: 5)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "of_t", file: !2, line: 1122, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "of_info", file: !2, line: 1116, size: 256, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "of_name", scope: !834, file: !2, line: 1118, baseType: !109, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ofd", scope: !834, file: !2, line: 1119, baseType: !107, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ofile", scope: !834, file: !2, line: 1120, baseType: !466, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "opid", scope: !834, file: !2, line: 1121, baseType: !373, size: 32, offset: 192)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 120, elements: !574)
!841 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!842 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!843 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!844 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "tempfile", scope: !847, file: !848, line: 86, type: !109, isLocal: true, isDefinition: true)
!847 = distinct !DISubprogram(name: "temp_stream", scope: !848, file: !848, line: 84, type: !849, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !886, retainedNodes: !907)
!848 = !DIFile(filename: "src/temp-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8878e64e34a1409e8108ead719db2042")
!849 = !DISubroutineType(types: !850)
!850 = !{!206, !851, !108}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !468, line: 7, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !470, line: 49, size: 1728, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !854, file: !470, line: 51, baseType: !107, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !854, file: !470, line: 54, baseType: !109, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !854, file: !470, line: 55, baseType: !109, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !854, file: !470, line: 56, baseType: !109, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !854, file: !470, line: 57, baseType: !109, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !854, file: !470, line: 58, baseType: !109, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !854, file: !470, line: 59, baseType: !109, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !854, file: !470, line: 60, baseType: !109, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !854, file: !470, line: 61, baseType: !109, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !854, file: !470, line: 64, baseType: !109, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !854, file: !470, line: 65, baseType: !109, size: 64, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !854, file: !470, line: 66, baseType: !109, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !854, file: !470, line: 68, baseType: !485, size: 64, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !854, file: !470, line: 70, baseType: !870, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !854, file: !470, line: 72, baseType: !107, size: 32, offset: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !854, file: !470, line: 73, baseType: !107, size: 32, offset: 928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !854, file: !470, line: 74, baseType: !202, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !854, file: !470, line: 77, baseType: !205, size: 16, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !854, file: !470, line: 78, baseType: !221, size: 8, offset: 1040)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !854, file: !470, line: 79, baseType: !225, size: 8, offset: 1048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !854, file: !470, line: 81, baseType: !496, size: 64, offset: 1088)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !854, file: !470, line: 89, baseType: !499, size: 64, offset: 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !854, file: !470, line: 91, baseType: !501, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !854, file: !470, line: 92, baseType: !504, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !854, file: !470, line: 93, baseType: !870, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !854, file: !470, line: 94, baseType: !208, size: 64, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !854, file: !470, line: 95, baseType: !214, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !854, file: !470, line: 96, baseType: !107, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !854, file: !470, line: 98, baseType: !325, size: 160, offset: 1568)
!886 = distinct !DICompileUnit(language: DW_LANG_C11, file: !848, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !887, retainedTypes: !888, globals: !889, splitDebugInlining: false, nameTableKind: None)
!887 = !{!160}
!888 = !{!208}
!889 = !{!845, !890, !892, !894, !896, !898, !900, !905}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !847, file: !848, line: 87, type: !852, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !848, line: 97, type: !739, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !848, line: 101, type: !16, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !848, line: 128, type: !739, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !848, line: 133, type: !264, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !848, line: 136, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 30)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !848, line: 154, type: !358, isLocal: true, isDefinition: true)
!907 = !{!908, !909, !910, !913, !914, !915}
!908 = !DILocalVariable(name: "fp", arg: 1, scope: !847, file: !848, line: 84, type: !851)
!909 = !DILocalVariable(name: "file_name", arg: 2, scope: !847, file: !848, line: 84, type: !108)
!910 = !DILocalVariable(name: "tempbuf", scope: !911, file: !848, line: 90, type: !109)
!911 = distinct !DILexicalBlock(scope: !912, file: !848, line: 89, column: 5)
!912 = distinct !DILexicalBlock(scope: !847, file: !848, line: 88, column: 7)
!913 = !DILocalVariable(name: "tempbuf_len", scope: !911, file: !848, line: 91, type: !214)
!914 = !DILocalVariable(name: "fd", scope: !911, file: !848, line: 125, type: !107)
!915 = !DILabel(scope: !916, name: "Reset", file: !848, line: 140)
!916 = distinct !DILexicalBlock(scope: !917, file: !848, line: 135, column: 9)
!917 = distinct !DILexicalBlock(scope: !911, file: !848, line: 134, column: 11)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !920, line: 3, type: !573, isLocal: true, isDefinition: true)
!920 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "Version", scope: !923, file: !920, line: 3, type: !216, isLocal: false, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !920, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !924, splitDebugInlining: false, nameTableKind: None)
!924 = !{!918, !921}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "file_name", scope: !927, file: !928, line: 45, type: !216, isLocal: true, isDefinition: true)
!927 = distinct !DICompileUnit(language: DW_LANG_C11, file: !928, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!929 = !{!930, !932, !934, !936, !925, !938}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !547, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !928, line: 121, type: !363, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !928, line: 123, type: !547, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !928, line: 126, type: !264, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !927, file: !928, line: 55, type: !206, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !942, file: !943, line: 66, type: !990, isLocal: false, isDefinition: true)
!942 = distinct !DICompileUnit(language: DW_LANG_C11, file: !943, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !944, globals: !945, splitDebugInlining: false, nameTableKind: None)
!943 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!944 = !{!208, !218}
!945 = !{!946, !948, !972, !974, !976, !978, !940, !980, !982, !984, !986, !988}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !943, line: 272, type: !519, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "old_file_name", scope: !950, file: !943, line: 304, type: !216, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "verror_at_line", scope: !943, file: !943, line: 298, type: !951, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !942, retainedNodes: !965)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !107, !107, !216, !113, !216, !953}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !201, line: 52, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !955, line: 14, baseType: !956)
!955 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !957, baseType: !958)
!957 = !DIFile(filename: "lib/error.c", directory: "/src")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !959)
!959 = !{!960, !961, !962, !963, !964}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !958, file: !957, baseType: !208, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !958, file: !957, baseType: !208, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !958, file: !957, baseType: !208, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !958, file: !957, baseType: !107, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !958, file: !957, baseType: !107, size: 32, offset: 224)
!965 = !{!966, !967, !968, !969, !970, !971}
!966 = !DILocalVariable(name: "status", arg: 1, scope: !950, file: !943, line: 298, type: !107)
!967 = !DILocalVariable(name: "errnum", arg: 2, scope: !950, file: !943, line: 298, type: !107)
!968 = !DILocalVariable(name: "file_name", arg: 3, scope: !950, file: !943, line: 298, type: !216)
!969 = !DILocalVariable(name: "line_number", arg: 4, scope: !950, file: !943, line: 298, type: !113)
!970 = !DILocalVariable(name: "message", arg: 5, scope: !950, file: !943, line: 298, type: !216)
!971 = !DILocalVariable(name: "args", arg: 6, scope: !950, file: !943, line: 298, type: !953)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "old_line_number", scope: !950, file: !943, line: 305, type: !113, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !943, line: 338, type: !526, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !552, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !943, line: 346, type: !340, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "error_message_count", scope: !942, file: !943, line: 69, type: !113, isLocal: false, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !942, file: !943, line: 295, type: !107, isLocal: false, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !547, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !943, line: 208, type: !675, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !943, line: 214, type: !519, isLocal: true, isDefinition: true)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "program_name", scope: !993, file: !994, line: 31, type: !216, isLocal: false, isDefinition: true)
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !994, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !995, globals: !996, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!995 = !{!109}
!996 = !{!991, !997, !999}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !994, line: 46, type: !552, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !994, line: 49, type: !526, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1003, file: !1004, line: 46, type: !1031, isLocal: true, isDefinition: true)
!1003 = distinct !DISubprogram(name: "proper_name_lite", scope: !1004, file: !1004, line: 38, type: !1005, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1007, retainedNodes: !1009)
!1004 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!216, !216, !216}
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1004, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1008 = !{!1001}
!1009 = !{!1010, !1011, !1012, !1013, !1018}
!1010 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1003, file: !1004, line: 38, type: !216)
!1011 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1003, file: !1004, line: 38, type: !216)
!1012 = !DILocalVariable(name: "translation", scope: !1003, file: !1004, line: 40, type: !216)
!1013 = !DILocalVariable(name: "w", scope: !1003, file: !1004, line: 47, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1015, line: 37, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !203, line: 57, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !203, line: 42, baseType: !113)
!1018 = !DILocalVariable(name: "mbs", scope: !1003, file: !1004, line: 48, type: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1021)
!1020 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1023)
!1022 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1023, file: !1022, line: 15, baseType: !107, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1023, file: !1022, line: 20, baseType: !1027, size: 32, offset: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !1022, line: 16, size: 32, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1027, file: !1022, line: 18, baseType: !113, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1027, file: !1022, line: 19, baseType: !526, size: 32)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 16, elements: !341)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 78, type: !552, isLocal: true, isDefinition: true)
!1034 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 79, type: !16, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 80, type: !639, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 81, type: !639, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 82, type: !325, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 83, type: !340, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 84, type: !552, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 85, type: !547, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 86, type: !547, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 87, type: !552, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1055, file: !1034, line: 76, type: !1127, isLocal: false, isDefinition: true)
!1055 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1056, retainedTypes: !1062, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!1056 = !{!160, !1057, !129}
!1057 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !161, line: 254, baseType: !113, size: 32, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1060 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1061 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1062 = !{!107, !205, !214}
!1063 = !{!1032, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1064, !1068, !1078, !1080, !1085, !1087, !1089, !1091, !1093, !1116, !1123, !1125}
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1055, file: !1034, line: 92, type: !1066, isLocal: false, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 320, elements: !231)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1055, file: !1034, line: 1040, type: !1070, isLocal: false, isDefinition: true)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1034, line: 56, size: 448, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1076, !1077}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1070, file: !1034, line: 59, baseType: !160, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1070, file: !1034, line: 62, baseType: !107, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1070, file: !1034, line: 66, baseType: !1075, size: 256, offset: 64)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, elements: !553)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1070, file: !1034, line: 69, baseType: !216, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1070, file: !1034, line: 72, baseType: !216, size: 64, offset: 384)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1055, file: !1034, line: 107, type: !1070, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "slot0", scope: !1055, file: !1034, line: 831, type: !1082, isLocal: true, isDefinition: true)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 256)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 321, type: !340, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 357, type: !340, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 358, type: !340, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1034, line: 199, type: !547, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(name: "quote", scope: !1095, file: !1034, line: 228, type: !1114, isLocal: true, isDefinition: true)
!1095 = distinct !DISubprogram(name: "gettext_quote", scope: !1034, file: !1034, line: 197, type: !1096, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1055, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!216, !216, !160}
!1098 = !{!1099, !1100, !1101, !1102, !1103}
!1099 = !DILocalVariable(name: "msgid", arg: 1, scope: !1095, file: !1034, line: 197, type: !216)
!1100 = !DILocalVariable(name: "s", arg: 2, scope: !1095, file: !1034, line: 197, type: !160)
!1101 = !DILocalVariable(name: "translation", scope: !1095, file: !1034, line: 199, type: !216)
!1102 = !DILocalVariable(name: "w", scope: !1095, file: !1034, line: 229, type: !1014)
!1103 = !DILocalVariable(name: "mbs", scope: !1095, file: !1034, line: 230, type: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1106, file: !1022, line: 15, baseType: !107, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1106, file: !1022, line: 20, baseType: !1110, size: 32, offset: 32)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1106, file: !1022, line: 16, size: 32, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1110, file: !1022, line: 18, baseType: !113, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1110, file: !1022, line: 19, baseType: !526, size: 32)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !1115)
!1115 = !{!342, !528}
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "slotvec", scope: !1055, file: !1034, line: 834, type: !1118, isLocal: true, isDefinition: true)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1034, line: 823, size: 128, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !1034, line: 825, baseType: !214, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1119, file: !1034, line: 826, baseType: !109, size: 64, offset: 64)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "nslots", scope: !1055, file: !1034, line: 832, type: !107, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1055, file: !1034, line: 833, type: !1119, isLocal: true, isDefinition: true)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 704, elements: !289)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(name: "numname_table", scope: !1131, file: !1132, line: 43, type: !1141, isLocal: true, isDefinition: true)
!1131 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1132, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1133, globals: !1134, splitDebugInlining: false, nameTableKind: None)
!1132 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!1133 = !{!113}
!1134 = !{!1135, !1137, !1139, !1129}
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1132, line: 351, type: !16, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1132, line: 356, type: !16, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1132, line: 362, type: !526, isLocal: true, isDefinition: true)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 3360, elements: !740)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !1132, line: 43, size: 96, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1142, file: !1132, line: 43, baseType: !107, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1142, file: !1132, line: 43, baseType: !1146, size: 64, offset: 32)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !553)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1149, line: 98, type: !519, isLocal: true, isDefinition: true)
!1149 = !DIFile(filename: "lib/tmpdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6bb1205c798131b3318a3c96a85b8877")
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(scope: null, file: !1149, line: 110, type: !547, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !1149, line: 132, type: !519, isLocal: true, isDefinition: true)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(scope: null, file: !1149, line: 160, type: !363, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 67, type: !363, isLocal: true, isDefinition: true)
!1158 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 69, type: !547, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 83, type: !547, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 83, type: !526, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 85, type: !340, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 88, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 171)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 88, type: !255, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 105, type: !596, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 109, type: !271, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 113, type: !335, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 120, type: !1182, isLocal: true, isDefinition: true)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 32)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 127, type: !1187, isLocal: true, isDefinition: true)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 36)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 134, type: !283, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 142, type: !1194, isLocal: true, isDefinition: true)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 44)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 150, type: !250, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 159, type: !1201, isLocal: true, isDefinition: true)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1202)
!1202 = !{!1203}
!1203 = !DISubrange(count: 52)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 170, type: !31, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 248, type: !325, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 248, type: !245, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 254, type: !325, isLocal: true, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 254, type: !310, isLocal: true, isDefinition: true)
!1214 = !DIGlobalVariableExpression(var: !1215, expr: !DIExpression())
!1215 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 254, type: !283, isLocal: true, isDefinition: true)
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 259, type: !3, isLocal: true, isDefinition: true)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 259, type: !278, isLocal: true, isDefinition: true)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1222, file: !1223, line: 26, type: !1225, isLocal: false, isDefinition: true)
!1222 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1223, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1224, splitDebugInlining: false, nameTableKind: None)
!1223 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1224 = !{!1220}
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 376, elements: !304)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1228, file: !1229, line: 24, type: !1231, isLocal: false, isDefinition: true)
!1228 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1229, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1230, splitDebugInlining: false, nameTableKind: None)
!1229 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1230 = !{!1226}
!1231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !1234, line: 34, type: !264, isLocal: true, isDefinition: true)
!1234 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(scope: null, file: !1234, line: 34, type: !547, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1234, line: 34, type: !293, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1241, line: 80, type: !547, isLocal: true, isDefinition: true)
!1241 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1241, line: 80, type: !547, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 108, type: !225, isLocal: true, isDefinition: true)
!1246 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(name: "internal_state", scope: !1249, file: !1246, line: 97, type: !1252, isLocal: true, isDefinition: true)
!1249 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1246, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1250, globals: !1251, splitDebugInlining: false, nameTableKind: None)
!1250 = !{!208, !214, !218}
!1251 = !{!1244, !1247}
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1020, line: 6, baseType: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1022, line: 21, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 13, size: 64, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1254, file: !1022, line: 15, baseType: !107, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1254, file: !1022, line: 20, baseType: !1258, size: 32, offset: 32)
!1258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1254, file: !1022, line: 16, size: 32, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1258, file: !1022, line: 18, baseType: !113, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1258, file: !1022, line: 19, baseType: !526, size: 32)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1264, file: !1265, line: 506, type: !107, isLocal: true, isDefinition: true)
!1264 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1265, file: !1265, line: 485, type: !1266, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1268, retainedNodes: !1270)
!1265 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!107, !107, !107}
!1268 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1265, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1269, splitDebugInlining: false, nameTableKind: None)
!1269 = !{!1262}
!1270 = !{!1271, !1272, !1273, !1274, !1277}
!1271 = !DILocalVariable(name: "fd", arg: 1, scope: !1264, file: !1265, line: 485, type: !107)
!1272 = !DILocalVariable(name: "target", arg: 2, scope: !1264, file: !1265, line: 485, type: !107)
!1273 = !DILocalVariable(name: "result", scope: !1264, file: !1265, line: 487, type: !107)
!1274 = !DILocalVariable(name: "flags", scope: !1275, file: !1265, line: 530, type: !107)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !1265, line: 529, column: 5)
!1276 = distinct !DILexicalBlock(scope: !1264, file: !1265, line: 528, column: 7)
!1277 = !DILocalVariable(name: "saved_errno", scope: !1278, file: !1265, line: 533, type: !107)
!1278 = distinct !DILexicalBlock(scope: !1279, file: !1265, line: 532, column: 9)
!1279 = distinct !DILexicalBlock(scope: !1275, file: !1265, line: 531, column: 11)
!1280 = !DIGlobalVariableExpression(var: !1281, expr: !DIExpression())
!1281 = distinct !DIGlobalVariable(scope: null, file: !1282, line: 35, type: !340, isLocal: true, isDefinition: true)
!1282 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1282, line: 35, type: !16, isLocal: true, isDefinition: true)
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(scope: null, file: !1287, line: 202, type: !547, isLocal: true, isDefinition: true)
!1287 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1290, file: !1287, line: 211, type: !1473, isLocal: true, isDefinition: true)
!1290 = distinct !DISubprogram(name: "printf_fetchargs", scope: !1287, file: !1287, line: 42, type: !1291, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1465, retainedNodes: !1468)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!107, !1293, !1303}
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !955, line: 22, baseType: !1294)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1295, baseType: !1296)
!1295 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1302}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1296, file: !1295, baseType: !208, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1296, file: !1295, baseType: !208, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1296, file: !1295, baseType: !208, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1296, file: !1295, baseType: !107, size: 32, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1296, file: !1295, baseType: !107, size: 32, offset: 224)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1305, line: 185, baseType: !1306)
!1305 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1305, line: 179, size: 1920, elements: !1307)
!1307 = !{!1308, !1309, !1463}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1306, file: !1305, line: 181, baseType: !214, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1306, file: !1305, line: 182, baseType: !1310, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1305, line: 174, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1305, line: 111, size: 256, elements: !1313)
!1313 = !{!1314, !1365}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1312, file: !1305, line: 113, baseType: !1315, size: 32)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1305, line: 108, baseType: !1316)
!1316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1305, line: 47, baseType: !113, size: 32, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1318 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1319 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1320 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1321 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1322 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1323 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1324 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1325 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1326 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1327 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1328 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1329 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1330 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1331 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1332 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1333 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1334 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1335 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1336 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1337 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1338 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1339 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1340 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1341 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1342 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1343 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1344 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1345 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1346 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1347 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1348 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1349 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1350 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1351 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1352 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1353 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1354 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1355 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1356 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1357 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1358 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1359 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1360 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1361 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1362 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
