; ModuleID = 'src/stdbuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.anon = type { i64, i32, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.allocator = type { ptr, ptr, ptr, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.8 }
%union.anon.8 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... COMMAND\0A\00", align 1, !dbg !7

!116 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!117 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!118 = !{!119, !122, !123, !91, !124, !125, !127}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !121)
!120 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!121 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!124 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !41, !46, !48, !53, !58, !63, !68, !73, !129, !134, !139, !144, !149, !154, !159, !164, !166, !171, !173, !178, !183, !185, !187, !197, !199, !282, !287, !289, !294, !299, !301, !303, !305, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !335, !340, !342, !344, !346, !348, !350, !352, !357, !359, !364, !366, !368, !373, !378, !383, !388, !390, !392, !394, !396, !78, !398, !400, !402, !407, !409, !411, !413, !415, !417, !422, !424, !426, !428, !433, !435}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 90)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 13)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 184, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 23)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 45)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 355, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 16)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 14)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !161, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 15)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 374, type: !156, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 41)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 25)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !180, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "program_path", scope: !80, file: !2, line: 38, type: !122, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "stdbuf", scope: !80, file: !2, line: 45, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 576, elements: !195)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 40, size: 192, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !190, file: !2, line: 42, baseType: !119, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "optc", scope: !190, file: !2, line: 43, baseType: !91, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "optarg", scope: !190, file: !2, line: 44, baseType: !122, size: 64, offset: 128)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !83, line: 736, type: !14, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !201, file: !83, line: 575, type: !91, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "oputs_", scope: !83, file: !83, line: 573, type: !202, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !204)
!202 = !DISubroutineType(cc: DW_CC_nocall, types: !203)
!203 = !{null, !125, !125}
!204 = !{!205, !206, !207, !210, !212, !213, !214, !218, !219, !220, !221, !223, !276, !277, !278, !280, !281}
!205 = !DILocalVariable(name: "program", arg: 1, scope: !201, file: !83, line: 573, type: !125)
!206 = !DILocalVariable(name: "option", arg: 2, scope: !201, file: !83, line: 573, type: !125)
!207 = !DILocalVariable(name: "term", scope: !208, file: !83, line: 585, type: !125)
!208 = distinct !DILexicalBlock(scope: !209, file: !83, line: 582, column: 5)
!209 = distinct !DILexicalBlock(scope: !201, file: !83, line: 581, column: 7)
!210 = !DILocalVariable(name: "double_space", scope: !201, file: !83, line: 594, type: !211)
!211 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DILocalVariable(name: "first_word", scope: !201, file: !83, line: 595, type: !125)
!213 = !DILocalVariable(name: "option_text", scope: !201, file: !83, line: 596, type: !125)
!214 = !DILocalVariable(name: "s", scope: !215, file: !83, line: 608, type: !125)
!215 = distinct !DILexicalBlock(scope: !216, file: !83, line: 605, column: 5)
!216 = distinct !DILexicalBlock(scope: !217, file: !83, line: 604, column: 12)
!217 = distinct !DILexicalBlock(scope: !201, file: !83, line: 597, column: 7)
!218 = !DILocalVariable(name: "spaces", scope: !215, file: !83, line: 609, type: !119)
!219 = !DILocalVariable(name: "anchor_len", scope: !201, file: !83, line: 620, type: !119)
!220 = !DILocalVariable(name: "desc_text", scope: !201, file: !83, line: 625, type: !125)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !83, line: 644, type: !125)
!222 = distinct !DILexicalBlock(scope: !201, file: !83, line: 644, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !83, line: 644, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !226, line: 7, baseType: !227)
!226 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !228, line: 49, size: 1728, elements: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !245, !247, !248, !249, !253, !254, !256, !257, !260, !262, !265, !268, !269, !270, !271, !272}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !227, file: !228, line: 51, baseType: !91, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !227, file: !228, line: 54, baseType: !122, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !227, file: !228, line: 55, baseType: !122, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !227, file: !228, line: 56, baseType: !122, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !227, file: !228, line: 57, baseType: !122, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !227, file: !228, line: 58, baseType: !122, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !227, file: !228, line: 59, baseType: !122, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !227, file: !228, line: 60, baseType: !122, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !227, file: !228, line: 61, baseType: !122, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !227, file: !228, line: 64, baseType: !122, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !227, file: !228, line: 65, baseType: !122, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !227, file: !228, line: 66, baseType: !122, size: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !227, file: !228, line: 68, baseType: !243, size: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !228, line: 36, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !227, file: !228, line: 70, baseType: !246, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !227, file: !228, line: 72, baseType: !91, size: 32, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !227, file: !228, line: 73, baseType: !91, size: 32, offset: 928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !227, file: !228, line: 74, baseType: !250, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !251, line: 152, baseType: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!252 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !227, file: !228, line: 77, baseType: !124, size: 16, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !227, file: !228, line: 78, baseType: !255, size: 8, offset: 1040)
!255 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !227, file: !228, line: 79, baseType: !60, size: 8, offset: 1048)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !227, file: !228, line: 81, baseType: !258, size: 64, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !228, line: 43, baseType: null)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !227, file: !228, line: 89, baseType: !261, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !251, line: 153, baseType: !252)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !227, file: !228, line: 91, baseType: !263, size: 64, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !228, line: 37, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !227, file: !228, line: 92, baseType: !266, size: 64, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !228, line: 38, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !227, file: !228, line: 93, baseType: !246, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !227, file: !228, line: 94, baseType: !123, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !227, file: !228, line: 95, baseType: !119, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !227, file: !228, line: 96, baseType: !91, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !227, file: !228, line: 98, baseType: !273, size: 160, offset: 1568)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 20)
!276 = !DILocalVariable(name: "__cnt", scope: !222, file: !83, line: 644, type: !119)
!277 = !DILocalVariable(name: "url_program", scope: !201, file: !83, line: 648, type: !125)
!278 = !DILocalVariable(name: "__ptr", scope: !279, file: !83, line: 686, type: !125)
!279 = distinct !DILexicalBlock(scope: !201, file: !83, line: 686, column: 3)
!280 = !DILocalVariable(name: "__stream", scope: !279, file: !83, line: 686, type: !224)
!281 = !DILocalVariable(name: "__cnt", scope: !279, file: !83, line: 686, type: !119)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !83, line: 585, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !83, line: 586, type: !284, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !83, line: 595, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 4)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !83, line: 620, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 6)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !83, line: 648, type: !151, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !83, line: 648, type: !284, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !83, line: 649, type: !291, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !83, line: 649, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !195)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !83, line: 650, type: !284, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !83, line: 651, type: !296, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !83, line: 651, type: !296, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !83, line: 652, type: !19, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !83, line: 653, type: !75, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !83, line: 654, type: !65, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !83, line: 655, type: !65, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !83, line: 656, type: !65, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !83, line: 657, type: !65, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !83, line: 663, type: !19, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !83, line: 664, type: !65, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !83, line: 669, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 17)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !83, line: 669, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 40)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !83, line: 676, type: !168, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !83, line: 676, type: !24, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !83, line: 679, type: !307, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !83, line: 683, type: !284, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !83, line: 688, type: !284, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !83, line: 691, type: !75, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !83, line: 826, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 180)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !83, line: 839, type: !156, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !83, line: 840, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 22)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !83, line: 841, type: !168, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !83, line: 862, type: !291, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !83, line: 868, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 71)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !83, line: 875, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 27)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !83, line: 877, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 51)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !83, line: 877, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 12)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !296, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !19, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !296, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !284, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !75, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !136, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 293, type: !19, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 293, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 9)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !404, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !175, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !168, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 151, type: !284, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 154, type: !151, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 202, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 11)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !9, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !136, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 241, type: !296, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 18)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !404, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !296, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 1536, elements: !297)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !440, line: 50, size: 256, elements: !441)
!440 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!441 = !{!442, !443, !444, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !440, line: 52, baseType: !125, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !439, file: !440, line: 55, baseType: !91, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !439, file: !440, line: 56, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !439, file: !440, line: 57, baseType: !91, size: 32, offset: 192)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !449, line: 3, type: !168, isLocal: true, isDefinition: true)
!449 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "Version", scope: !452, file: !449, line: 3, type: !125, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C11, file: !449, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !453, splitDebugInlining: false, nameTableKind: None)
!453 = !{!447, !450}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "file_name", scope: !456, file: !457, line: 45, type: !125, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!458 = !{!459, !461, !463, !465, !454, !467}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !457, line: 121, type: !19, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !457, line: 121, type: !385, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !457, line: 123, type: !19, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !457, line: 126, type: !307, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !456, file: !457, line: 55, type: !211, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !471, file: !472, line: 66, type: !523, isLocal: false, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C11, file: !472, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !473, globals: !474, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!473 = !{!123, !127}
!474 = !{!475, !477, !502, !504, !506, !508, !469, !510, !512, !514, !516, !521}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !472, line: 272, type: !284, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "old_file_name", scope: !479, file: !472, line: 304, type: !125, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "verror_at_line", scope: !472, file: !472, line: 298, type: !480, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !495)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !91, !91, !125, !84, !125, !482}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !483, line: 52, baseType: !484)
!483 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !485, line: 14, baseType: !486)
!485 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !487, baseType: !488)
!487 = !DIFile(filename: "lib/error.c", directory: "/src")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !489)
!489 = !{!490, !491, !492, !493, !494}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !488, file: !487, baseType: !123, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !488, file: !487, baseType: !123, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !488, file: !487, baseType: !123, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !488, file: !487, baseType: !91, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !488, file: !487, baseType: !91, size: 32, offset: 224)
!495 = !{!496, !497, !498, !499, !500, !501}
!496 = !DILocalVariable(name: "status", arg: 1, scope: !479, file: !472, line: 298, type: !91)
!497 = !DILocalVariable(name: "errnum", arg: 2, scope: !479, file: !472, line: 298, type: !91)
!498 = !DILocalVariable(name: "file_name", arg: 3, scope: !479, file: !472, line: 298, type: !125)
!499 = !DILocalVariable(name: "line_number", arg: 4, scope: !479, file: !472, line: 298, type: !84)
!500 = !DILocalVariable(name: "message", arg: 5, scope: !479, file: !472, line: 298, type: !125)
!501 = !DILocalVariable(name: "args", arg: 6, scope: !479, file: !472, line: 298, type: !482)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "old_line_number", scope: !479, file: !472, line: 305, type: !84, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !472, line: 338, type: !291, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !472, line: 346, type: !75, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !472, line: 346, type: !151, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "error_message_count", scope: !471, file: !472, line: 69, type: !84, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !471, file: !472, line: 295, type: !91, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !472, line: 208, type: !19, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !472, line: 208, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 21)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !472, line: 214, type: !284, isLocal: true, isDefinition: true)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "program_name", scope: !528, file: !529, line: 31, type: !125, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C11, file: !529, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !530, globals: !531, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!530 = !{!122}
!531 = !{!526, !532, !534}
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !529, line: 46, type: !75, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !529, line: 49, type: !291, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "utf07FF", scope: !538, file: !539, line: 46, type: !566, isLocal: true, isDefinition: true)
!538 = distinct !DISubprogram(name: "proper_name_lite", scope: !539, file: !539, line: 38, type: !540, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !544)
!539 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!540 = !DISubroutineType(types: !541)
!541 = !{!125, !125, !125}
!542 = distinct !DICompileUnit(language: DW_LANG_C11, file: !539, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !543, splitDebugInlining: false, nameTableKind: None)
!543 = !{!536}
!544 = !{!545, !546, !547, !548, !553}
!545 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !538, file: !539, line: 38, type: !125)
!546 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !538, file: !539, line: 38, type: !125)
!547 = !DILocalVariable(name: "translation", scope: !538, file: !539, line: 40, type: !125)
!548 = !DILocalVariable(name: "w", scope: !538, file: !539, line: 47, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !550, line: 37, baseType: !551)
!550 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !251, line: 57, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !251, line: 42, baseType: !84)
!553 = !DILocalVariable(name: "mbs", scope: !538, file: !539, line: 48, type: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !556)
!555 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !558)
!557 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !558, file: !557, line: 15, baseType: !91, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !558, file: !557, line: 20, baseType: !562, size: 32, offset: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !557, line: 16, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !562, file: !557, line: 18, baseType: !84, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !562, file: !557, line: 19, baseType: !291, size: 32)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 16, elements: !152)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !569, line: 78, type: !75, isLocal: true, isDefinition: true)
!569 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !569, line: 79, type: !296, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !569, line: 80, type: !136, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !569, line: 81, type: !136, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !569, line: 82, type: !273, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !569, line: 83, type: !151, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !569, line: 84, type: !75, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !569, line: 85, type: !19, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !569, line: 86, type: !19, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !569, line: 87, type: !75, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !590, file: !569, line: 76, type: !676, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C11, file: !569, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !591, retainedTypes: !611, globals: !612, splitDebugInlining: false, nameTableKind: None)
!591 = !{!592, !606, !95}
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !593, line: 42, baseType: !84, size: 32, elements: !594)
!593 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!595 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!596 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!597 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!598 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!599 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!600 = !DIEnumerator(name: "c_quoting_style", value: 5)
!601 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!602 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!603 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!604 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!605 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !593, line: 254, baseType: !84, size: 32, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!609 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!610 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!611 = !{!91, !124, !119}
!612 = !{!567, !570, !572, !574, !576, !578, !580, !582, !584, !586, !588, !613, !617, !627, !629, !634, !636, !638, !640, !642, !665, !672, !674}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !590, file: !569, line: 92, type: !615, isLocal: false, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 320, elements: !66)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !590, file: !569, line: 1040, type: !619, isLocal: false, isDefinition: true)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !569, line: 56, size: 448, elements: !620)
!620 = !{!621, !622, !623, !625, !626}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !619, file: !569, line: 59, baseType: !592, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !619, file: !569, line: 62, baseType: !91, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !619, file: !569, line: 66, baseType: !624, size: 256, offset: 64)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !76)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !619, file: !569, line: 69, baseType: !125, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !619, file: !569, line: 72, baseType: !125, size: 64, offset: 384)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !590, file: !569, line: 107, type: !619, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "slot0", scope: !590, file: !569, line: 831, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 256)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !569, line: 321, type: !151, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !569, line: 357, type: !151, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !569, line: 358, type: !151, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !569, line: 199, type: !19, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "quote", scope: !644, file: !569, line: 228, type: !663, isLocal: true, isDefinition: true)
!644 = distinct !DISubprogram(name: "gettext_quote", scope: !569, file: !569, line: 197, type: !645, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!125, !125, !592}
!647 = !{!648, !649, !650, !651, !652}
!648 = !DILocalVariable(name: "msgid", arg: 1, scope: !644, file: !569, line: 197, type: !125)
!649 = !DILocalVariable(name: "s", arg: 2, scope: !644, file: !569, line: 197, type: !592)
!650 = !DILocalVariable(name: "translation", scope: !644, file: !569, line: 199, type: !125)
!651 = !DILocalVariable(name: "w", scope: !644, file: !569, line: 229, type: !549)
!652 = !DILocalVariable(name: "mbs", scope: !644, file: !569, line: 230, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !655, file: !557, line: 15, baseType: !91, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !655, file: !557, line: 20, baseType: !659, size: 32, offset: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !557, line: 16, size: 32, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !659, file: !557, line: 18, baseType: !84, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !659, file: !557, line: 19, baseType: !291, size: 32)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !664)
!664 = !{!153, !293}
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "slotvec", scope: !590, file: !569, line: 834, type: !667, isLocal: true, isDefinition: true)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !569, line: 823, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !668, file: !569, line: 825, baseType: !119, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !668, file: !569, line: 826, baseType: !122, size: 64, offset: 64)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "nslots", scope: !590, file: !569, line: 832, type: !91, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "slotvec0", scope: !590, file: !569, line: 833, type: !668, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 704, elements: !420)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 67, type: !385, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !680, line: 69, type: !19, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !680, line: 83, type: !19, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !680, line: 83, type: !291, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !680, line: 85, type: !151, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !680, line: 88, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 171)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !680, line: 88, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 34)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !680, line: 105, type: !156, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !680, line: 109, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !142)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !680, line: 113, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 28)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !680, line: 120, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 32)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !680, line: 127, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 36)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !680, line: 134, type: !337, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !680, line: 142, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 44)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !680, line: 150, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 48)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !680, line: 159, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 52)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !680, line: 170, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 60)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !680, line: 248, type: !273, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !680, line: 248, type: !361, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !273, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !161, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !680, line: 254, type: !337, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !680, line: 259, type: !3, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !680, line: 259, type: !9, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !757, file: !758, line: 26, type: !760, isLocal: false, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !759, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!759 = !{!755}
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 376, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 47)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "exit_failure", scope: !765, file: !766, line: 24, type: !768, isLocal: false, isDefinition: true)
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !767, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!767 = !{!763}
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !771, line: 34, type: !307, isLocal: true, isDefinition: true)
!771 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !771, line: 34, type: !19, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !771, line: 34, type: !332, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !778, line: 108, type: !60, isLocal: true, isDefinition: true)
!778 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "internal_state", scope: !781, file: !778, line: 97, type: !784, isLocal: true, isDefinition: true)
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !782, globals: !783, splitDebugInlining: false, nameTableKind: None)
!782 = !{!123, !119, !127}
!783 = !{!776, !779}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !555, line: 6, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !557, line: 21, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 13, size: 64, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !786, file: !557, line: 15, baseType: !91, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !786, file: !557, line: 20, baseType: !790, size: 32, offset: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !786, file: !557, line: 16, size: 32, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !790, file: !557, line: 18, baseType: !84, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !790, file: !557, line: 19, baseType: !291, size: 32)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "stdlib_allocator", scope: !796, file: !797, line: 22, type: !799, isLocal: false, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !798, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/allocator.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54a9f4967f3b89b8910b08aae9f2e480")
!798 = !{!794}
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator", file: !801, line: 32, size: 256, elements: !802)
!801 = !DIFile(filename: "./lib/allocator.h", directory: "/src", checksumkind: CSK_MD5, checksum: "816cfc497daa662c0eddbd32abbb58a6")
!802 = !{!803, !807, !811, !815}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !800, file: !801, line: 42, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!123, !119}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate", scope: !800, file: !801, line: 48, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!123, !123, !119}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !800, file: !801, line: 51, baseType: !812, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !123}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !800, file: !801, line: 57, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !119}
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !821, line: 35, type: !151, isLocal: true, isDefinition: true)
!821 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !821, line: 35, type: !296, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !826, line: 202, type: !19, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !829, file: !826, line: 211, type: !1014, isLocal: true, isDefinition: true)
!829 = distinct !DISubprogram(name: "printf_fetchargs", scope: !826, file: !826, line: 42, type: !830, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1005, retainedNodes: !1009)
!830 = !DISubroutineType(types: !831)
!831 = !{!91, !832, !842}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !485, line: 22, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !834, baseType: !835)
!834 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !836)
!836 = !{!837, !838, !839, !840, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !835, file: !834, baseType: !123, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !835, file: !834, baseType: !123, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !835, file: !834, baseType: !123, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !835, file: !834, baseType: !91, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !835, file: !834, baseType: !91, size: 32, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !844, line: 185, baseType: !845)
!844 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !844, line: 179, size: 1920, elements: !846)
!846 = !{!847, !848, !1003}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !845, file: !844, line: 181, baseType: !119, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !845, file: !844, line: 182, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !844, line: 174, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !844, line: 111, size: 256, elements: !852)
!852 = !{!853, !904}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !851, file: !844, line: 113, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !844, line: 108, baseType: !855)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !844, line: 47, baseType: !84, size: 32, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!857 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!858 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!859 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!860 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!861 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!862 = !DIEnumerator(name: "TYPE_INT", value: 5)
!863 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!864 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!865 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!866 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!867 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!868 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!869 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!870 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!871 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!872 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!873 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!874 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!875 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!876 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!877 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!878 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!879 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!880 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!881 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!882 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!883 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!884 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!885 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!886 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!887 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!888 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!889 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!890 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!891 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!892 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!893 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!894 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!895 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!896 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!897 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!898 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!899 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!900 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!901 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!902 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!903 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !851, file: !844, line: 172, baseType: !905, size: 128, offset: 128)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !851, file: !844, line: 114, size: 128, elements: !906)
!906 = !{!907, !908, !909, !911, !912, !913, !914, !915, !916, !918, !920, !924, !928, !931, !934, !937, !939, !942, !945, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !968, !969, !972, !973, !977, !978, !980, !982, !983, !985, !987, !989, !991, !993, !995, !997, !999, !1001}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !905, file: !844, line: 116, baseType: !255, size: 8)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !905, file: !844, line: 117, baseType: !127, size: 8)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !905, file: !844, line: 118, baseType: !910, size: 16)
!910 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !905, file: !844, line: 119, baseType: !124, size: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !905, file: !844, line: 120, baseType: !91, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !905, file: !844, line: 121, baseType: !84, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !905, file: !844, line: 122, baseType: !252, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !905, file: !844, line: 123, baseType: !121, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !905, file: !844, line: 124, baseType: !917, size: 64)
!917 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !905, file: !844, line: 125, baseType: !919, size: 64)
!919 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !905, file: !844, line: 126, baseType: !921, size: 8)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !922, line: 24, baseType: !923)
!922 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !251, line: 37, baseType: !255)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !905, file: !844, line: 127, baseType: !925, size: 8)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 24, baseType: !927)
!926 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !251, line: 38, baseType: !127)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !905, file: !844, line: 128, baseType: !929, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !922, line: 25, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !251, line: 39, baseType: !910)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !905, file: !844, line: 129, baseType: !932, size: 16)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 25, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !251, line: 40, baseType: !124)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !905, file: !844, line: 130, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !922, line: 26, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !251, line: 41, baseType: !91)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !905, file: !844, line: 131, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 26, baseType: !552)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !905, file: !844, line: 132, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !922, line: 27, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !251, line: 44, baseType: !252)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !905, file: !844, line: 133, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 27, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !251, line: 45, baseType: !121)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !905, file: !844, line: 134, baseType: !946, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !947, line: 58, baseType: !255)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!948 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !905, file: !844, line: 135, baseType: !949, size: 8)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !947, line: 71, baseType: !127)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !905, file: !844, line: 136, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !947, line: 60, baseType: !252)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !905, file: !844, line: 137, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !947, line: 73, baseType: !121)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !905, file: !844, line: 138, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !947, line: 61, baseType: !252)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !905, file: !844, line: 139, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !947, line: 74, baseType: !121)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !905, file: !844, line: 140, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !947, line: 62, baseType: !252)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !905, file: !844, line: 141, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !947, line: 75, baseType: !121)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !905, file: !844, line: 142, baseType: !963, size: 32)
!963 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !905, file: !844, line: 143, baseType: !965, size: 64)
!965 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !905, file: !844, line: 144, baseType: !967, size: 128)
!967 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !905, file: !844, line: 145, baseType: !91, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !905, file: !844, line: 147, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !971, line: 20, baseType: !84)
!971 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !905, file: !844, line: 149, baseType: !125, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !905, file: !844, line: 150, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !120, line: 74, baseType: !84)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !905, file: !844, line: 151, baseType: !123, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !905, file: !844, line: 152, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !905, file: !844, line: 153, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !905, file: !844, line: 154, baseType: !445, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !905, file: !844, line: 155, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !905, file: !844, line: 156, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !905, file: !844, line: 157, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !905, file: !844, line: 158, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !905, file: !844, line: 159, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !905, file: !844, line: 160, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !905, file: !844, line: 161, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !905, file: !844, line: 162, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !905, file: !844, line: 163, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !905, file: !844, line: 164, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !845, file: !844, line: 183, baseType: !1004, size: 1792, offset: 128)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 1792, elements: !20)
!1005 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, retainedTypes: !1007, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1006 = !{!855}
!1007 = !{!123}
!1008 = !{!824, !827}
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DILocalVariable(name: "args", arg: 1, scope: !829, file: !826, line: 42, type: !832)
!1011 = !DILocalVariable(name: "a", arg: 2, scope: !829, file: !826, line: 42, type: !842)
!1012 = !DILocalVariable(name: "i", scope: !829, file: !826, line: 44, type: !119)
!1013 = !DILocalVariable(name: "ap", scope: !829, file: !826, line: 45, type: !849)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 224, elements: !20)
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1016, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1018, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!1019 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1020, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1020 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1021 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1022, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1023 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1024, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1024 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1025 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1026, retainedTypes: !1007, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1026 = !{!1027}
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !680, line: 40, baseType: !84, size: 32, elements: !1028)
!1028 = !{!1029}
!1029 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1030 = !{!678, !681, !683, !685, !687, !689, !694, !699, !701, !704, !709, !714, !719, !721, !726, !731, !736, !741, !743, !745, !747, !749, !751, !753}
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1032, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1033, retainedTypes: !1064, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1033 = !{!1034, !1046}
!1034 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1035, file: !1032, line: 188, baseType: !84, size: 32, elements: !1044)
!1035 = distinct !DISubprogram(name: "x2nrealloc", scope: !1032, file: !1032, line: 176, type: !1036, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1031, retainedNodes: !1039)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!123, !123, !1038, !119}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!1039 = !{!1040, !1041, !1042, !1043}
!1040 = !DILocalVariable(name: "p", arg: 1, scope: !1035, file: !1032, line: 176, type: !123)
!1041 = !DILocalVariable(name: "pn", arg: 2, scope: !1035, file: !1032, line: 176, type: !1038)
!1042 = !DILocalVariable(name: "s", arg: 3, scope: !1035, file: !1032, line: 176, type: !119)
!1043 = !DILocalVariable(name: "n", scope: !1035, file: !1032, line: 178, type: !119)
!1044 = !{!1045}
!1045 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1046 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1047, file: !1032, line: 228, baseType: !84, size: 32, elements: !1044)
!1047 = distinct !DISubprogram(name: "xpalloc", scope: !1032, file: !1032, line: 223, type: !1048, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1031, retainedNodes: !1054)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!123, !123, !1050, !1051, !1053, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1052, line: 130, baseType: !1053)
!1052 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !120, line: 35, baseType: !252)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1055 = !DILocalVariable(name: "pa", arg: 1, scope: !1047, file: !1032, line: 223, type: !123)
!1056 = !DILocalVariable(name: "pn", arg: 2, scope: !1047, file: !1032, line: 223, type: !1050)
!1057 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1047, file: !1032, line: 223, type: !1051)
!1058 = !DILocalVariable(name: "n_max", arg: 4, scope: !1047, file: !1032, line: 223, type: !1053)
!1059 = !DILocalVariable(name: "s", arg: 5, scope: !1047, file: !1032, line: 223, type: !1051)
!1060 = !DILocalVariable(name: "n0", scope: !1047, file: !1032, line: 230, type: !1051)
!1061 = !DILocalVariable(name: "n", scope: !1047, file: !1032, line: 237, type: !1051)
!1062 = !DILocalVariable(name: "nbytes", scope: !1047, file: !1032, line: 248, type: !1051)
!1063 = !DILocalVariable(name: "adjusted_nbytes", scope: !1047, file: !1032, line: 252, type: !1051)
!1064 = !{!122, !123, !211, !252, !121}
!1065 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!1066 = !{!769, !772, !774}
!1067 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1068, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1068 = !DIFile(filename: "lib/xreadlink.c", directory: "/src", checksumkind: CSK_MD5, checksum: "665e17e653dd00157df8eb1b092c6ddd")
!1069 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1070, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1071, retainedTypes: !1072, splitDebugInlining: false, nameTableKind: None)
!1070 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1071 = !{!110, !95}
!1072 = !{!91, !124, !122, !211, !121, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !947, line: 102, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !251, line: 73, baseType: !121)
!1075 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1076, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1076 = !DIFile(filename: "lib/asprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f6cf1caf6d38b23e08bf76a6bab2ad95")
!1077 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1078, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!1079 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1080, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1080 = !DIFile(filename: "lib/areadlink.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c76ae31657c32722bd051975a94b3fc")
!1081 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1082, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !530, splitDebugInlining: false, nameTableKind: None)
!1082 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1083 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1085, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "lib/careadlinkat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a2e6c863806ab2883d87f5e9821445a")
!1085 = !{!1086}
!1086 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1084, line: 40, baseType: !84, size: 32, elements: !1087)
!1087 = !{!1088}
!1088 = !DIEnumerator(name: "STACK_BUF_SIZE", value: 1024)
!1089 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1090, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1090 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1091 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1092, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1092 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1093 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1094, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1094 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1095 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1096, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1096 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1097 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1098, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1099, splitDebugInlining: false, nameTableKind: None)
!1098 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1099 = !{!211, !121, !123}
!1100 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1101, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1101 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1102 = !{!122, !119, !123, !125, !84}
!1103 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1104, splitDebugInlining: false, nameTableKind: None)
!1104 = !{!819, !822}
!1105 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1106, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1106 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1108, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1108 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1110, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, retainedTypes: !1111, splitDebugInlining: false, nameTableKind: None)
!1110 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!1111 = !{!119, !1112, !123, !1167}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !844, line: 174, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !844, line: 111, size: 256, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !844, line: 113, baseType: !854, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1114, file: !844, line: 172, baseType: !1118, size: 128, offset: 128)
!1118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1114, file: !844, line: 114, size: 128, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1118, file: !844, line: 116, baseType: !255, size: 8)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1118, file: !844, line: 117, baseType: !127, size: 8)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1118, file: !844, line: 118, baseType: !910, size: 16)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1118, file: !844, line: 119, baseType: !124, size: 16)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1118, file: !844, line: 120, baseType: !91, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1118, file: !844, line: 121, baseType: !84, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1118, file: !844, line: 122, baseType: !252, size: 64)
