; ModuleID = 'src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@.str = private unnamed_addr constant [9 x i8] c"%05d %5s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c" %s\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"%d %s\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !17
@.str.1.4 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !23
@.str.2.5 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !28
@.str.3.6 = private unnamed_addr constant [4 x i8] c"BSD\00", align 1, !dbg !30

!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1852, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 35)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1866, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 54)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1893, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 15)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !61, file: !19, line: 194, type: !224, isLocal: true, isDefinition: true)
!224 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !61, file: !19, line: 197, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !228, line: 130, baseType: !229)
!228 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !130, line: 35, baseType: !230)
!230 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !61, file: !19, line: 200, type: !227, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "sum_algorithm", scope: !61, file: !19, line: 253, type: !63, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !69, line: 729, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 56)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !242, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!242 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !243, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !245)
!243 = !DISubroutineType(cc: DW_CC_nocall, types: !244)
!244 = !{null, !131, !131}
!245 = !{!246, !247, !248, !251, !252, !253, !254, !258, !259, !260, !261, !263, !314, !315, !316, !318, !319}
!246 = !DILocalVariable(name: "program", arg: 1, scope: !242, file: !69, line: 573, type: !131)
!247 = !DILocalVariable(name: "option", arg: 2, scope: !242, file: !69, line: 573, type: !131)
!248 = !DILocalVariable(name: "term", scope: !249, file: !69, line: 585, type: !131)
!249 = distinct !DILexicalBlock(scope: !250, file: !69, line: 582, column: 5)
!250 = distinct !DILexicalBlock(scope: !242, file: !69, line: 581, column: 7)
!251 = !DILocalVariable(name: "double_space", scope: !242, file: !69, line: 594, type: !224)
!252 = !DILocalVariable(name: "first_word", scope: !242, file: !69, line: 595, type: !131)
!253 = !DILocalVariable(name: "option_text", scope: !242, file: !69, line: 596, type: !131)
!254 = !DILocalVariable(name: "s", scope: !255, file: !69, line: 608, type: !131)
!255 = distinct !DILexicalBlock(scope: !256, file: !69, line: 605, column: 5)
!256 = distinct !DILexicalBlock(scope: !257, file: !69, line: 604, column: 12)
!257 = distinct !DILexicalBlock(scope: !242, file: !69, line: 597, column: 7)
!258 = !DILocalVariable(name: "spaces", scope: !255, file: !69, line: 609, type: !129)
!259 = !DILocalVariable(name: "anchor_len", scope: !242, file: !69, line: 620, type: !129)
!260 = !DILocalVariable(name: "desc_text", scope: !242, file: !69, line: 625, type: !131)
!261 = !DILocalVariable(name: "__ptr", scope: !262, file: !69, line: 644, type: !131)
!262 = distinct !DILexicalBlock(scope: !242, file: !69, line: 644, column: 3)
!263 = !DILocalVariable(name: "__stream", scope: !262, file: !69, line: 644, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !266, line: 7, baseType: !267)
!266 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 49, size: 1728, elements: !269)
!268 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !285, !287, !288, !289, !291, !292, !294, !295, !298, !300, !303, !306, !307, !308, !309, !310}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !267, file: !268, line: 51, baseType: !70, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !267, file: !268, line: 54, baseType: !126, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !267, file: !268, line: 55, baseType: !126, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !267, file: !268, line: 56, baseType: !126, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !267, file: !268, line: 57, baseType: !126, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !267, file: !268, line: 58, baseType: !126, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !267, file: !268, line: 59, baseType: !126, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !267, file: !268, line: 60, baseType: !126, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !267, file: !268, line: 61, baseType: !126, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !267, file: !268, line: 64, baseType: !126, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !267, file: !268, line: 65, baseType: !126, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !267, file: !268, line: 66, baseType: !126, size: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !267, file: !268, line: 68, baseType: !283, size: 64, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !268, line: 36, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !267, file: !268, line: 70, baseType: !286, size: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !267, file: !268, line: 72, baseType: !70, size: 32, offset: 896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !267, file: !268, line: 73, baseType: !70, size: 32, offset: 928)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !267, file: !268, line: 74, baseType: !290, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !230)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !267, file: !268, line: 77, baseType: !128, size: 16, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !267, file: !268, line: 78, baseType: !293, size: 8, offset: 1040)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !267, file: !268, line: 79, baseType: !138, size: 8, offset: 1048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !267, file: !268, line: 81, baseType: !296, size: 64, offset: 1088)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !268, line: 43, baseType: null)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !267, file: !268, line: 89, baseType: !299, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !230)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !267, file: !268, line: 91, baseType: !301, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !268, line: 37, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !267, file: !268, line: 92, baseType: !304, size: 64, offset: 1280)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !268, line: 38, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !267, file: !268, line: 93, baseType: !286, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !267, file: !268, line: 94, baseType: !127, size: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !267, file: !268, line: 95, baseType: !129, size: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !267, file: !268, line: 96, baseType: !70, size: 32, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !267, file: !268, line: 98, baseType: !311, size: 160, offset: 1568)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 20)
!314 = !DILocalVariable(name: "__cnt", scope: !262, file: !69, line: 644, type: !129)
!315 = !DILocalVariable(name: "url_program", scope: !242, file: !69, line: 648, type: !131)
!316 = !DILocalVariable(name: "__ptr", scope: !317, file: !69, line: 686, type: !131)
!317 = distinct !DILexicalBlock(scope: !242, file: !69, line: 686, column: 3)
!318 = !DILocalVariable(name: "__stream", scope: !317, file: !69, line: 686, type: !264)
!319 = !DILocalVariable(name: "__cnt", scope: !317, file: !69, line: 686, type: !129)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 5)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !322, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !9, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !14, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !209, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !322, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !9, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !153, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !322, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !14, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 7)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !143, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !143, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !143, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !143, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !347, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !143, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 17)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !34, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !219, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 61)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !153, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !322, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !322, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !352, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !168, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 22)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !219, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !9, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 71)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 27)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 51)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 12)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !19, line: 480, type: !322, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !19, line: 483, type: !322, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !19, line: 484, type: !352, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "digest_delim", scope: !61, file: !19, line: 224, type: !133, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !61, file: !19, line: 211, type: !224, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "status_only", scope: !61, file: !19, line: 204, type: !224, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "warn", scope: !61, file: !19, line: 208, type: !224, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "quiet", scope: !61, file: !19, line: 214, type: !224, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "strict", scope: !61, file: !19, line: 218, type: !224, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "raw_digest", scope: !61, file: !19, line: 232, type: !224, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1390, type: !209, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1393, type: !153, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1410, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 28)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1440, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 47)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !352, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1461, type: !311, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !14, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1490, type: !347, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1492, type: !153, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1512, type: !219, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1520, type: !451, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 42)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1528, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 44)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 43)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1536, type: !475, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 45)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1544, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 46)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !19, line: 1552, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 25)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !61, file: !19, line: 221, type: !70, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "bin2hex", scope: !504, file: !19, line: 1345, type: !514, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "hex_equal", scope: !19, file: !19, line: 1343, type: !505, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !61, retainedNodes: !509)
!505 = !DISubroutineType(types: !506)
!506 = !{!224, !507, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !504, file: !19, line: 1343, type: !507)
!511 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !504, file: !19, line: 1343, type: !507)
!512 = !DILocalVariable(name: "digest_bin_bytes", scope: !504, file: !19, line: 1349, type: !227)
!513 = !DILocalVariable(name: "cnt", scope: !504, file: !19, line: 1353, type: !227)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, elements: !169)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !69, line: 952, type: !417, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "sumfns", scope: !61, file: !19, line: 254, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 128, elements: !210)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !521, line: 7, baseType: !522)
!521 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!70, !264, !127, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !109, line: 101, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !111, line: 72, baseType: !230)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "sum_output_fns", scope: !61, file: !19, line: 259, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 128, elements: !210)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !19, line: 244, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !131, !70, !535, !224, !224, !133, !224, !526}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 1024, elements: !10)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !540, line: 50, size: 256, elements: !541)
!540 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!541 = !{!542, !543, !544, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !539, file: !540, line: 52, baseType: !131, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !539, file: !540, line: 55, baseType: !70, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !540, line: 56, baseType: !545, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !540, line: 57, baseType: !70, size: 32, offset: 192)
!547 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!548 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !551, line: 3, type: !219, isLocal: true, isDefinition: true)
!551 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "Version", scope: !554, file: !551, line: 3, type: !131, isLocal: false, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C11, file: !551, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !555, splitDebugInlining: false, nameTableKind: None)
!555 = !{!549, !552}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "file_name", scope: !558, file: !559, line: 45, type: !131, isLocal: true, isDefinition: true)
!558 = distinct !DICompileUnit(language: DW_LANG_C11, file: !559, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!560 = !{!561, !563, !565, !567, !556, !569}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !559, line: 121, type: !347, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !559, line: 121, type: !417, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !559, line: 123, type: !347, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !559, line: 126, type: !153, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !558, file: !559, line: 55, type: !224, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !573, file: !574, line: 66, type: !625, isLocal: false, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C11, file: !574, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !575, globals: !576, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!575 = !{!127, !133}
!576 = !{!577, !579, !604, !606, !608, !610, !571, !612, !614, !616, !618, !623}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !574, line: 272, type: !322, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "old_file_name", scope: !581, file: !574, line: 304, type: !131, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "verror_at_line", scope: !574, file: !574, line: 298, type: !582, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !573, retainedNodes: !597)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !70, !70, !131, !64, !131, !584}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !585, line: 52, baseType: !586)
!585 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !587, line: 14, baseType: !588)
!587 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !589, baseType: !590)
!589 = !DIFile(filename: "lib/error.c", directory: "/src")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !590, file: !589, baseType: !127, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !590, file: !589, baseType: !127, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !590, file: !589, baseType: !127, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !590, file: !589, baseType: !70, size: 32, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !590, file: !589, baseType: !70, size: 32, offset: 224)
!597 = !{!598, !599, !600, !601, !602, !603}
!598 = !DILocalVariable(name: "status", arg: 1, scope: !581, file: !574, line: 298, type: !70)
!599 = !DILocalVariable(name: "errnum", arg: 2, scope: !581, file: !574, line: 298, type: !70)
!600 = !DILocalVariable(name: "file_name", arg: 3, scope: !581, file: !574, line: 298, type: !131)
!601 = !DILocalVariable(name: "line_number", arg: 4, scope: !581, file: !574, line: 298, type: !64)
!602 = !DILocalVariable(name: "message", arg: 5, scope: !581, file: !574, line: 298, type: !131)
!603 = !DILocalVariable(name: "args", arg: 6, scope: !581, file: !574, line: 298, type: !584)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "old_line_number", scope: !581, file: !574, line: 305, type: !64, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !574, line: 338, type: !9, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !574, line: 346, type: !352, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !574, line: 346, type: !209, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "error_message_count", scope: !573, file: !574, line: 69, type: !64, isLocal: false, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !573, file: !574, line: 295, type: !70, isLocal: false, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !574, line: 208, type: !347, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !574, line: 208, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 21)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !574, line: 214, type: !322, isLocal: true, isDefinition: true)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null}
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !630, line: 161, type: !209, isLocal: true, isDefinition: true)
!630 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !630, line: 163, type: !138, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !630, line: 233, type: !14, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !630, line: 251, type: !14, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "power_letter", scope: !639, file: !630, line: 36, type: !687, isLocal: true, isDefinition: true)
!639 = distinct !DICompileUnit(language: DW_LANG_C11, file: !630, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !662, globals: !663, splitDebugInlining: false, nameTableKind: None)
!640 = !{!641, !654}
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 47, baseType: !64, size: 32, elements: !643)
!642 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!644 = !DIEnumerator(name: "human_ceiling", value: 0)
!645 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!646 = !DIEnumerator(name: "human_floor", value: 2)
!647 = !DIEnumerator(name: "human_group_digits", value: 4)
!648 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!649 = !DIEnumerator(name: "human_autoscale", value: 16)
!650 = !DIEnumerator(name: "human_base_1024", value: 32)
!651 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!652 = !DIEnumerator(name: "human_SI", value: 128)
!653 = !DIEnumerator(name: "human_B", value: 256)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !655, line: 30, baseType: !64, size: 32, elements: !656)
!655 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!656 = !{!657, !658, !659, !660, !661}
!657 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!658 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!659 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!660 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!661 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!662 = !{!535}
!663 = !{!628, !631, !633, !635, !637, !664, !669, !671, !673, !675, !677, !681, !685}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !630, line: 417, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 11)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !630, line: 418, type: !143, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !630, line: 438, type: !163, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !630, line: 398, type: !219, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !630, line: 398, type: !153, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "block_size_args", scope: !639, file: !630, line: 398, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 192, elements: !154)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !639, file: !630, line: 399, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 64, elements: !210)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !630, line: 408, type: !168, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 88, elements: !667)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "program_name", scope: !690, file: !691, line: 31, type: !131, isLocal: false, isDefinition: true)
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !692, globals: !693, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!692 = !{!126}
!693 = !{!688, !694, !696}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !691, line: 46, type: !352, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !691, line: 49, type: !9, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "utf07FF", scope: !700, file: !701, line: 46, type: !728, isLocal: true, isDefinition: true)
!700 = distinct !DISubprogram(name: "proper_name_lite", scope: !701, file: !701, line: 38, type: !702, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !706)
!701 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!702 = !DISubroutineType(types: !703)
!703 = !{!131, !131, !131}
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !705, splitDebugInlining: false, nameTableKind: None)
!705 = !{!698}
!706 = !{!707, !708, !709, !710, !715}
!707 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !700, file: !701, line: 38, type: !131)
!708 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !700, file: !701, line: 38, type: !131)
!709 = !DILocalVariable(name: "translation", scope: !700, file: !701, line: 40, type: !131)
!710 = !DILocalVariable(name: "w", scope: !700, file: !701, line: 47, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !712, line: 37, baseType: !713)
!712 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !111, line: 57, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 42, baseType: !64)
!715 = !DILocalVariable(name: "mbs", scope: !700, file: !701, line: 48, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !717, line: 6, baseType: !718)
!717 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !719, line: 21, baseType: !720)
!719 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 13, size: 64, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !720, file: !719, line: 15, baseType: !70, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !720, file: !719, line: 20, baseType: !724, size: 32, offset: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !720, file: !719, line: 16, size: 32, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !724, file: !719, line: 18, baseType: !64, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !724, file: !719, line: 19, baseType: !9, size: 32)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !210)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !731, line: 78, type: !352, isLocal: true, isDefinition: true)
!731 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !731, line: 79, type: !14, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !731, line: 80, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 13)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !731, line: 81, type: !736, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !731, line: 82, type: !311, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !731, line: 83, type: !209, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !731, line: 84, type: !352, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !731, line: 85, type: !347, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !731, line: 86, type: !347, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !731, line: 87, type: !352, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !755, file: !731, line: 76, type: !827, isLocal: false, isDefinition: true)
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !756, retainedTypes: !762, globals: !763, splitDebugInlining: false, nameTableKind: None)
!756 = !{!89, !757, !74}
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !90, line: 254, baseType: !64, size: 32, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!760 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!761 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!762 = !{!70, !128, !129}
!763 = !{!729, !732, !734, !739, !741, !743, !745, !747, !749, !751, !753, !764, !768, !778, !780, !785, !787, !789, !791, !793, !816, !823, !825}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !755, file: !731, line: 92, type: !766, isLocal: false, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 320, elements: !144)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !755, file: !731, line: 1040, type: !770, isLocal: false, isDefinition: true)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !731, line: 56, size: 448, elements: !771)
!771 = !{!772, !773, !774, !776, !777}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !770, file: !731, line: 59, baseType: !89, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !731, line: 62, baseType: !70, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !770, file: !731, line: 66, baseType: !775, size: 256, offset: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !353)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !770, file: !731, line: 69, baseType: !131, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !770, file: !731, line: 72, baseType: !131, size: 64, offset: 384)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !755, file: !731, line: 107, type: !770, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "slot0", scope: !755, file: !731, line: 831, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 256)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !731, line: 321, type: !209, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !731, line: 357, type: !209, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !731, line: 358, type: !209, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !731, line: 199, type: !347, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "quote", scope: !795, file: !731, line: 228, type: !814, isLocal: true, isDefinition: true)
!795 = distinct !DISubprogram(name: "gettext_quote", scope: !731, file: !731, line: 197, type: !796, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !755, retainedNodes: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{!131, !131, !89}
!798 = !{!799, !800, !801, !802, !803}
!799 = !DILocalVariable(name: "msgid", arg: 1, scope: !795, file: !731, line: 197, type: !131)
!800 = !DILocalVariable(name: "s", arg: 2, scope: !795, file: !731, line: 197, type: !89)
!801 = !DILocalVariable(name: "translation", scope: !795, file: !731, line: 199, type: !131)
!802 = !DILocalVariable(name: "w", scope: !795, file: !731, line: 229, type: !711)
!803 = !DILocalVariable(name: "mbs", scope: !795, file: !731, line: 230, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !717, line: 6, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !719, line: 21, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 13, size: 64, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !806, file: !719, line: 15, baseType: !70, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !806, file: !719, line: 20, baseType: !810, size: 32, offset: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !806, file: !719, line: 16, size: 32, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !810, file: !719, line: 18, baseType: !64, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !810, file: !719, line: 19, baseType: !9, size: 32)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !815)
!815 = !{!211, !11}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "slotvec", scope: !755, file: !731, line: 834, type: !818, isLocal: true, isDefinition: true)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !731, line: 823, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !819, file: !731, line: 825, baseType: !129, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !819, file: !731, line: 826, baseType: !126, size: 64, offset: 64)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "nslots", scope: !755, file: !731, line: 832, type: !70, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "slotvec0", scope: !755, file: !731, line: 833, type: !819, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 704, elements: !667)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !830, line: 67, type: !417, isLocal: true, isDefinition: true)
!830 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !830, line: 69, type: !347, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !830, line: 83, type: !347, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !830, line: 83, type: !9, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !830, line: 85, type: !209, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !830, line: 88, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 171)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !830, line: 88, type: !846, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 34)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !830, line: 105, type: !168, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !830, line: 109, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 23)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !830, line: 113, type: !446, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !830, line: 120, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 32)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !830, line: 127, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 36)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !830, line: 134, type: !34, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !830, line: 142, type: !475, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !830, line: 150, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 48)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !830, line: 159, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 52)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !830, line: 170, type: !173, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !830, line: 248, type: !311, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !830, line: 248, type: !393, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !830, line: 254, type: !311, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !830, line: 254, type: !158, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !830, line: 254, type: !34, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !830, line: 259, type: !20, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !830, line: 259, type: !898, isLocal: true, isDefinition: true)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 29)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !903, file: !904, line: 26, type: !906, isLocal: false, isDefinition: true)
!903 = distinct !DICompileUnit(language: DW_LANG_C11, file: !904, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !905, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!905 = !{!901}
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 376, elements: !452)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "exit_failure", scope: !909, file: !910, line: 24, type: !912, isLocal: false, isDefinition: true)
!909 = distinct !DICompileUnit(language: DW_LANG_C11, file: !910, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !911, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!911 = !{!907}
!912 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !915, line: 34, type: !153, isLocal: true, isDefinition: true)
!915 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !915, line: 34, type: !347, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !915, line: 34, type: !369, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !922, file: !923, line: 65, type: !939, isLocal: false, isDefinition: true)
!922 = distinct !DICompileUnit(language: DW_LANG_C11, file: !923, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !924, retainedTypes: !925, globals: !926, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!924 = !{!89}
!925 = !{!127, !131, !133}
!926 = !{!920, !927, !929, !931, !933, !935, !937}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !923, line: 141, type: !347, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !923, line: 141, type: !407, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !923, line: 142, type: !898, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !923, line: 160, type: !620, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !923, line: 165, type: !352, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !923, line: 170, type: !322, isLocal: true, isDefinition: true)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !940, line: 69, baseType: !625)
!940 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !943, file: !944, line: 506, type: !70, isLocal: true, isDefinition: true)
!943 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !944, file: !944, line: 485, type: !945, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !947, retainedNodes: !949)
!944 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!945 = !DISubroutineType(types: !946)
!946 = !{!70, !70, !70}
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !944, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !948, splitDebugInlining: false, nameTableKind: None)
!948 = !{!941}
!949 = !{!950, !951, !952, !953, !956}
!950 = !DILocalVariable(name: "fd", arg: 1, scope: !943, file: !944, line: 485, type: !70)
!951 = !DILocalVariable(name: "target", arg: 2, scope: !943, file: !944, line: 485, type: !70)
!952 = !DILocalVariable(name: "result", scope: !943, file: !944, line: 487, type: !70)
!953 = !DILocalVariable(name: "flags", scope: !954, file: !944, line: 530, type: !70)
!954 = distinct !DILexicalBlock(scope: !955, file: !944, line: 529, column: 5)
!955 = distinct !DILexicalBlock(scope: !943, file: !944, line: 528, column: 7)
!956 = !DILocalVariable(name: "saved_errno", scope: !957, file: !944, line: 533, type: !70)
!957 = distinct !DILexicalBlock(scope: !958, file: !944, line: 532, column: 9)
!958 = distinct !DILexicalBlock(scope: !954, file: !944, line: 531, column: 11)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !961, line: 108, type: !138, isLocal: true, isDefinition: true)
!961 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "internal_state", scope: !964, file: !961, line: 97, type: !967, isLocal: true, isDefinition: true)
!964 = distinct !DICompileUnit(language: DW_LANG_C11, file: !961, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !965, globals: !966, splitDebugInlining: false, nameTableKind: None)
!965 = !{!127, !129, !133}
!966 = !{!959, !962}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !717, line: 6, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !719, line: 21, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 13, size: 64, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !969, file: !719, line: 15, baseType: !70, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !969, file: !719, line: 20, baseType: !973, size: 32, offset: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !969, file: !719, line: 16, size: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !973, file: !719, line: 18, baseType: !64, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !973, file: !719, line: 19, baseType: !9, size: 32)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !979, line: 35, type: !209, isLocal: true, isDefinition: true)
!979 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !979, line: 35, type: !14, isLocal: true, isDefinition: true)
!982 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !983, retainedTypes: !1068, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!983 = !{!984, !1046, !641}
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !985, file: !2, line: 40, baseType: !64, size: 32, elements: !1044)
!985 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !2, file: !2, line: 34, type: !986, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !982, retainedNodes: !1022)
!986 = !DISubroutineType(types: !987)
!987 = !{!70, !988, !127, !525}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !266, line: 7, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !268, line: 49, size: 1728, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !990, file: !268, line: 51, baseType: !70, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !990, file: !268, line: 54, baseType: !126, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !990, file: !268, line: 55, baseType: !126, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !990, file: !268, line: 56, baseType: !126, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !990, file: !268, line: 57, baseType: !126, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !990, file: !268, line: 58, baseType: !126, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !990, file: !268, line: 59, baseType: !126, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !990, file: !268, line: 60, baseType: !126, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !990, file: !268, line: 61, baseType: !126, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !990, file: !268, line: 64, baseType: !126, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !990, file: !268, line: 65, baseType: !126, size: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !990, file: !268, line: 66, baseType: !126, size: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !990, file: !268, line: 68, baseType: !283, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !990, file: !268, line: 70, baseType: !1006, size: 64, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !990, file: !268, line: 72, baseType: !70, size: 32, offset: 896)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !990, file: !268, line: 73, baseType: !70, size: 32, offset: 928)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !990, file: !268, line: 74, baseType: !290, size: 64, offset: 960)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !990, file: !268, line: 77, baseType: !128, size: 16, offset: 1024)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !990, file: !268, line: 78, baseType: !293, size: 8, offset: 1040)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !990, file: !268, line: 79, baseType: !138, size: 8, offset: 1048)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !990, file: !268, line: 81, baseType: !296, size: 64, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !990, file: !268, line: 89, baseType: !299, size: 64, offset: 1152)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !990, file: !268, line: 91, baseType: !301, size: 64, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !990, file: !268, line: 92, baseType: !304, size: 64, offset: 1280)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !990, file: !268, line: 93, baseType: !1006, size: 64, offset: 1344)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !990, file: !268, line: 94, baseType: !127, size: 64, offset: 1408)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !990, file: !268, line: 95, baseType: !129, size: 64, offset: 1472)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !990, file: !268, line: 96, baseType: !70, size: 32, offset: 1536)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !990, file: !268, line: 98, baseType: !311, size: 160, offset: 1568)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1035, !1038, !1040, !1042, !1043}
!1023 = !DILocalVariable(name: "stream", arg: 1, scope: !985, file: !2, line: 34, type: !988)
!1024 = !DILocalVariable(name: "resstream", arg: 2, scope: !985, file: !2, line: 34, type: !127)
!1025 = !DILocalVariable(name: "length", arg: 3, scope: !985, file: !2, line: 34, type: !525)
!1026 = !DILocalVariable(name: "ret", scope: !985, file: !2, line: 36, type: !70)
!1027 = !DILocalVariable(name: "sum", scope: !985, file: !2, line: 37, type: !227)
!1028 = !DILocalVariable(name: "checksum", scope: !985, file: !2, line: 38, type: !70)
!1029 = !DILocalVariable(name: "total_bytes", scope: !985, file: !2, line: 39, type: !526)
!1030 = !DILocalVariable(name: "buffer", scope: !985, file: !2, line: 41, type: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1033, line: 24, baseType: !1034)
!1033 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !111, line: 38, baseType: !133)
!1035 = !DILocalVariable(name: "n", scope: !1036, file: !2, line: 54, type: !129)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 53, column: 5)
!1037 = distinct !DILexicalBlock(scope: !985, file: !2, line: 48, column: 3)
!1038 = !DILocalVariable(name: "i", scope: !1039, file: !2, line: 71, type: !129)
!1039 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 71, column: 5)
!1040 = !DILocalVariable(name: "i", scope: !1041, file: !2, line: 86, type: !227)
!1041 = distinct !DILexicalBlock(scope: !985, file: !2, line: 86, column: 3)
!1042 = !DILabel(scope: !985, name: "final_process", file: !2, line: 84)
!1043 = !DILabel(scope: !985, name: "cleanup_buffer", file: !2, line: 101)
!1044 = !{!1045}
!1045 = !DIEnumerator(name: "buffer_length", value: 32768)
!1046 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1047, file: !2, line: 115, baseType: !64, size: 32, elements: !1044)
!1047 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !2, file: !2, line: 110, type: !986, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !982, retainedNodes: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1060, !1062, !1064, !1065, !1066, !1067}
!1049 = !DILocalVariable(name: "stream", arg: 1, scope: !1047, file: !2, line: 110, type: !988)
!1050 = !DILocalVariable(name: "resstream", arg: 2, scope: !1047, file: !2, line: 110, type: !127)
!1051 = !DILocalVariable(name: "length", arg: 3, scope: !1047, file: !2, line: 110, type: !525)
!1052 = !DILocalVariable(name: "ret", scope: !1047, file: !2, line: 112, type: !70)
!1053 = !DILocalVariable(name: "sum", scope: !1047, file: !2, line: 113, type: !227)
!1054 = !DILocalVariable(name: "total_bytes", scope: !1047, file: !2, line: 114, type: !526)
!1055 = !DILocalVariable(name: "buffer", scope: !1047, file: !2, line: 116, type: !1031)
!1056 = !DILocalVariable(name: "s", scope: !1047, file: !2, line: 122, type: !64)
!1057 = !DILocalVariable(name: "n", scope: !1058, file: !2, line: 132, type: !129)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 131, column: 5)
!1059 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 126, column: 3)
!1060 = !DILocalVariable(name: "i", scope: !1061, file: !2, line: 149, type: !129)
!1061 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 149, column: 5)
!1062 = !DILocalVariable(name: "i", scope: !1063, file: !2, line: 161, type: !129)
!1063 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 161, column: 3)
!1064 = !DILocalVariable(name: "r", scope: !1047, file: !2, line: 170, type: !70)
!1065 = !DILocalVariable(name: "checksum", scope: !1047, file: !2, line: 171, type: !70)
!1066 = !DILabel(scope: !1047, name: "final_process", file: !2, line: 159)
!1067 = !DILabel(scope: !1047, name: "cleanup_buffer", file: !2, line: 176)
!1068 = !{!224, !545, !131, !129, !1069, !133}
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !111, line: 40, baseType: !128)
!1070 = !{!0, !7, !12}
!1071 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1072, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1073, splitDebugInlining: false, nameTableKind: None)
!1072 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1073 = !{!116}
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1076 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1077, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1078, splitDebugInlining: false, nameTableKind: None)
!1077 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1078 = !{!127}
!1079 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1080, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1080 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1081 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1082, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1078, splitDebugInlining: false, nameTableKind: None)
!1082 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1083 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1084, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1085 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1086, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1086 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1087 = distinct !DICompileUnit(language: DW_LANG_C11, file: !830, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1088, retainedTypes: !1078, globals: !1092, splitDebugInlining: false, nameTableKind: None)
!1088 = !{!1089}
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !830, line: 40, baseType: !64, size: 32, elements: !1090)
!1090 = !{!1091}
!1091 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1092 = !{!828, !831, !833, !835, !837, !839, !844, !849, !851, !856, !858, !863, !868, !870, !872, !877, !882, !884, !886, !888, !890, !892, !894, !896}
!1093 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1094, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1095, retainedTypes: !1123, splitDebugInlining: false, nameTableKind: None)
!1094 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1095 = !{!1096, !1108}
!1096 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1097, file: !1094, line: 188, baseType: !64, size: 32, elements: !1106)
!1097 = distinct !DISubprogram(name: "x2nrealloc", scope: !1094, file: !1094, line: 176, type: !1098, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1093, retainedNodes: !1101)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!127, !127, !1100, !129}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!1101 = !{!1102, !1103, !1104, !1105}
!1102 = !DILocalVariable(name: "p", arg: 1, scope: !1097, file: !1094, line: 176, type: !127)
!1103 = !DILocalVariable(name: "pn", arg: 2, scope: !1097, file: !1094, line: 176, type: !1100)
!1104 = !DILocalVariable(name: "s", arg: 3, scope: !1097, file: !1094, line: 176, type: !129)
!1105 = !DILocalVariable(name: "n", scope: !1097, file: !1094, line: 178, type: !129)
!1106 = !{!1107}
!1107 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1108 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1109, file: !1094, line: 228, baseType: !64, size: 32, elements: !1106)
!1109 = distinct !DISubprogram(name: "xpalloc", scope: !1094, file: !1094, line: 223, type: !1110, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1093, retainedNodes: !1113)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!127, !127, !1112, !227, !229, !227}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1114 = !DILocalVariable(name: "pa", arg: 1, scope: !1109, file: !1094, line: 223, type: !127)
!1115 = !DILocalVariable(name: "pn", arg: 2, scope: !1109, file: !1094, line: 223, type: !1112)
!1116 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1109, file: !1094, line: 223, type: !227)
!1117 = !DILocalVariable(name: "n_max", arg: 4, scope: !1109, file: !1094, line: 223, type: !229)
!1118 = !DILocalVariable(name: "s", arg: 5, scope: !1109, file: !1094, line: 223, type: !227)
!1119 = !DILocalVariable(name: "n0", scope: !1109, file: !1094, line: 230, type: !227)
!1120 = !DILocalVariable(name: "n", scope: !1109, file: !1094, line: 237, type: !227)
!1121 = !DILocalVariable(name: "nbytes", scope: !1109, file: !1094, line: 248, type: !227)
!1122 = !DILocalVariable(name: "adjusted_nbytes", scope: !1109, file: !1094, line: 252, type: !227)
!1123 = !{!126, !127, !224, !230, !107}
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !915, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1125, splitDebugInlining: false, nameTableKind: None)
!1125 = !{!913, !916, !918}
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1128, retainedTypes: !1129, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1128 = !{!654, !74}
!1129 = !{!70, !128, !126, !224, !107, !108}
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1131, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1078, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1132 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1133, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1133 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1134 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1135, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1136, splitDebugInlining: false, nameTableKind: None)
!1135 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1136 = !{!224, !107, !127}
!1137 = distinct !DICompileUnit(language: DW_LANG_C11, file: !979, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1138, splitDebugInlining: false, nameTableKind: None)
!1138 = !{!977, !980}
!1139 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1140, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1140 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1141 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1142, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1078, splitDebugInlining: false, nameTableKind: None)
!1142 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1143 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1144 = !{i32 7, !"Dwarf Version", i32 5}
!1145 = !{i32 2, !"Debug Info Version", i32 3}
!1146 = !{i32 1, !"wchar_size", i32 4}
!1147 = !{i32 8, !"PIC Level", i32 2}
!1148 = !{i32 7, !"PIE Level", i32 2}
!1149 = !{i32 7, !"uwtable", i32 2}
!1150 = !{i32 7, !"frame-pointer", i32 1}
!1151 = !DILocation(line: 0, scope: !985)
!1152 = !DILocation(line: 41, column: 21, scope: !985)
!1153 = !DILocation(line: 43, column: 9, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !985, file: !2, line: 43, column: 7)
!1155 = !DILocation(line: 43, column: 7, scope: !985)
!1156 = !DILocation(line: 52, column: 5, scope: !1037)
!1157 = !DILocation(line: 49, column: 9, scope: !1037)
!1158 = !DILocation(line: 54, column: 18, scope: !1036)
!1159 = !DILocation(line: 0, scope: !1036)
!1160 = !DILocation(line: 55, column: 13, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 55, column: 11)
!1162 = !DILocation(line: 55, column: 11, scope: !1036)
!1163 = !DILocalVariable(name: "__stream", arg: 1, scope: !1164, file: !1165, line: 135, type: !988)
!1164 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1165, file: !1165, line: 135, type: !1166, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !982, retainedNodes: !1168)
!1165 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!70, !988}
!1168 = !{!1163}
!1169 = !DILocation(line: 0, scope: !1164, inlinedAt: !1170)
!1170 = distinct !DILocation(line: 57, column: 15, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 57, column: 15)
!1172 = distinct !DILexicalBlock(scope: !1161, file: !2, line: 56, column: 9)
!1173 = !DILocation(line: 137, column: 10, scope: !1164, inlinedAt: !1170)
!1174 = !{!1175, !1176, i64 0}
!1175 = !{!"_IO_FILE", !1176, i64 0, !1179, i64 8, !1179, i64 16, !1179, i64 24, !1179, i64 32, !1179, i64 40, !1179, i64 48, !1179, i64 56, !1179, i64 64, !1179, i64 72, !1179, i64 80, !1179, i64 88, !1179, i64 96, !1179, i64 104, !1176, i64 112, !1176, i64 116, !1180, i64 120, !1181, i64 128, !1177, i64 130, !1177, i64 131, !1179, i64 136, !1180, i64 144, !1179, i64 152, !1179, i64 160, !1179, i64 168, !1179, i64 176, !1180, i64 184, !1176, i64 192, !1177, i64 196}
!1176 = !{!"int", !1177, i64 0}
!1177 = !{!"omnipotent char", !1178, i64 0}
!1178 = !{!"Simple C/C++ TBAA"}
!1179 = !{!"any pointer", !1177, i64 0}
!1180 = !{!"long", !1177, i64 0}
!1181 = !{!"short", !1177, i64 0}
!1182 = !DILocation(line: 57, column: 15, scope: !1171)
!1183 = !DILocation(line: 0, scope: !1172)
!1184 = !DILocation(line: 62, column: 11, scope: !1036)
!1185 = !DILocation(line: 64, column: 25, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 64, column: 11)
!1187 = !DILocation(line: 64, column: 11, scope: !1036)
!1188 = !DILocalVariable(name: "__stream", arg: 1, scope: !1189, file: !1165, line: 128, type: !988)
!1189 = distinct !DISubprogram(name: "feof_unlocked", scope: !1165, file: !1165, line: 128, type: !1166, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !982, retainedNodes: !1190)
!1190 = !{!1188}
!1191 = !DILocation(line: 0, scope: !1189, inlinedAt: !1192)
!1192 = distinct !DILocation(line: 67, column: 11, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 67, column: 11)
!1194 = !DILocation(line: 130, column: 10, scope: !1189, inlinedAt: !1192)
!1195 = !DILocation(line: 67, column: 11, scope: !1193)
!1196 = !DILocation(line: 0, scope: !1037)
!1197 = !DILocation(line: 0, scope: !1041)
!1198 = !DILocation(line: 86, column: 23, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 86, column: 3)
!1200 = !DILocation(line: 86, column: 3, scope: !1041)
!1201 = !DILocation(line: 77, column: 9, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 77, column: 9)
!1203 = !DILocation(line: 77, column: 9, scope: !1037)
!1204 = distinct !{!1204, !1205, !1206}
!1205 = !DILocation(line: 47, column: 3, scope: !985)
!1206 = !DILocation(line: 82, column: 3, scope: !985)
!1207 = !DILocation(line: 0, scope: !1039)
!1208 = !DILocation(line: 73, column: 30, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !2, line: 72, column: 7)
!1210 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 71, column: 5)
!1211 = !DILocation(line: 73, column: 54, scope: !1209)
!1212 = !DILocation(line: 73, column: 36, scope: !1209)
!1213 = !DILocation(line: 74, column: 21, scope: !1209)
!1214 = !{!1177, !1177, i64 0}
!1215 = !DILocation(line: 74, column: 18, scope: !1209)
!1216 = !DILocation(line: 75, column: 18, scope: !1209)
!1217 = !DILocation(line: 71, column: 34, scope: !1210)
!1218 = !DILocation(line: 71, column: 26, scope: !1210)
!1219 = !DILocation(line: 71, column: 5, scope: !1039)
!1220 = distinct !{!1220, !1219, !1221, !1222}
!1221 = !DILocation(line: 76, column: 7, scope: !1039)
!1222 = !{!"llvm.loop.mustprogress"}
!1223 = !DILocation(line: 79, column: 9, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 78, column: 7)
!1225 = !DILocation(line: 79, column: 15, scope: !1224)
!1226 = !{!1176, !1176, i64 0}
!1227 = !DILocation(line: 80, column: 9, scope: !1224)
!1228 = !DILocation(line: 92, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !985, file: !2, line: 92, column: 7)
!1230 = !DILocation(line: 92, column: 7, scope: !985)
!1231 = !DILocation(line: 88, column: 28, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1199, file: !2, line: 87, column: 5)
!1233 = !DILocation(line: 88, column: 52, scope: !1232)
!1234 = !DILocation(line: 88, column: 34, scope: !1232)
!1235 = !DILocation(line: 89, column: 19, scope: !1232)
!1236 = !DILocation(line: 89, column: 16, scope: !1232)
!1237 = !DILocation(line: 90, column: 16, scope: !1232)
!1238 = !DILocation(line: 86, column: 31, scope: !1199)
!1239 = distinct !{!1239, !1200, !1240, !1222}
!1240 = !DILocation(line: 91, column: 5, scope: !1041)
!1241 = !DILocation(line: 94, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1229, file: !2, line: 93, column: 5)
!1243 = !DILocation(line: 94, column: 13, scope: !1242)
!1244 = !DILocation(line: 95, column: 7, scope: !1242)
!1245 = !DILocalVariable(name: "__dest", arg: 1, scope: !1246, file: !1247, line: 26, type: !1250)
!1246 = distinct !DISubprogram(name: "memcpy", scope: !1247, file: !1247, line: 26, type: !1248, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !982, retainedNodes: !1252)
!1247 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!127, !1250, !1251, !129}
!1250 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !127)
!1251 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !535)
!1252 = !{!1245, !1253, !1254}
!1253 = !DILocalVariable(name: "__src", arg: 2, scope: !1246, file: !1247, line: 26, type: !1251)
!1254 = !DILocalVariable(name: "__len", arg: 3, scope: !1246, file: !1247, line: 26, type: !129)
!1255 = !DILocation(line: 0, scope: !1246, inlinedAt: !1256)
!1256 = distinct !DILocation(line: 98, column: 3, scope: !985)
!1257 = !DILocation(line: 29, column: 10, scope: !1246, inlinedAt: !1256)
!1258 = !DILocation(line: 99, column: 11, scope: !985)
