; ModuleID = 'src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.pollfd = type { i32, i16, i16 }
%struct.File_spec = type { ptr, ptr, %struct.timespec, i64, i64, i32, i64, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.inotify_event = type { i32, i32, i32, i32, [0 x i8] }
%struct.charbuffer = type { [8192 x i8], i64, ptr }
%struct.linebuffer = type { [8192 x i8], i64, i64, ptr }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

!176 = !{!177, !178}
!177 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!178 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 81, baseType: !175, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIEnumerator(name: "COPY_TO_EOF", value: -1)
!182 = !DIEnumerator(name: "COPY_A_BUFFER", value: -2)
!183 = !{!175, !184, !185, !188, !190, !191, !192, !187, !193, !194, !196, !200, !201}
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 46, baseType: !187)
!186 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!187 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!190 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!191 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!192 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !197, line: 97, baseType: !198)
!197 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !199, line: 154, baseType: !175)
!199 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !202, line: 63, baseType: !203)
!202 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 152, baseType: !192)
!204 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !61, !66, !71, !76, !81, !86, !91, !96, !101, !106, !205, !210, !320, !325, !327, !332, !337, !339, !341, !343, !345, !111, !347, !349, !351, !356, !361, !440, !442, !444, !449, !454, !456, !458, !460, !465, !467, !469, !471, !476, !481, !483, !485, !487, !489, !491, !493, !498, !503, !505, !510, !512, !514, !516, !518, !520, !525, !527, !529, !531, !536, !541, !546, !548, !550, !552, !554, !556, !558, !563, !565, !567, !572, !577, !582, !584, !586, !591, !596, !601, !606, !608, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !654, !656, !660, !662, !664, !668, !670, !672, !674, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !702, !704, !706, !708, !713, !715, !720, !722, !724, !726, !739, !744, !749, !751, !753, !758, !763, !765, !767, !769, !771, !773, !778, !780, !785, !787, !790, !792, !794, !799, !804, !806, !808, !810, !815, !817, !845, !847, !849, !854, !856, !859}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2396, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 2)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !212, file: !2, line: 2396, type: !200, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 2347, type: !213, scopeLine: 2348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !216)
!213 = !DISubroutineType(types: !214)
!214 = !{!175, !175, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!216 = !{!217, !218, !219, !220, !221, !226, !227, !228, !265, !266, !268, !270, !272, !274, !302, !303, !305, !307, !310, !313}
!217 = !DILocalVariable(name: "argc", arg: 1, scope: !212, file: !2, line: 2347, type: !175)
!218 = !DILocalVariable(name: "argv", arg: 2, scope: !212, file: !2, line: 2347, type: !215)
!219 = !DILocalVariable(name: "header_mode", scope: !212, file: !2, line: 2349, type: !119)
!220 = !DILocalVariable(name: "ok", scope: !212, file: !2, line: 2350, type: !191)
!221 = !DILocalVariable(name: "n_units", scope: !212, file: !2, line: 2353, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_t", file: !2, line: 85, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !224, line: 101, baseType: !225)
!224 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !199, line: 72, baseType: !192)
!226 = !DILocalVariable(name: "n_files", scope: !212, file: !2, line: 2354, type: !175)
!227 = !DILocalVariable(name: "file", scope: !212, file: !2, line: 2355, type: !215)
!228 = !DILocalVariable(name: "F", scope: !212, file: !2, line: 2356, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !2, line: 118, size: 832, elements: !231)
!231 = !{!232, !233, !234, !242, !245, !248, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !264}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !2, line: 121, baseType: !200, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prettyname", scope: !230, file: !2, line: 124, baseType: !188, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !230, file: !2, line: 127, baseType: !235, size: 128, offset: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !236, line: 11, size: 128, elements: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !235, file: !236, line: 16, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 160, baseType: !192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !235, file: !236, line: 21, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !199, line: 197, baseType: !192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !230, file: !2, line: 128, baseType: !243, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !197, line: 59, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !199, line: 145, baseType: !187)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !230, file: !2, line: 129, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !197, line: 47, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !199, line: 148, baseType: !187)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !2, line: 130, baseType: !249, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !197, line: 69, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !199, line: 150, baseType: !116)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !230, file: !2, line: 134, baseType: !201, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !230, file: !2, line: 139, baseType: !191, size: 8, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !230, file: !2, line: 142, baseType: !191, size: 8, offset: 520)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !230, file: !2, line: 146, baseType: !191, size: 8, offset: 528)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !230, file: !2, line: 149, baseType: !175, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !230, file: !2, line: 153, baseType: !175, size: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !230, file: !2, line: 156, baseType: !175, size: 32, offset: 608)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !230, file: !2, line: 160, baseType: !175, size: 32, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !230, file: !2, line: 164, baseType: !175, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !230, file: !2, line: 167, baseType: !261, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !262, line: 130, baseType: !263)
!262 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !186, line: 35, baseType: !192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !230, file: !2, line: 171, baseType: !222, size: 64, offset: 768)
!265 = !DILocalVariable(name: "obsolete_option", scope: !212, file: !2, line: 2357, type: !191)
!266 = !DILocalVariable(name: "sleep_interval", scope: !212, file: !2, line: 2362, type: !267)
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !DILocalVariable(name: "p", scope: !269, file: !2, line: 2373, type: !175)
!269 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2372, column: 3)
!270 = !DILocalVariable(name: "found_hyphen", scope: !271, file: !2, line: 2402, type: !191)
!271 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2401, column: 3)
!272 = !DILocalVariable(name: "i", scope: !273, file: !2, line: 2404, type: !175)
!273 = distinct !DILexicalBlock(scope: !271, file: !2, line: 2404, column: 5)
!274 = !DILocalVariable(name: "in_stat", scope: !275, file: !2, line: 2418, type: !277)
!275 = distinct !DILexicalBlock(scope: !276, file: !2, line: 2417, column: 7)
!276 = distinct !DILexicalBlock(scope: !271, file: !2, line: 2416, column: 9)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !278, line: 44, size: 1024, elements: !279)
!278 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!279 = !{!280, !281, !282, !283, !285, !287, !289, !290, !291, !292, !294, !295, !297, !298, !299, !300}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !277, file: !278, line: 46, baseType: !244, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !277, file: !278, line: 47, baseType: !247, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !277, file: !278, line: 48, baseType: !250, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !277, file: !278, line: 49, baseType: !284, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !199, line: 151, baseType: !116)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !277, file: !278, line: 50, baseType: !286, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !199, line: 146, baseType: !116)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !277, file: !278, line: 51, baseType: !288, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !199, line: 147, baseType: !116)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !277, file: !278, line: 52, baseType: !244, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !277, file: !278, line: 53, baseType: !244, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !277, file: !278, line: 54, baseType: !203, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !277, file: !278, line: 55, baseType: !293, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !199, line: 175, baseType: !175)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !277, file: !278, line: 56, baseType: !175, size: 32, offset: 480)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !277, file: !278, line: 57, baseType: !296, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !199, line: 180, baseType: !192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !277, file: !278, line: 65, baseType: !235, size: 128, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !277, file: !278, line: 66, baseType: !235, size: 128, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !277, file: !278, line: 67, baseType: !235, size: 128, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !277, file: !278, line: 79, baseType: !301, size: 64, offset: 960)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !208)
!302 = !DILocalVariable(name: "blocking_stdin", scope: !275, file: !2, line: 2419, type: !191)
!303 = !DILocalVariable(name: "i", scope: !304, file: !2, line: 2437, type: !175)
!304 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2437, column: 3)
!305 = !DILocalVariable(name: "i", scope: !306, file: !2, line: 2449, type: !175)
!306 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2449, column: 3)
!307 = !DILocalVariable(name: "out_stat", scope: !308, file: !2, line: 2456, type: !277)
!308 = distinct !DILexicalBlock(scope: !309, file: !2, line: 2453, column: 5)
!309 = distinct !DILexicalBlock(scope: !212, file: !2, line: 2452, column: 7)
!310 = !DILocalVariable(name: "wd", scope: !311, file: !2, line: 2510, type: !175)
!311 = distinct !DILexicalBlock(scope: !312, file: !2, line: 2509, column: 9)
!312 = distinct !DILexicalBlock(scope: !308, file: !2, line: 2508, column: 11)
!313 = !DILocalVariable(name: "ht", scope: !314, file: !2, line: 2519, type: !316)
!314 = distinct !DILexicalBlock(scope: !315, file: !2, line: 2512, column: 13)
!315 = distinct !DILexicalBlock(scope: !311, file: !2, line: 2511, column: 15)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !318, line: 56, baseType: !319)
!318 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !318, line: 54, flags: DIFlagFwdDecl)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2410, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 25)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2425, type: !83, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2440, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 15)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 16)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2525, type: !39, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "forever", scope: !113, file: !2, line: 187, type: !191, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "monitor_output", scope: !113, file: !2, line: 190, type: !191, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "from_start", scope: !113, file: !2, line: 193, type: !191, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "print_headers", scope: !113, file: !2, line: 196, type: !191, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !113, file: !2, line: 226, type: !191, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !113, file: !2, line: 234, type: !191, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !174, line: 729, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 56)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !174, line: 736, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 75)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !363, file: !174, line: 575, type: !175, isLocal: true, isDefinition: true)
!363 = distinct !DISubprogram(name: "oputs_", scope: !174, file: !174, line: 573, type: !364, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !366)
!364 = !DISubroutineType(cc: DW_CC_nocall, types: !365)
!365 = !{null, !188, !188}
!366 = !{!367, !368, !369, !372, !373, !374, !375, !379, !380, !381, !382, !384, !434, !435, !436, !438, !439}
!367 = !DILocalVariable(name: "program", arg: 1, scope: !363, file: !174, line: 573, type: !188)
!368 = !DILocalVariable(name: "option", arg: 2, scope: !363, file: !174, line: 573, type: !188)
!369 = !DILocalVariable(name: "term", scope: !370, file: !174, line: 585, type: !188)
!370 = distinct !DILexicalBlock(scope: !371, file: !174, line: 582, column: 5)
!371 = distinct !DILexicalBlock(scope: !363, file: !174, line: 581, column: 7)
!372 = !DILocalVariable(name: "double_space", scope: !363, file: !174, line: 594, type: !191)
!373 = !DILocalVariable(name: "first_word", scope: !363, file: !174, line: 595, type: !188)
!374 = !DILocalVariable(name: "option_text", scope: !363, file: !174, line: 596, type: !188)
!375 = !DILocalVariable(name: "s", scope: !376, file: !174, line: 608, type: !188)
!376 = distinct !DILexicalBlock(scope: !377, file: !174, line: 605, column: 5)
!377 = distinct !DILexicalBlock(scope: !378, file: !174, line: 604, column: 12)
!378 = distinct !DILexicalBlock(scope: !363, file: !174, line: 597, column: 7)
!379 = !DILocalVariable(name: "spaces", scope: !376, file: !174, line: 609, type: !185)
!380 = !DILocalVariable(name: "anchor_len", scope: !363, file: !174, line: 620, type: !185)
!381 = !DILocalVariable(name: "desc_text", scope: !363, file: !174, line: 625, type: !188)
!382 = !DILocalVariable(name: "__ptr", scope: !383, file: !174, line: 644, type: !188)
!383 = distinct !DILexicalBlock(scope: !363, file: !174, line: 644, column: 3)
!384 = !DILocalVariable(name: "__stream", scope: !383, file: !174, line: 644, type: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !387, line: 7, baseType: !388)
!387 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !389, line: 49, size: 1728, elements: !390)
!389 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !406, !408, !409, !410, !411, !412, !414, !415, !418, !420, !423, !426, !427, !428, !429, !430}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !388, file: !389, line: 51, baseType: !175, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !388, file: !389, line: 54, baseType: !200, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !388, file: !389, line: 55, baseType: !200, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !388, file: !389, line: 56, baseType: !200, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !388, file: !389, line: 57, baseType: !200, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !388, file: !389, line: 58, baseType: !200, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !388, file: !389, line: 59, baseType: !200, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !388, file: !389, line: 60, baseType: !200, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !388, file: !389, line: 61, baseType: !200, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !388, file: !389, line: 64, baseType: !200, size: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !388, file: !389, line: 65, baseType: !200, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !388, file: !389, line: 66, baseType: !200, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !388, file: !389, line: 68, baseType: !404, size: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !389, line: 36, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !388, file: !389, line: 70, baseType: !407, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !388, file: !389, line: 72, baseType: !175, size: 32, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !388, file: !389, line: 73, baseType: !175, size: 32, offset: 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !388, file: !389, line: 74, baseType: !203, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !388, file: !389, line: 77, baseType: !184, size: 16, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !388, file: !389, line: 78, baseType: !413, size: 8, offset: 1040)
!413 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !388, file: !389, line: 79, baseType: !98, size: 8, offset: 1048)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !388, file: !389, line: 81, baseType: !416, size: 64, offset: 1088)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !389, line: 43, baseType: null)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !388, file: !389, line: 89, baseType: !419, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 153, baseType: !192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !388, file: !389, line: 91, baseType: !421, size: 64, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !389, line: 37, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !388, file: !389, line: 92, baseType: !424, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !389, line: 38, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !388, file: !389, line: 93, baseType: !407, size: 64, offset: 1344)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !388, file: !389, line: 94, baseType: !193, size: 64, offset: 1408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !388, file: !389, line: 95, baseType: !185, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !388, file: !389, line: 96, baseType: !175, size: 32, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !388, file: !389, line: 98, baseType: !431, size: 160, offset: 1568)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 20)
!434 = !DILocalVariable(name: "__cnt", scope: !383, file: !174, line: 644, type: !185)
!435 = !DILocalVariable(name: "url_program", scope: !363, file: !174, line: 648, type: !188)
!436 = !DILocalVariable(name: "__ptr", scope: !437, file: !174, line: 686, type: !188)
!437 = distinct !DILexicalBlock(scope: !363, file: !174, line: 686, column: 3)
!438 = !DILocalVariable(name: "__stream", scope: !437, file: !174, line: 686, type: !385)
!439 = !DILocalVariable(name: "__cnt", scope: !437, file: !174, line: 686, type: !185)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !174, line: 585, type: !19, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !174, line: 586, type: !19, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !174, line: 595, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 4)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !174, line: 620, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 6)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !207, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !174, line: 648, type: !19, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !446, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !174, line: 649, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 3)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !174, line: 650, type: !19, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !451, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !174, line: 651, type: !451, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !174, line: 652, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 7)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !174, line: 653, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 8)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !174, line: 654, type: !103, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !174, line: 655, type: !103, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !174, line: 656, type: !103, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !174, line: 657, type: !103, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !174, line: 663, type: !473, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !174, line: 664, type: !103, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 17)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !174, line: 669, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 40)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !329, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !174, line: 676, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 61)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !174, line: 679, type: !462, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !174, line: 683, type: !19, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !174, line: 688, type: !19, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !174, line: 691, type: !478, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !174, line: 839, type: !334, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !174, line: 840, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 22)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !174, line: 841, type: !329, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !174, line: 862, type: !446, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !174, line: 868, type: !29, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !174, line: 875, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 27)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 51)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !174, line: 877, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 12)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2110, type: !462, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "count_lines", scope: !113, file: !2, line: 180, type: !191, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2183, type: !522, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2203, type: !329, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2205, type: !108, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2206, type: !108, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2216, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 9)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2228, type: !353, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2246, type: !543, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2263, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 30)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 14)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 11)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !334, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !495, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2279, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 13)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2283, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 37)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2295, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 64)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2299, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 53)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !538, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !83, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !451, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 255, type: !451, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !473, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !451, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !431, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !495, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !446, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !431, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !451, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !451, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 267, type: !473, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !329, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !478, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !334, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !19, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !478, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "long_options", scope: !113, file: !2, line: 252, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 4352, elements: !496)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !647, line: 50, size: 256, elements: !648)
!647 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!648 = !{!649, !650, !651, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !647, line: 52, baseType: !188, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !646, file: !647, line: 55, baseType: !175, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !646, file: !647, line: 56, baseType: !652, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !646, file: !647, line: 57, baseType: !175, size: 32, offset: 192)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !113, file: !2, line: 176, type: !191, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !113, file: !2, line: 113, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 64, elements: !208)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !579, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !19, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !113, file: !2, line: 108, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 192, elements: !463)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !113, file: !2, line: 213, type: !222, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "debug", scope: !113, file: !2, line: 237, type: !191, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "pids_alloc", scope: !113, file: !2, line: 220, type: !261, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "pids", scope: !113, file: !2, line: 219, type: !676, isLocal: true, isDefinition: true)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !113, file: !2, line: 231, type: !191, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "line_end", scope: !113, file: !2, line: 199, type: !4, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "follow_mode", scope: !113, file: !2, line: 184, type: !124, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "nbpids", scope: !113, file: !2, line: 218, type: !175, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2026, type: !533, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2041, type: !334, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !39, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2055, type: !322, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2080, type: !495, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "first_file", scope: !697, file: !2, line: 462, type: !191, isLocal: true, isDefinition: true)
!697 = distinct !DISubprogram(name: "write_header", scope: !2, file: !2, line: 460, type: !698, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !188}
!700 = !{!701}
!701 = !DILocalVariable(name: "prettyname", arg: 1, scope: !697, file: !2, line: 460, type: !188)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !574, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !207, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !495, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 43)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !579, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 640, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 80)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !2, line: 418, type: !569, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !3, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !710, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "whence_msgid", scope: !728, file: !2, line: 417, type: !738, isLocal: true, isDefinition: true)
!728 = distinct !DISubprogram(name: "xlseek", scope: !2, file: !2, line: 410, type: !729, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!201, !175, !201, !175, !188}
!731 = !{!732, !733, !734, !735, !736, !737}
!732 = !DILocalVariable(name: "fd", arg: 1, scope: !728, file: !2, line: 410, type: !175)
!733 = !DILocalVariable(name: "offset", arg: 2, scope: !728, file: !2, line: 410, type: !201)
!734 = !DILocalVariable(name: "whence", arg: 3, scope: !728, file: !2, line: 410, type: !175)
!735 = !DILocalVariable(name: "prettyname", arg: 4, scope: !728, file: !2, line: 410, type: !188)
!736 = !DILocalVariable(name: "new_offset", scope: !728, file: !2, line: 412, type: !201)
!737 = !DILocalVariable(name: "joffset", scope: !728, file: !2, line: 422, type: !223)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 192, elements: !463)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 19)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 970, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 54)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !174, line: 952, type: !543, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1539, type: !207, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1549, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 36)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 28)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1573, type: !334, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1617, type: !334, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !462, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1629, type: !108, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1650, type: !741, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1690, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 44)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1710, type: !760, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1727, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 46)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !431, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 320, elements: !501)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1009, type: !746, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !533, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 47)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1046, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 52)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1068, type: !103, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1069, type: !322, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1080, type: !593, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1090, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 42)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1457, type: !741, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "debugged", scope: !819, file: !2, line: 1178, type: !191, isLocal: true, isDefinition: true)
!819 = distinct !DISubprogram(name: "tail_forever", scope: !2, file: !2, line: 1174, type: !820, scopeLine: 1175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !113, retainedNodes: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !229, !175, !267}
!822 = !{!823, !824, !825, !826, !827, !829, !830, !832, !835, !836, !837, !838, !841, !842, !843, !844}
!823 = !DILocalVariable(name: "f", arg: 1, scope: !819, file: !2, line: 1174, type: !229)
!824 = !DILocalVariable(name: "n_files", arg: 2, scope: !819, file: !2, line: 1174, type: !175)
!825 = !DILocalVariable(name: "sleep_interval", arg: 3, scope: !819, file: !2, line: 1174, type: !267)
!826 = !DILocalVariable(name: "last", scope: !819, file: !2, line: 1176, type: !175)
!827 = !DILocalVariable(name: "blocking", scope: !828, file: !2, line: 1183, type: !191)
!828 = distinct !DILexicalBlock(scope: !819, file: !2, line: 1181, column: 5)
!829 = !DILocalVariable(name: "any_input", scope: !828, file: !2, line: 1194, type: !191)
!830 = !DILocalVariable(name: "i", scope: !831, file: !2, line: 1196, type: !175)
!831 = distinct !DILexicalBlock(scope: !828, file: !2, line: 1196, column: 7)
!832 = !DILocalVariable(name: "stats", scope: !833, file: !2, line: 1198, type: !277)
!833 = distinct !DILexicalBlock(scope: !834, file: !2, line: 1197, column: 9)
!834 = distinct !DILexicalBlock(scope: !831, file: !2, line: 1196, column: 7)
!835 = !DILocalVariable(name: "fd", scope: !833, file: !2, line: 1203, type: !175)
!836 = !DILocalVariable(name: "prettyname", scope: !833, file: !2, line: 1210, type: !188)
!837 = !DILocalVariable(name: "mode", scope: !833, file: !2, line: 1211, type: !249)
!838 = !DILocalVariable(name: "old_flags", scope: !839, file: !2, line: 1215, type: !175)
!839 = distinct !DILexicalBlock(scope: !840, file: !2, line: 1214, column: 13)
!840 = distinct !DILexicalBlock(scope: !833, file: !2, line: 1213, column: 15)
!841 = !DILocalVariable(name: "new_flags", scope: !839, file: !2, line: 1216, type: !175)
!842 = !DILocalVariable(name: "read_unchanged", scope: !833, file: !2, line: 1236, type: !191)
!843 = !DILocalVariable(name: "bytes_to_read", scope: !833, file: !2, line: 1301, type: !222)
!844 = !DILocalVariable(name: "nr", scope: !833, file: !2, line: 1309, type: !222)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !431, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1189, type: !741, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1228, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 35)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !574, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 408, elements: !539)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1345, type: !533, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!862 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!863 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!864 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!865 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!866 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!867 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !872, line: 64, type: !873, isLocal: true, isDefinition: true)
!872 = !DIFile(filename: "src/iopoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "994e71aa1d7ebbae5028422474ffd3c4")
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 26)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !872, line: 64, type: !588, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !872, line: 64, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 352, elements: !776)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !872, line: 88, type: !478, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !885, line: 3, type: !329, isLocal: true, isDefinition: true)
!885 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "Version", scope: !888, file: !885, line: 3, type: !188, isLocal: false, isDefinition: true)
!888 = distinct !DICompileUnit(language: DW_LANG_C11, file: !885, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !889, splitDebugInlining: false, nameTableKind: None)
!889 = !{!883, !886}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !892, file: !893, line: 65, type: !915, isLocal: false, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C11, file: !893, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !894, retainedTypes: !895, globals: !896, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!894 = !{!128}
!895 = !{!193, !188, !190}
!896 = !{!890, !897, !899, !901, !906, !911, !913}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !893, line: 141, type: !473, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !893, line: 141, type: !533, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !893, line: 142, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 29)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !893, line: 160, type: !908, isLocal: true, isDefinition: true)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 21)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !893, line: 165, type: !478, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !893, line: 170, type: !19, isLocal: true, isDefinition: true)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !916, line: 69, baseType: !917)
!916 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null}
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "file_name", scope: !922, file: !923, line: 45, type: !188, isLocal: true, isDefinition: true)
!922 = distinct !DICompileUnit(language: DW_LANG_C11, file: !923, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !924, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!924 = !{!925, !927, !929, !931, !920, !933}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !923, line: 121, type: !473, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !923, line: 121, type: !543, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !923, line: 123, type: !473, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !923, line: 126, type: !462, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !922, file: !923, line: 55, type: !191, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !937, file: !938, line: 66, type: !917, isLocal: false, isDefinition: true)
!937 = distinct !DICompileUnit(language: DW_LANG_C11, file: !938, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !939, globals: !940, splitDebugInlining: false, nameTableKind: None)
!938 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!939 = !{!193, !190}
!940 = !{!941, !943, !967, !969, !971, !973, !935, !975, !977, !979, !981, !983}
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !938, line: 272, type: !19, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "old_file_name", scope: !945, file: !938, line: 304, type: !188, isLocal: true, isDefinition: true)
!945 = distinct !DISubprogram(name: "verror_at_line", scope: !938, file: !938, line: 298, type: !946, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !937, retainedNodes: !960)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !175, !175, !188, !116, !188, !948}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !202, line: 52, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !950, line: 14, baseType: !951)
!950 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !952, baseType: !953)
!952 = !DIFile(filename: "lib/error.c", directory: "/src")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !954)
!954 = !{!955, !956, !957, !958, !959}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !953, file: !952, baseType: !193, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !953, file: !952, baseType: !193, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !953, file: !952, baseType: !193, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !953, file: !952, baseType: !175, size: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !953, file: !952, baseType: !175, size: 32, offset: 224)
!960 = !{!961, !962, !963, !964, !965, !966}
!961 = !DILocalVariable(name: "status", arg: 1, scope: !945, file: !938, line: 298, type: !175)
!962 = !DILocalVariable(name: "errnum", arg: 2, scope: !945, file: !938, line: 298, type: !175)
!963 = !DILocalVariable(name: "file_name", arg: 3, scope: !945, file: !938, line: 298, type: !188)
!964 = !DILocalVariable(name: "line_number", arg: 4, scope: !945, file: !938, line: 298, type: !116)
!965 = !DILocalVariable(name: "message", arg: 5, scope: !945, file: !938, line: 298, type: !188)
!966 = !DILocalVariable(name: "args", arg: 6, scope: !945, file: !938, line: 298, type: !948)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "old_line_number", scope: !945, file: !938, line: 305, type: !116, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !938, line: 338, type: !446, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !938, line: 346, type: !478, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !938, line: 346, type: !207, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "error_message_count", scope: !937, file: !938, line: 69, type: !116, isLocal: false, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !937, file: !938, line: 295, type: !175, isLocal: false, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !938, line: 208, type: !473, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !938, line: 208, type: !908, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !938, line: 214, type: !19, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !987, file: !988, line: 506, type: !175, isLocal: true, isDefinition: true)
!987 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !988, file: !988, line: 485, type: !989, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !991, retainedNodes: !993)
!988 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!989 = !DISubroutineType(types: !990)
!990 = !{!175, !175, !175}
!991 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !992, splitDebugInlining: false, nameTableKind: None)
!992 = !{!985}
!993 = !{!994, !995, !996, !997, !1000}
!994 = !DILocalVariable(name: "fd", arg: 1, scope: !987, file: !988, line: 485, type: !175)
!995 = !DILocalVariable(name: "target", arg: 2, scope: !987, file: !988, line: 485, type: !175)
!996 = !DILocalVariable(name: "result", scope: !987, file: !988, line: 487, type: !175)
!997 = !DILocalVariable(name: "flags", scope: !998, file: !988, line: 530, type: !175)
!998 = distinct !DILexicalBlock(scope: !999, file: !988, line: 529, column: 5)
!999 = distinct !DILexicalBlock(scope: !987, file: !988, line: 528, column: 7)
!1000 = !DILocalVariable(name: "saved_errno", scope: !1001, file: !988, line: 533, type: !175)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !988, line: 532, column: 9)
!1002 = distinct !DILexicalBlock(scope: !998, file: !988, line: 531, column: 11)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !1005, line: 226, type: !108, isLocal: true, isDefinition: true)
!1005 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !1005, line: 227, type: !108, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !1005, line: 228, type: !9, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !1005, line: 231, type: !108, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1014, file: !1005, line: 134, type: !1018, isLocal: true, isDefinition: true)
!1014 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1005, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1015, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1015 = !{!187, !193, !1016, !185}
!1016 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1017 = !{!1003, !1006, !1008, !1010, !1012}
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !318, line: 52, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !318, line: 40, size: 160, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1020, file: !318, line: 45, baseType: !1016, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1020, file: !318, line: 46, baseType: !1016, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1020, file: !318, line: 47, baseType: !1016, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1020, file: !318, line: 48, baseType: !1016, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1020, file: !318, line: 49, baseType: !191, size: 8, offset: 128)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 43, type: !334, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/posixver.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b586c85144b881c520e7e1ef1553b215")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "program_name", scope: !1032, file: !1033, line: 31, type: !188, isLocal: false, isDefinition: true)
!1032 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1033, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1034, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!1033 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1034 = !{!200}
!1035 = !{!1030, !1036, !1038}
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1033, line: 46, type: !478, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1033, line: 49, type: !446, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1042, file: !1043, line: 46, type: !1070, isLocal: true, isDefinition: true)
!1042 = distinct !DISubprogram(name: "proper_name_lite", scope: !1043, file: !1043, line: 38, type: !1044, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1046, retainedNodes: !1048)
!1043 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!188, !188, !188}
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1043, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1047, splitDebugInlining: false, nameTableKind: None)
!1047 = !{!1040}
!1048 = !{!1049, !1050, !1051, !1052, !1057}
!1049 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1042, file: !1043, line: 38, type: !188)
!1050 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1042, file: !1043, line: 38, type: !188)
!1051 = !DILocalVariable(name: "translation", scope: !1042, file: !1043, line: 40, type: !188)
!1052 = !DILocalVariable(name: "w", scope: !1042, file: !1043, line: 47, type: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1054, line: 37, baseType: !1055)
!1054 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !199, line: 57, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !199, line: 42, baseType: !116)
!1057 = !DILocalVariable(name: "mbs", scope: !1042, file: !1043, line: 48, type: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1059, line: 6, baseType: !1060)
!1059 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1061, line: 21, baseType: !1062)
!1061 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1061, line: 13, size: 64, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1062, file: !1061, line: 15, baseType: !175, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1062, file: !1061, line: 20, baseType: !1066, size: 32, offset: 32)
!1066 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1062, file: !1061, line: 16, size: 32, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1066, file: !1061, line: 18, baseType: !116, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1066, file: !1061, line: 19, baseType: !446, size: 32)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 16, elements: !208)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 78, type: !478, isLocal: true, isDefinition: true)
!1073 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 79, type: !451, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 80, type: !588, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 81, type: !588, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 82, type: !431, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 83, type: !207, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 84, type: !478, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 85, type: !473, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 86, type: !473, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 87, type: !478, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1094, file: !1073, line: 76, type: !1166, isLocal: false, isDefinition: true)
!1094 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1073, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1095, retainedTypes: !1101, globals: !1102, splitDebugInlining: false, nameTableKind: None)
!1095 = !{!128, !1096, !142}
!1096 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !129, line: 254, baseType: !116, size: 32, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1099 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1100 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1101 = !{!175, !184, !185}
!1102 = !{!1071, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1092, !1103, !1107, !1117, !1119, !1124, !1126, !1128, !1130, !1132, !1155, !1162, !1164}
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1094, file: !1073, line: 92, type: !1105, isLocal: false, isDefinition: true)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 320, elements: !104)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1094, file: !1073, line: 1040, type: !1109, isLocal: false, isDefinition: true)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1073, line: 56, size: 448, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1115, !1116}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1109, file: !1073, line: 59, baseType: !128, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1109, file: !1073, line: 62, baseType: !175, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1109, file: !1073, line: 66, baseType: !1114, size: 256, offset: 64)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !479)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1109, file: !1073, line: 69, baseType: !188, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1109, file: !1073, line: 72, baseType: !188, size: 64, offset: 384)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1094, file: !1073, line: 107, type: !1109, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "slot0", scope: !1094, file: !1073, line: 831, type: !1121, isLocal: true, isDefinition: true)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1122)
!1122 = !{!1123}
!1123 = !DISubrange(count: 256)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 321, type: !207, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 357, type: !207, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 358, type: !207, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !1073, line: 199, type: !473, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "quote", scope: !1134, file: !1073, line: 228, type: !1153, isLocal: true, isDefinition: true)
!1134 = distinct !DISubprogram(name: "gettext_quote", scope: !1073, file: !1073, line: 197, type: !1135, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1094, retainedNodes: !1137)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!188, !188, !128}
!1137 = !{!1138, !1139, !1140, !1141, !1142}
!1138 = !DILocalVariable(name: "msgid", arg: 1, scope: !1134, file: !1073, line: 197, type: !188)
!1139 = !DILocalVariable(name: "s", arg: 2, scope: !1134, file: !1073, line: 197, type: !128)
!1140 = !DILocalVariable(name: "translation", scope: !1134, file: !1073, line: 199, type: !188)
!1141 = !DILocalVariable(name: "w", scope: !1134, file: !1073, line: 229, type: !1053)
!1142 = !DILocalVariable(name: "mbs", scope: !1134, file: !1073, line: 230, type: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1059, line: 6, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1061, line: 21, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1061, line: 13, size: 64, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1145, file: !1061, line: 15, baseType: !175, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1145, file: !1061, line: 20, baseType: !1149, size: 32, offset: 32)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1145, file: !1061, line: 16, size: 32, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1149, file: !1061, line: 18, baseType: !116, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1149, file: !1061, line: 19, baseType: !446, size: 32)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !1154)
!1154 = !{!209, !448}
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "slotvec", scope: !1094, file: !1073, line: 834, type: !1157, isLocal: true, isDefinition: true)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1073, line: 823, size: 128, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !1073, line: 825, baseType: !185, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1158, file: !1073, line: 826, baseType: !200, size: 64, offset: 64)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(name: "nslots", scope: !1094, file: !1073, line: 832, type: !175, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1094, file: !1073, line: 833, type: !1158, isLocal: true, isDefinition: true)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 704, elements: !580)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 67, type: !543, isLocal: true, isDefinition: true)
!1169 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 69, type: !473, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 83, type: !473, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 83, type: !446, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 85, type: !207, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 88, type: !1180, isLocal: true, isDefinition: true)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 171)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 88, type: !1185, isLocal: true, isDefinition: true)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 34)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 105, type: !334, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 109, type: !1192, isLocal: true, isDefinition: true)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 23)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 113, type: !760, isLocal: true, isDefinition: true)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 120, type: !1199, isLocal: true, isDefinition: true)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1200)
!1200 = !{!1201}
!1201 = !DISubrange(count: 32)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 127, type: !755, isLocal: true, isDefinition: true)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 134, type: !500, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 142, type: !775, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 150, type: !1210, isLocal: true, isDefinition: true)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1211)
!1211 = !{!1212}
!1212 = !DISubrange(count: 48)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 159, type: !801, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 170, type: !1217, isLocal: true, isDefinition: true)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1218)
!1218 = !{!1219}
!1219 = !DISubrange(count: 60)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 248, type: !431, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 248, type: !522, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 254, type: !431, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 254, type: !574, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !1169, line: 254, type: !500, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
