; ModuleID = 'src/true.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating success.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !24

!162 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 15)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !3, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !127, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !9, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !9, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !140, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 22)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !163, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !108, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 71)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 27)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 51)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !{!211, !212, !213, !216, !218, !219, !220, !224, !225, !226, !227, !229, !282, !283, !284, !286, !287}
!211 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!212 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!213 = !DILocalVariable(name: "term", scope: !214, file: !69, line: 585, type: !72)
!214 = distinct !DILexicalBlock(scope: !215, file: !69, line: 582, column: 5)
!215 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!216 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !217)
!217 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!218 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!219 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!220 = !DILocalVariable(name: "s", scope: !221, file: !69, line: 608, type: !72)
!221 = distinct !DILexicalBlock(scope: !222, file: !69, line: 605, column: 5)
!222 = distinct !DILexicalBlock(scope: !223, file: !69, line: 604, column: 12)
!223 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!224 = !DILocalVariable(name: "spaces", scope: !221, file: !69, line: 609, type: !97)
!225 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !97)
!226 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!227 = !DILocalVariable(name: "__ptr", scope: !228, file: !69, line: 644, type: !72)
!228 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!229 = !DILocalVariable(name: "__stream", scope: !228, file: !69, line: 644, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !233)
!232 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !235)
!234 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !234, line: 51, baseType: !95, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !234, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !234, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !234, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !234, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !234, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !234, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !228, file: !69, line: 644, type: !97)
!283 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !69, line: 686, type: !72)
!285 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !69, line: 686, type: !230)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !69, line: 686, type: !97)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !163, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !72, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !72, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !51, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !207, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !51, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !127, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !217, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !364, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!94, !100}
!315 = !{!316, !318, !343, !345, !347, !349, !310, !351, !353, !355, !357, !362}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !9, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !72, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !336)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !95, !95, !72, !78, !72, !323}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !324, line: 52, baseType: !325)
!324 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !326, line: 14, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !328, baseType: !329)
!328 = !DIFile(filename: "lib/error.c", directory: "/src")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !329, file: !328, baseType: !94, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !329, file: !328, baseType: !94, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !329, file: !328, baseType: !94, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !329, file: !328, baseType: !95, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !329, file: !328, baseType: !95, size: 32, offset: 224)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !95)
!338 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !95)
!339 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !72)
!340 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !78)
!341 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !72)
!342 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !78, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !108, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !140, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !118, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !78, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !95, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !51, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 21)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !9, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "program_name", scope: !369, file: !370, line: 31, type: !72, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C11, file: !370, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !371, globals: !372, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!371 = !{!93}
!372 = !{!367, !373, !375}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !370, line: 46, type: !140, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !370, line: 49, type: !108, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "utf07FF", scope: !379, file: !380, line: 46, type: !407, isLocal: true, isDefinition: true)
!379 = distinct !DISubprogram(name: "proper_name_lite", scope: !380, file: !380, line: 38, type: !381, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !383, retainedNodes: !385)
!380 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!381 = !DISubroutineType(types: !382)
!382 = !{!72, !72, !72}
!383 = distinct !DICompileUnit(language: DW_LANG_C11, file: !380, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !384, splitDebugInlining: false, nameTableKind: None)
!384 = !{!377}
!385 = !{!386, !387, !388, !389, !394}
!386 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !379, file: !380, line: 38, type: !72)
!387 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !379, file: !380, line: 38, type: !72)
!388 = !DILocalVariable(name: "translation", scope: !379, file: !380, line: 40, type: !72)
!389 = !DILocalVariable(name: "w", scope: !379, file: !380, line: 47, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !391, line: 37, baseType: !392)
!391 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !78)
!394 = !DILocalVariable(name: "mbs", scope: !379, file: !380, line: 48, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !397)
!396 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !399)
!398 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !399, file: !398, line: 15, baseType: !95, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !399, file: !398, line: 20, baseType: !403, size: 32, offset: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !399, file: !398, line: 16, size: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !403, file: !398, line: 18, baseType: !78, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !403, file: !398, line: 19, baseType: !108, size: 32)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !119)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !410, line: 78, type: !140, isLocal: true, isDefinition: true)
!410 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !410, line: 79, type: !113, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !410, line: 80, type: !63, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !410, line: 81, type: !63, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !410, line: 82, type: !279, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !410, line: 83, type: !118, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !410, line: 84, type: !140, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !410, line: 85, type: !51, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !410, line: 86, type: !51, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !410, line: 87, type: !140, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !431, file: !410, line: 76, type: !517, isLocal: false, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !410, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !432, retainedTypes: !452, globals: !453, splitDebugInlining: false, nameTableKind: None)
!432 = !{!433, !447, !76}
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !434, line: 42, baseType: !78, size: 32, elements: !435)
!434 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!436 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!437 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!438 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!439 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!440 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!441 = !DIEnumerator(name: "c_quoting_style", value: 5)
!442 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!443 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!444 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!445 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!446 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !434, line: 254, baseType: !78, size: 32, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!450 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!451 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!452 = !{!95, !96, !97}
!453 = !{!408, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !454, !458, !468, !470, !475, !477, !479, !481, !483, !506, !513, !515}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !431, file: !410, line: 92, type: !456, isLocal: false, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !42)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !431, file: !410, line: 1040, type: !460, isLocal: false, isDefinition: true)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !410, line: 56, size: 448, elements: !461)
!461 = !{!462, !463, !464, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !460, file: !410, line: 59, baseType: !433, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !410, line: 62, baseType: !95, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !460, file: !410, line: 66, baseType: !465, size: 256, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !141)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !460, file: !410, line: 69, baseType: !72, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !460, file: !410, line: 72, baseType: !72, size: 64, offset: 384)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !431, file: !410, line: 107, type: !460, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "slot0", scope: !431, file: !410, line: 831, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 256)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !410, line: 321, type: !118, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !410, line: 357, type: !118, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !410, line: 358, type: !118, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !410, line: 199, type: !51, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quote", scope: !485, file: !410, line: 228, type: !504, isLocal: true, isDefinition: true)
!485 = distinct !DISubprogram(name: "gettext_quote", scope: !410, file: !410, line: 197, type: !486, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!72, !72, !433}
!488 = !{!489, !490, !491, !492, !493}
!489 = !DILocalVariable(name: "msgid", arg: 1, scope: !485, file: !410, line: 197, type: !72)
!490 = !DILocalVariable(name: "s", arg: 2, scope: !485, file: !410, line: 197, type: !433)
!491 = !DILocalVariable(name: "translation", scope: !485, file: !410, line: 199, type: !72)
!492 = !DILocalVariable(name: "w", scope: !485, file: !410, line: 229, type: !390)
!493 = !DILocalVariable(name: "mbs", scope: !485, file: !410, line: 230, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !496, file: !398, line: 15, baseType: !95, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !496, file: !398, line: 20, baseType: !500, size: 32, offset: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !398, line: 16, size: 32, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !500, file: !398, line: 18, baseType: !78, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !500, file: !398, line: 19, baseType: !108, size: 32)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !505)
!505 = !{!120, !110}
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "slotvec", scope: !431, file: !410, line: 834, type: !508, isLocal: true, isDefinition: true)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !410, line: 823, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !509, file: !410, line: 825, baseType: !97, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !509, file: !410, line: 826, baseType: !93, size: 64, offset: 64)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "nslots", scope: !431, file: !410, line: 832, type: !95, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "slotvec0", scope: !431, file: !410, line: 833, type: !509, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 704, elements: !519)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!519 = !{!520}
!520 = !DISubrange(count: 11)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !523, line: 67, type: !207, isLocal: true, isDefinition: true)
!523 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !523, line: 69, type: !51, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !523, line: 83, type: !51, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !523, line: 83, type: !108, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !523, line: 85, type: !118, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !523, line: 88, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 171)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !523, line: 88, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 34)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !523, line: 105, type: !178, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !523, line: 109, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 23)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !523, line: 113, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 28)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !523, line: 120, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 32)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !523, line: 127, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 36)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !523, line: 134, type: !158, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !523, line: 142, type: !14, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !523, line: 150, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 48)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !523, line: 159, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 52)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !523, line: 170, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 60)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !523, line: 248, type: !279, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !523, line: 248, type: !183, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !279, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !58, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !523, line: 254, type: !158, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !523, line: 259, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 39)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !523, line: 259, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 29)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !605, file: !606, line: 26, type: !608, isLocal: false, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C11, file: !606, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!607 = !{!603}
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 47)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "exit_failure", scope: !613, file: !614, line: 24, type: !616, isLocal: false, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !615, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!615 = !{!611}
!616 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !127, isLocal: true, isDefinition: true)
!619 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !51, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !619, line: 34, type: !153, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !626, line: 108, type: !36, isLocal: true, isDefinition: true)
!626 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "internal_state", scope: !629, file: !626, line: 97, type: !632, isLocal: true, isDefinition: true)
!629 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !630, globals: !631, splitDebugInlining: false, nameTableKind: None)
!630 = !{!94, !97, !100}
!631 = !{!624, !627}
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !396, line: 6, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !398, line: 21, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 13, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !634, file: !398, line: 15, baseType: !95, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !634, file: !398, line: 20, baseType: !638, size: 32, offset: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !398, line: 16, size: 32, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !638, file: !398, line: 18, baseType: !78, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !638, file: !398, line: 19, baseType: !108, size: 32)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 35, type: !118, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !644, line: 35, type: !113, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C11, file: !648, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !523, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !650, retainedTypes: !654, globals: !655, splitDebugInlining: false, nameTableKind: None)
!650 = !{!651}
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 40, baseType: !78, size: 32, elements: !652)
!652 = !{!653}
!653 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!654 = !{!94}
!655 = !{!521, !524, !526, !528, !530, !532, !537, !542, !544, !549, !554, !559, !564, !566, !568, !573, !578, !583, !585, !587, !589, !591, !593, !598}
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !657, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !658, retainedTypes: !689, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!658 = !{!659, !671}
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !660, file: !657, line: 188, baseType: !78, size: 32, elements: !669)
!660 = distinct !DISubprogram(name: "x2nrealloc", scope: !657, file: !657, line: 176, type: !661, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !664)
!661 = !DISubroutineType(types: !662)
!662 = !{!94, !94, !663, !97}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!664 = !{!665, !666, !667, !668}
!665 = !DILocalVariable(name: "p", arg: 1, scope: !660, file: !657, line: 176, type: !94)
!666 = !DILocalVariable(name: "pn", arg: 2, scope: !660, file: !657, line: 176, type: !663)
!667 = !DILocalVariable(name: "s", arg: 3, scope: !660, file: !657, line: 176, type: !97)
!668 = !DILocalVariable(name: "n", scope: !660, file: !657, line: 178, type: !97)
!669 = !{!670}
!670 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!671 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !672, file: !657, line: 228, baseType: !78, size: 32, elements: !669)
!672 = distinct !DISubprogram(name: "xpalloc", scope: !657, file: !657, line: 223, type: !673, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !679)
!673 = !DISubroutineType(types: !674)
!674 = !{!94, !94, !675, !676, !678, !676}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !677, line: 130, baseType: !678)
!677 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !98, line: 35, baseType: !258)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688}
!680 = !DILocalVariable(name: "pa", arg: 1, scope: !672, file: !657, line: 223, type: !94)
!681 = !DILocalVariable(name: "pn", arg: 2, scope: !672, file: !657, line: 223, type: !675)
!682 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !672, file: !657, line: 223, type: !676)
!683 = !DILocalVariable(name: "n_max", arg: 4, scope: !672, file: !657, line: 223, type: !678)
!684 = !DILocalVariable(name: "s", arg: 5, scope: !672, file: !657, line: 223, type: !676)
!685 = !DILocalVariable(name: "n0", scope: !672, file: !657, line: 230, type: !676)
!686 = !DILocalVariable(name: "n", scope: !672, file: !657, line: 237, type: !676)
!687 = !DILocalVariable(name: "nbytes", scope: !672, file: !657, line: 248, type: !676)
!688 = !DILocalVariable(name: "adjusted_nbytes", scope: !672, file: !657, line: 252, type: !676)
!689 = !{!93, !94, !217, !258, !99}
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !619, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !691, splitDebugInlining: false, nameTableKind: None)
!691 = !{!617, !620, !622}
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!694 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !699, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !702, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!702 = !{!217, !99, !94}
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!704 = !{!642, !645}
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!707 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!709 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!710 = !{i32 7, !"Dwarf Version", i32 5}
!711 = !{i32 2, !"Debug Info Version", i32 3}
!712 = !{i32 1, !"wchar_size", i32 4}
!713 = !{i32 8, !"PIC Level", i32 2}
!714 = !{i32 7, !"PIE Level", i32 2}
!715 = !{i32 7, !"uwtable", i32 2}
!716 = !{i32 7, !"frame-pointer", i32 1}
!717 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !718, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !95}
!720 = !{!721}
!721 = !DILocalVariable(name: "status", arg: 1, scope: !717, file: !2, line: 36, type: !95)
!722 = !DILocation(line: 0, scope: !717)
!723 = !DILocation(line: 38, column: 3, scope: !717)
!724 = !{!725, !725, i64 0}
!725 = !{!"any pointer", !726, i64 0}
!726 = !{!"omnipotent char", !727, i64 0}
!727 = !{!"Simple C/C++ TBAA"}
!728 = !DILocation(line: 43, column: 3, scope: !717)
!729 = !DILocation(line: 47, column: 3, scope: !717)
!730 = !DILocation(line: 48, column: 3, scope: !717)
!731 = !DILocation(line: 49, column: 3, scope: !717)
!732 = !DILocation(line: 50, column: 3, scope: !717)
!733 = !DILocation(line: 51, column: 3, scope: !717)
!734 = !DISubprogram(name: "dcgettext", scope: !735, file: !735, line: 51, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!735 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!736 = !DISubroutineType(types: !737)
!737 = !{!93, !72, !72, !95}
!738 = !{}
!739 = !DISubprogram(name: "__printf_chk", scope: !740, file: !740, line: 95, type: !741, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!740 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!741 = !DISubroutineType(types: !742)
!742 = !{!95, !95, !743, null}
!743 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!744 = !DILocation(line: 0, scope: !68)
!745 = !DILocation(line: 581, column: 7, scope: !215)
!746 = !{!747, !747, i64 0}
!747 = !{!"int", !726, i64 0}
!748 = !DILocation(line: 581, column: 19, scope: !215)
!749 = !DILocation(line: 581, column: 7, scope: !68)
!750 = !DILocation(line: 585, column: 26, scope: !214)
!751 = !DILocation(line: 0, scope: !214)
!752 = !DILocation(line: 586, column: 23, scope: !214)
!753 = !DILocation(line: 586, column: 28, scope: !214)
!754 = !DILocation(line: 586, column: 32, scope: !214)
!755 = !{!726, !726, i64 0}
!756 = !DILocation(line: 586, column: 38, scope: !214)
!757 = !DILocalVariable(name: "__s1", arg: 1, scope: !758, file: !759, line: 1359, type: !72)
!758 = distinct !DISubprogram(name: "streq", scope: !759, file: !759, line: 1359, type: !760, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !762)
!759 = !DIFile(filename: "./lib/string.h", directory: "/src")
!760 = !DISubroutineType(types: !761)
!761 = !{!217, !72, !72}
!762 = !{!757, !763}
!763 = !DILocalVariable(name: "__s2", arg: 2, scope: !758, file: !759, line: 1359, type: !72)
!764 = !DILocation(line: 0, scope: !758, inlinedAt: !765)
!765 = distinct !DILocation(line: 586, column: 41, scope: !214)
!766 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !765)
!767 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !765)
!768 = !DILocation(line: 586, column: 19, scope: !214)
!769 = !DILocation(line: 587, column: 5, scope: !214)
!770 = !DILocation(line: 588, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!772 = !DILocation(line: 588, column: 7, scope: !68)
!773 = !DILocation(line: 590, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !771, file: !69, line: 589, column: 5)
!775 = !DILocation(line: 591, column: 7, scope: !774)
!776 = !DILocation(line: 595, column: 37, scope: !68)
!777 = !DILocation(line: 595, column: 35, scope: !68)
!778 = !DILocation(line: 596, column: 29, scope: !68)
!779 = !DILocation(line: 597, column: 8, scope: !223)
!780 = !DILocation(line: 597, column: 7, scope: !68)
!781 = !DILocation(line: 604, column: 24, scope: !222)
!782 = !DILocation(line: 604, column: 12, scope: !223)
!783 = !DILocation(line: 0, scope: !221)
!784 = !DILocation(line: 610, column: 16, scope: !221)
!785 = !DILocation(line: 610, column: 7, scope: !221)
!786 = !DILocation(line: 611, column: 21, scope: !221)
!787 = !{!788, !788, i64 0}
!788 = !{!"short", !726, i64 0}
!789 = !DILocation(line: 611, column: 19, scope: !221)
!790 = !DILocation(line: 611, column: 16, scope: !221)
!791 = !DILocation(line: 610, column: 30, scope: !221)
!792 = distinct !{!792, !785, !786, !793}
!793 = !{!"llvm.loop.mustprogress"}
!794 = !DILocation(line: 612, column: 18, scope: !795)
!795 = distinct !DILexicalBlock(scope: !221, file: !69, line: 612, column: 11)
!796 = !DILocation(line: 612, column: 11, scope: !221)
!797 = !DILocation(line: 620, column: 23, scope: !68)
!798 = !DILocation(line: 625, column: 39, scope: !68)
!799 = !DILocation(line: 626, column: 3, scope: !68)
!800 = !DILocation(line: 626, column: 10, scope: !68)
!801 = !DILocation(line: 626, column: 21, scope: !68)
!802 = !DILocation(line: 628, column: 44, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !69, line: 628, column: 11)
!804 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!805 = !DILocation(line: 628, column: 32, scope: !803)
!806 = !DILocation(line: 628, column: 49, scope: !803)
!807 = !DILocation(line: 628, column: 11, scope: !804)
!808 = !DILocation(line: 630, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !804, file: !69, line: 630, column: 11)
!810 = !DILocation(line: 630, column: 11, scope: !804)
!811 = !DILocation(line: 632, column: 26, scope: !812)
!812 = distinct !DILexicalBlock(scope: !813, file: !69, line: 632, column: 15)
!813 = distinct !DILexicalBlock(scope: !809, file: !69, line: 631, column: 9)
!814 = !DILocation(line: 632, column: 34, scope: !812)
!815 = !DILocation(line: 632, column: 37, scope: !812)
!816 = !DILocation(line: 632, column: 15, scope: !813)
!817 = !DILocation(line: 640, column: 16, scope: !804)
!818 = distinct !{!818, !799, !819, !793}
!819 = !DILocation(line: 641, column: 5, scope: !68)
!820 = !DILocation(line: 644, column: 3, scope: !68)
!821 = !DILocation(line: 0, scope: !758, inlinedAt: !822)
!822 = distinct !DILocation(line: 648, column: 31, scope: !68)
!823 = !DILocation(line: 0, scope: !758, inlinedAt: !824)
!824 = distinct !DILocation(line: 649, column: 31, scope: !68)
!825 = !DILocation(line: 0, scope: !758, inlinedAt: !826)
!826 = distinct !DILocation(line: 650, column: 31, scope: !68)
!827 = !DILocation(line: 0, scope: !758, inlinedAt: !828)
!828 = distinct !DILocation(line: 651, column: 31, scope: !68)
!829 = !DILocation(line: 0, scope: !758, inlinedAt: !830)
!830 = distinct !DILocation(line: 652, column: 31, scope: !68)
!831 = !DILocation(line: 0, scope: !758, inlinedAt: !832)
!832 = distinct !DILocation(line: 653, column: 31, scope: !68)
!833 = !DILocation(line: 0, scope: !758, inlinedAt: !834)
!834 = distinct !DILocation(line: 654, column: 31, scope: !68)
!835 = !DILocation(line: 0, scope: !758, inlinedAt: !836)
!836 = distinct !DILocation(line: 655, column: 31, scope: !68)
!837 = !DILocation(line: 0, scope: !758, inlinedAt: !838)
!838 = distinct !DILocation(line: 656, column: 31, scope: !68)
!839 = !DILocation(line: 0, scope: !758, inlinedAt: !840)
!840 = distinct !DILocation(line: 657, column: 31, scope: !68)
!841 = !DILocation(line: 663, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!843 = !DILocation(line: 664, column: 7, scope: !842)
!844 = !DILocation(line: 664, column: 10, scope: !842)
!845 = !DILocation(line: 663, column: 7, scope: !68)
!846 = !DILocation(line: 669, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !842, file: !69, line: 665, column: 5)
!848 = !DILocation(line: 671, column: 5, scope: !847)
!849 = !DILocation(line: 676, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !842, file: !69, line: 673, column: 5)
!851 = !DILocation(line: 679, column: 3, scope: !68)
!852 = !DILocation(line: 683, column: 3, scope: !68)
!853 = !DILocation(line: 686, column: 3, scope: !68)
!854 = !DILocation(line: 688, column: 3, scope: !68)
!855 = !DILocation(line: 691, column: 3, scope: !68)
!856 = !DILocation(line: 695, column: 3, scope: !68)
!857 = !DILocation(line: 696, column: 1, scope: !68)
!858 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !859, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !861)
!859 = !DISubroutineType(cc: DW_CC_nocall, types: !860)
!860 = !{null, !72}
!861 = !{!862, !863, !870, !871, !873, !874}
!862 = !DILocalVariable(name: "program", arg: 1, scope: !858, file: !69, line: 836, type: !72)
!863 = !DILocalVariable(name: "infomap", scope: !858, file: !69, line: 838, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 896, elements: !52)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !858, file: !69, line: 838, size: 128, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !866, file: !69, line: 838, baseType: !72, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !866, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!870 = !DILocalVariable(name: "node", scope: !858, file: !69, line: 848, type: !72)
!871 = !DILocalVariable(name: "map_prog", scope: !858, file: !69, line: 849, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!873 = !DILocalVariable(name: "lc_messages", scope: !858, file: !69, line: 861, type: !72)
!874 = !DILocalVariable(name: "url_program", scope: !858, file: !69, line: 874, type: !72)
!875 = !DILocation(line: 0, scope: !858)
!876 = !DILocation(line: 857, column: 3, scope: !858)
!877 = !DILocation(line: 861, column: 29, scope: !858)
!878 = !DILocation(line: 862, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !858, file: !69, line: 862, column: 7)
!880 = !DILocation(line: 862, column: 19, scope: !879)
!881 = !DILocation(line: 862, column: 22, scope: !879)
!882 = !DILocation(line: 862, column: 7, scope: !858)
!883 = !DILocation(line: 868, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !879, file: !69, line: 863, column: 5)
!885 = !DILocation(line: 870, column: 5, scope: !884)
!886 = !DILocation(line: 875, column: 3, scope: !858)
!887 = !DILocation(line: 877, column: 3, scope: !858)
!888 = !DILocation(line: 879, column: 1, scope: !858)
!889 = !DISubprogram(name: "exit", scope: !890, file: !890, line: 624, type: !718, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !738)
!890 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!891 = !DISubprogram(name: "setlocale", scope: !892, file: !892, line: 122, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!892 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!893 = !DISubroutineType(types: !894)
!894 = !{!93, !95, !72}
!895 = !DISubprogram(name: "strncmp", scope: !896, file: !896, line: 159, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!896 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!897 = !DISubroutineType(types: !898)
!898 = !{!95, !72, !72, !97}
!899 = !DISubprogram(name: "fputs_unlocked", scope: !324, file: !324, line: 691, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!900 = !DISubroutineType(types: !901)
!901 = !{!95, !743, !902}
!902 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !230)
!903 = !DISubprogram(name: "getenv", scope: !890, file: !890, line: 641, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!904 = !DISubroutineType(types: !905)
!905 = !{!93, !72}
!906 = !DISubprogram(name: "strcmp", scope: !896, file: !896, line: 156, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!907 = !DISubroutineType(types: !908)
!908 = !{!95, !72, !72}
!909 = !DISubprogram(name: "strspn", scope: !896, file: !896, line: 297, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!910 = !DISubroutineType(types: !911)
!911 = !{!99, !72, !72}
!912 = !DISubprogram(name: "strchr", scope: !896, file: !896, line: 246, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!913 = !DISubroutineType(types: !914)
!914 = !{!93, !72, !95}
!915 = !DISubprogram(name: "__ctype_b_loc", scope: !77, file: !77, line: 79, type: !916, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!916 = !DISubroutineType(types: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!921 = !DISubprogram(name: "strcspn", scope: !896, file: !896, line: 293, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!922 = !DISubprogram(name: "fwrite_unlocked", scope: !324, file: !324, line: 704, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!923 = !DISubroutineType(types: !924)
!924 = !{!97, !925, !97, !97, !902}
!925 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!928 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !929, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !932)
!929 = !DISubroutineType(types: !930)
!930 = !{!95, !95, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!932 = !{!933, !934}
!933 = !DILocalVariable(name: "argc", arg: 1, scope: !928, file: !2, line: 55, type: !95)
!934 = !DILocalVariable(name: "argv", arg: 2, scope: !928, file: !2, line: 55, type: !931)
!935 = !DILocation(line: 0, scope: !928)
!936 = !DILocation(line: 59, column: 12, scope: !937)
!937 = distinct !DILexicalBlock(scope: !928, file: !2, line: 59, column: 7)
!938 = !DILocation(line: 59, column: 7, scope: !928)
!939 = !DILocation(line: 62, column: 25, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !2, line: 60, column: 5)
!941 = !DILocation(line: 62, column: 7, scope: !940)
!942 = !DILocation(line: 63, column: 7, scope: !940)
!943 = !DILocation(line: 64, column: 7, scope: !940)
!944 = !DILocation(line: 65, column: 7, scope: !940)
!945 = !DILocation(line: 69, column: 7, scope: !940)
!946 = !DILocation(line: 71, column: 18, scope: !947)
!947 = distinct !DILexicalBlock(scope: !940, file: !2, line: 71, column: 11)
!948 = !DILocation(line: 0, scope: !758, inlinedAt: !949)
!949 = distinct !DILocation(line: 71, column: 11, scope: !947)
!950 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !949)
!951 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !949)
!952 = !DILocation(line: 71, column: 11, scope: !940)
!953 = !DILocation(line: 72, column: 9, scope: !947)
!954 = !DILocation(line: 0, scope: !758, inlinedAt: !955)
!955 = distinct !DILocation(line: 74, column: 11, scope: !956)
!956 = distinct !DILexicalBlock(scope: !940, file: !2, line: 74, column: 11)
!957 = !DILocation(line: 1361, column: 11, scope: !758, inlinedAt: !955)
!958 = !DILocation(line: 1361, column: 10, scope: !758, inlinedAt: !955)
!959 = !DILocation(line: 74, column: 11, scope: !940)
!960 = !DILocation(line: 75, column: 22, scope: !956)
!961 = !DILocation(line: 75, column: 58, scope: !956)
!962 = !DILocation(line: 75, column: 67, scope: !956)
!963 = !DILocation(line: 75, column: 9, scope: !956)
!964 = !DILocation(line: 79, column: 3, scope: !928)
!965 = !DISubprogram(name: "bindtextdomain", scope: !735, file: !735, line: 86, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!966 = !DISubroutineType(types: !967)
!967 = !{!93, !72, !72}
!968 = !DISubprogram(name: "textdomain", scope: !735, file: !735, line: 82, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!969 = !DISubprogram(name: "atexit", scope: !890, file: !890, line: 602, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!970 = !DISubroutineType(types: !971)
!971 = !{!95, !364}
!972 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !973, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !974)
!973 = !DISubroutineType(types: !860)
!974 = !{!975}
!975 = !DILocalVariable(name: "file", arg: 1, scope: !972, file: !298, line: 50, type: !72)
!976 = !DILocation(line: 0, scope: !972)
!977 = !DILocation(line: 52, column: 13, scope: !972)
!978 = !DILocation(line: 53, column: 1, scope: !972)
!979 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !980, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !217}
!982 = !{!983}
!983 = !DILocalVariable(name: "ignore", arg: 1, scope: !979, file: !298, line: 87, type: !217)
!984 = !DILocation(line: 0, scope: !979)
!985 = !DILocation(line: 89, column: 16, scope: !979)
!986 = !{!987, !987, i64 0}
!987 = !{!"_Bool", !726, i64 0}
!988 = !DILocation(line: 90, column: 1, scope: !979)
!989 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !365, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !990)
!990 = !{!991}
!991 = !DILocalVariable(name: "write_error", scope: !992, file: !298, line: 121, type: !72)
!992 = distinct !DILexicalBlock(scope: !993, file: !298, line: 120, column: 5)
!993 = distinct !DILexicalBlock(scope: !989, file: !298, line: 118, column: 7)
!994 = !DILocation(line: 118, column: 21, scope: !993)
!995 = !DILocation(line: 118, column: 7, scope: !993)
!996 = !DILocation(line: 118, column: 29, scope: !993)
!997 = !DILocation(line: 119, column: 7, scope: !993)
!998 = !DILocation(line: 119, column: 12, scope: !993)
!999 = !{i8 0, i8 2}
!1000 = !DILocation(line: 119, column: 25, scope: !993)
!1001 = !DILocation(line: 119, column: 28, scope: !993)
!1002 = !DILocation(line: 119, column: 34, scope: !993)
!1003 = !DILocation(line: 118, column: 7, scope: !989)
!1004 = !DILocation(line: 121, column: 33, scope: !992)
!1005 = !DILocation(line: 0, scope: !992)
!1006 = !DILocation(line: 122, column: 11, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !992, file: !298, line: 122, column: 11)
!1008 = !DILocation(line: 0, scope: !1007)
!1009 = !DILocation(line: 122, column: 11, scope: !992)
!1010 = !DILocation(line: 123, column: 9, scope: !1007)
!1011 = !DILocation(line: 126, column: 9, scope: !1007)
!1012 = !DILocation(line: 128, column: 14, scope: !992)
!1013 = !DILocation(line: 128, column: 7, scope: !992)
!1014 = !DILocation(line: 133, column: 42, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !989, file: !298, line: 133, column: 7)
!1016 = !DILocation(line: 133, column: 28, scope: !1015)
!1017 = !DILocation(line: 133, column: 50, scope: !1015)
!1018 = !DILocation(line: 133, column: 7, scope: !989)
!1019 = !DILocation(line: 134, column: 12, scope: !1015)
!1020 = !DILocation(line: 134, column: 5, scope: !1015)
!1021 = !DILocation(line: 135, column: 1, scope: !989)
!1022 = !DISubprogram(name: "__errno_location", scope: !1023, file: !1023, line: 37, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1023 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!1027 = !DISubprogram(name: "_exit", scope: !1028, file: !1028, line: 624, type: !718, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1028 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1029 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1030, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !95, !95, !72, !323}
!1032 = !{!1033, !1034, !1035, !1036}
!1033 = !DILocalVariable(name: "status", arg: 1, scope: !1029, file: !313, line: 251, type: !95)
!1034 = !DILocalVariable(name: "errnum", arg: 2, scope: !1029, file: !313, line: 251, type: !95)
!1035 = !DILocalVariable(name: "message", arg: 3, scope: !1029, file: !313, line: 251, type: !72)
!1036 = !DILocalVariable(name: "args", arg: 4, scope: !1029, file: !313, line: 251, type: !323)
!1037 = !DILocation(line: 0, scope: !1029)
!1038 = !DILocation(line: 251, column: 1, scope: !1029)
!1039 = !DILocation(line: 261, column: 3, scope: !1029)
!1040 = !DILocation(line: 265, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1029, file: !313, line: 265, column: 7)
!1042 = !DILocation(line: 265, column: 7, scope: !1029)
!1043 = !DILocation(line: 266, column: 5, scope: !1041)
!1044 = !DILocation(line: 272, column: 7, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !313, line: 268, column: 5)
!1046 = !DILocation(line: 276, column: 3, scope: !1029)
!1047 = !{i64 0, i64 8, !724, i64 8, i64 8, !724, i64 16, i64 8, !724, i64 24, i64 4, !746, i64 28, i64 4, !746}
!1048 = !DILocation(line: 282, column: 1, scope: !1029)
!1049 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !365, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1050)
!1050 = !{!1051}
!1051 = !DILocalVariable(name: "stdout_fd", scope: !1049, file: !313, line: 166, type: !95)
!1052 = !DILocation(line: 0, scope: !1049)
!1053 = !DILocalVariable(name: "fd", arg: 1, scope: !1054, file: !313, line: 145, type: !95)
!1054 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1055, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1057)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!95, !95}
!1057 = !{!1053}
!1058 = !DILocation(line: 0, scope: !1054, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 182, column: 25, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !313, line: 182, column: 7)
!1061 = !DILocation(line: 157, column: 15, scope: !1054, inlinedAt: !1059)
!1062 = !DILocation(line: 157, column: 12, scope: !1054, inlinedAt: !1059)
!1063 = !DILocation(line: 182, column: 7, scope: !1049)
!1064 = !DILocation(line: 184, column: 5, scope: !1060)
!1065 = !DILocation(line: 185, column: 1, scope: !1049)
!1066 = !DISubprogram(name: "__fprintf_chk", scope: !740, file: !740, line: 93, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!95, !1069, !95, !743, null}
!1069 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 7, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !234, line: 49, size: 1728, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1072, file: !234, line: 51, baseType: !95, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1072, file: !234, line: 54, baseType: !93, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1072, file: !234, line: 55, baseType: !93, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1072, file: !234, line: 56, baseType: !93, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1072, file: !234, line: 57, baseType: !93, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1072, file: !234, line: 58, baseType: !93, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1072, file: !234, line: 59, baseType: !93, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1072, file: !234, line: 60, baseType: !93, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1072, file: !234, line: 61, baseType: !93, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1072, file: !234, line: 64, baseType: !93, size: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1072, file: !234, line: 65, baseType: !93, size: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1072, file: !234, line: 66, baseType: !93, size: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1072, file: !234, line: 68, baseType: !249, size: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1072, file: !234, line: 70, baseType: !1088, size: 64, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1072, file: !234, line: 72, baseType: !95, size: 32, offset: 896)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1072, file: !234, line: 73, baseType: !95, size: 32, offset: 928)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1072, file: !234, line: 74, baseType: !256, size: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1072, file: !234, line: 77, baseType: !96, size: 16, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1072, file: !234, line: 78, baseType: !261, size: 8, offset: 1040)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1072, file: !234, line: 79, baseType: !36, size: 8, offset: 1048)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1072, file: !234, line: 81, baseType: !264, size: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1072, file: !234, line: 89, baseType: !267, size: 64, offset: 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1072, file: !234, line: 91, baseType: !269, size: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1072, file: !234, line: 92, baseType: !272, size: 64, offset: 1280)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1072, file: !234, line: 93, baseType: !1088, size: 64, offset: 1344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1072, file: !234, line: 94, baseType: !94, size: 64, offset: 1408)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1072, file: !234, line: 95, baseType: !97, size: 64, offset: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1072, file: !234, line: 96, baseType: !95, size: 32, offset: 1536)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1072, file: !234, line: 98, baseType: !279, size: 160, offset: 1568)
!1104 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1030, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1105)
!1105 = !{!1106, !1107, !1108, !1109}
!1106 = !DILocalVariable(name: "status", arg: 1, scope: !1104, file: !313, line: 219, type: !95)
!1107 = !DILocalVariable(name: "errnum", arg: 2, scope: !1104, file: !313, line: 219, type: !95)
!1108 = !DILocalVariable(name: "message", arg: 3, scope: !1104, file: !313, line: 219, type: !72)
!1109 = !DILocalVariable(name: "args", arg: 4, scope: !1104, file: !313, line: 219, type: !323)
!1110 = !DILocation(line: 0, scope: !1104)
!1111 = !DILocation(line: 219, column: 1, scope: !1104)
!1112 = !DILocation(line: 229, column: 13, scope: !1104)
!1113 = !DILocation(line: 135, column: 10, scope: !1114, inlinedAt: !1121)
!1114 = distinct !DISubprogram(name: "vfprintf", scope: !740, file: !740, line: 132, type: !1115, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!95, !1069, !743, !325}
!1117 = !{!1118, !1119, !1120}
!1118 = !DILocalVariable(name: "__stream", arg: 1, scope: !1114, file: !740, line: 132, type: !1069)
!1119 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1114, file: !740, line: 133, type: !743)
!1120 = !DILocalVariable(name: "__ap", arg: 3, scope: !1114, file: !740, line: 133, type: !325)
!1121 = distinct !DILocation(line: 229, column: 3, scope: !1104)
!1122 = !{!1123, !1125}
!1123 = distinct !{!1123, !1124, !"vfprintf.inline: argument 0"}
!1124 = distinct !{!1124, !"vfprintf.inline"}
!1125 = distinct !{!1125, !1124, !"vfprintf.inline: argument 1"}
!1126 = !DILocation(line: 229, column: 3, scope: !1104)
!1127 = !DILocation(line: 0, scope: !1114, inlinedAt: !1121)
!1128 = !DILocation(line: 133, column: 49, scope: !1114, inlinedAt: !1121)
!1129 = !DILocation(line: 232, column: 3, scope: !1104)
!1130 = !DILocation(line: 233, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1104, file: !313, line: 233, column: 7)
!1132 = !DILocation(line: 233, column: 7, scope: !1104)
!1133 = !DILocalVariable(name: "errnum", arg: 1, scope: !1134, file: !313, line: 188, type: !95)
!1134 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !718, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1135)
!1135 = !{!1133, !1136, !1137}
!1136 = !DILocalVariable(name: "s", scope: !1134, file: !313, line: 190, type: !72)
!1137 = !DILocalVariable(name: "errbuf", scope: !1134, file: !313, line: 193, type: !1138)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 1024)
!1141 = !DILocation(line: 0, scope: !1134, inlinedAt: !1142)
!1142 = distinct !DILocation(line: 234, column: 5, scope: !1131)
!1143 = !DILocation(line: 193, column: 3, scope: !1134, inlinedAt: !1142)
!1144 = !DILocation(line: 193, column: 8, scope: !1134, inlinedAt: !1142)
!1145 = !DILocation(line: 195, column: 7, scope: !1134, inlinedAt: !1142)
!1146 = !DILocation(line: 207, column: 9, scope: !1147, inlinedAt: !1142)
!1147 = distinct !DILexicalBlock(scope: !1134, file: !313, line: 207, column: 7)
!1148 = !DILocation(line: 207, column: 7, scope: !1134, inlinedAt: !1142)
!1149 = !DILocation(line: 208, column: 9, scope: !1147, inlinedAt: !1142)
!1150 = !DILocation(line: 208, column: 5, scope: !1147, inlinedAt: !1142)
!1151 = !DILocation(line: 214, column: 3, scope: !1134, inlinedAt: !1142)
!1152 = !DILocation(line: 216, column: 1, scope: !1134, inlinedAt: !1142)
!1153 = !DILocation(line: 234, column: 5, scope: !1131)
!1154 = !DILocation(line: 238, column: 3, scope: !1104)
!1155 = !DILocalVariable(name: "__c", arg: 1, scope: !1156, file: !1157, line: 101, type: !95)
!1156 = distinct !DISubprogram(name: "putc_unlocked", scope: !1157, file: !1157, line: 101, type: !1158, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1160)
!1157 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!95, !95, !1070}
!1160 = !{!1155, !1161}
!1161 = !DILocalVariable(name: "__stream", arg: 2, scope: !1156, file: !1157, line: 101, type: !1070)
!1162 = !DILocation(line: 0, scope: !1156, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 238, column: 3, scope: !1104)
!1164 = !DILocation(line: 103, column: 10, scope: !1156, inlinedAt: !1163)
!1165 = !{!1166, !725, i64 40}
!1166 = !{!"_IO_FILE", !747, i64 0, !725, i64 8, !725, i64 16, !725, i64 24, !725, i64 32, !725, i64 40, !725, i64 48, !725, i64 56, !725, i64 64, !725, i64 72, !725, i64 80, !725, i64 88, !725, i64 96, !725, i64 104, !747, i64 112, !747, i64 116, !1167, i64 120, !788, i64 128, !726, i64 130, !726, i64 131, !725, i64 136, !1167, i64 144, !725, i64 152, !725, i64 160, !725, i64 168, !725, i64 176, !1167, i64 184, !747, i64 192, !726, i64 196}
!1167 = !{!"long", !726, i64 0}
!1168 = !{!1166, !725, i64 48}
!1169 = !{!"branch_weights", i32 2000, i32 1}
!1170 = !DILocation(line: 240, column: 3, scope: !1104)
!1171 = !DILocation(line: 241, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1104, file: !313, line: 241, column: 7)
!1173 = !DILocation(line: 241, column: 7, scope: !1104)
!1174 = !DILocation(line: 242, column: 5, scope: !1172)
!1175 = !DILocation(line: 243, column: 1, scope: !1104)
!1176 = !DISubprogram(name: "__vfprintf_chk", scope: !740, file: !740, line: 96, type: !1177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!95, !1069, !95, !743, !325}
!1179 = !DISubprogram(name: "strerror_r", scope: !896, file: !896, line: 444, type: !1180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!93, !95, !93, !97}
!1182 = !DISubprogram(name: "__overflow", scope: !324, file: !324, line: 886, type: !1183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!95, !1070, !95}
!1185 = !DISubprogram(name: "fflush_unlocked", scope: !324, file: !324, line: 239, type: !1186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!95, !1070}
!1188 = !DISubprogram(name: "fcntl", scope: !1189, file: !1189, line: 149, type: !1190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1189 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!95, !95, !95, null}
!1192 = distinct !DISubprogram(name: "error", scope: !313, file: !313, line: 285, type: !1193, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1195)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{null, !95, !95, !72, null}
!1195 = !{!1196, !1197, !1198, !1199}
!1196 = !DILocalVariable(name: "status", arg: 1, scope: !1192, file: !313, line: 285, type: !95)
!1197 = !DILocalVariable(name: "errnum", arg: 2, scope: !1192, file: !313, line: 285, type: !95)
!1198 = !DILocalVariable(name: "message", arg: 3, scope: !1192, file: !313, line: 285, type: !72)
!1199 = !DILocalVariable(name: "ap", scope: !1192, file: !313, line: 287, type: !323)
!1200 = !DILocation(line: 0, scope: !1192)
!1201 = !DILocation(line: 287, column: 3, scope: !1192)
!1202 = !DILocation(line: 287, column: 11, scope: !1192)
!1203 = !DILocation(line: 288, column: 3, scope: !1192)
!1204 = !DILocation(line: 289, column: 3, scope: !1192)
!1205 = !DILocation(line: 290, column: 3, scope: !1192)
!1206 = !DILocation(line: 291, column: 1, scope: !1192)
!1207 = !DILocation(line: 0, scope: !320)
!1208 = !DILocation(line: 298, column: 1, scope: !320)
!1209 = !DILocation(line: 302, column: 7, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !320, file: !313, line: 302, column: 7)
!1211 = !DILocation(line: 302, column: 7, scope: !320)
!1212 = !DILocation(line: 307, column: 11, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !313, line: 307, column: 11)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !313, line: 303, column: 5)
!1215 = !DILocation(line: 307, column: 27, scope: !1213)
!1216 = !DILocation(line: 308, column: 11, scope: !1213)
!1217 = !DILocation(line: 308, column: 28, scope: !1213)
!1218 = !DILocation(line: 308, column: 25, scope: !1213)
!1219 = !DILocation(line: 309, column: 15, scope: !1213)
!1220 = !DILocation(line: 309, column: 33, scope: !1213)
!1221 = !DILocation(line: 310, column: 19, scope: !1213)
!1222 = !DILocation(line: 311, column: 22, scope: !1213)
!1223 = !DILocation(line: 311, column: 56, scope: !1213)
!1224 = !DILocation(line: 307, column: 11, scope: !1214)
!1225 = !DILocation(line: 316, column: 21, scope: !1214)
!1226 = !DILocation(line: 317, column: 23, scope: !1214)
!1227 = !DILocation(line: 318, column: 5, scope: !1214)
!1228 = !DILocation(line: 327, column: 3, scope: !320)
!1229 = !DILocation(line: 331, column: 7, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !320, file: !313, line: 331, column: 7)
!1231 = !DILocation(line: 331, column: 7, scope: !320)
!1232 = !DILocation(line: 332, column: 5, scope: !1230)
!1233 = !DILocation(line: 338, column: 7, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1230, file: !313, line: 334, column: 5)
!1235 = !DILocation(line: 346, column: 3, scope: !320)
!1236 = !DILocation(line: 350, column: 3, scope: !320)
!1237 = !DILocation(line: 356, column: 1, scope: !320)
!1238 = distinct !DISubprogram(name: "error_at_line", scope: !313, file: !313, line: 359, type: !1239, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1241)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !95, !95, !72, !78, !72, null}
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247}
!1242 = !DILocalVariable(name: "status", arg: 1, scope: !1238, file: !313, line: 359, type: !95)
!1243 = !DILocalVariable(name: "errnum", arg: 2, scope: !1238, file: !313, line: 359, type: !95)
!1244 = !DILocalVariable(name: "file_name", arg: 3, scope: !1238, file: !313, line: 359, type: !72)
!1245 = !DILocalVariable(name: "line_number", arg: 4, scope: !1238, file: !313, line: 360, type: !78)
!1246 = !DILocalVariable(name: "message", arg: 5, scope: !1238, file: !313, line: 360, type: !72)
!1247 = !DILocalVariable(name: "ap", scope: !1238, file: !313, line: 362, type: !323)
!1248 = !DILocation(line: 0, scope: !1238)
!1249 = !DILocation(line: 362, column: 3, scope: !1238)
!1250 = !DILocation(line: 362, column: 11, scope: !1238)
!1251 = !DILocation(line: 363, column: 3, scope: !1238)
!1252 = !DILocation(line: 364, column: 3, scope: !1238)
!1253 = !DILocation(line: 366, column: 3, scope: !1238)
!1254 = !DILocation(line: 367, column: 1, scope: !1238)
!1255 = distinct !DISubprogram(name: "getprogname", scope: !648, file: !648, line: 54, type: !1256, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !647, retainedNodes: !738)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!72}
!1258 = !DILocation(line: 58, column: 10, scope: !1255)
!1259 = !DILocation(line: 58, column: 3, scope: !1255)
!1260 = distinct !DISubprogram(name: "set_program_name", scope: !370, file: !370, line: 37, type: !973, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !1261)
!1261 = !{!1262, !1263, !1264}
!1262 = !DILocalVariable(name: "argv0", arg: 1, scope: !1260, file: !370, line: 37, type: !72)
!1263 = !DILocalVariable(name: "slash", scope: !1260, file: !370, line: 44, type: !72)
!1264 = !DILocalVariable(name: "base", scope: !1260, file: !370, line: 45, type: !72)
!1265 = !DILocation(line: 0, scope: !1260)
!1266 = !DILocation(line: 44, column: 23, scope: !1260)
!1267 = !DILocation(line: 45, column: 22, scope: !1260)
!1268 = !DILocation(line: 46, column: 17, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1260, file: !370, line: 46, column: 7)
!1270 = !DILocation(line: 46, column: 9, scope: !1269)
!1271 = !DILocation(line: 46, column: 25, scope: !1269)
!1272 = !DILocation(line: 46, column: 40, scope: !1269)
!1273 = !DILocalVariable(name: "__s1", arg: 1, scope: !1274, file: !759, line: 974, type: !926)
!1274 = distinct !DISubprogram(name: "memeq", scope: !759, file: !759, line: 974, type: !1275, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !1277)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!217, !926, !926, !97}
!1277 = !{!1273, !1278, !1279}
!1278 = !DILocalVariable(name: "__s2", arg: 2, scope: !1274, file: !759, line: 974, type: !926)
!1279 = !DILocalVariable(name: "__n", arg: 3, scope: !1274, file: !759, line: 974, type: !97)
!1280 = !DILocation(line: 0, scope: !1274, inlinedAt: !1281)
!1281 = distinct !DILocation(line: 46, column: 28, scope: !1269)
!1282 = !DILocation(line: 976, column: 11, scope: !1274, inlinedAt: !1281)
!1283 = !DILocation(line: 976, column: 10, scope: !1274, inlinedAt: !1281)
!1284 = !DILocation(line: 46, column: 7, scope: !1260)
!1285 = !DILocation(line: 49, column: 11, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1287, file: !370, line: 49, column: 11)
!1287 = distinct !DILexicalBlock(scope: !1269, file: !370, line: 47, column: 5)
!1288 = !DILocation(line: 49, column: 36, scope: !1286)
!1289 = !DILocation(line: 49, column: 11, scope: !1287)
!1290 = !DILocation(line: 65, column: 16, scope: !1260)
!1291 = !DILocation(line: 71, column: 27, scope: !1260)
!1292 = !DILocation(line: 74, column: 33, scope: !1260)
!1293 = !DILocation(line: 76, column: 1, scope: !1260)
!1294 = !DISubprogram(name: "strrchr", scope: !896, file: !896, line: 273, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !738)
!1295 = !DILocation(line: 0, scope: !379)
!1296 = !DILocation(line: 40, column: 29, scope: !379)
!1297 = !DILocation(line: 41, column: 19, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !379, file: !380, line: 41, column: 7)
!1299 = !DILocation(line: 41, column: 7, scope: !379)
!1300 = !DILocation(line: 47, column: 3, scope: !379)
!1301 = !DILocation(line: 48, column: 3, scope: !379)
!1302 = !DILocation(line: 48, column: 13, scope: !379)
!1303 = !DILocalVariable(name: "ps", arg: 1, scope: !1304, file: !1305, line: 1135, type: !1308)
!1304 = distinct !DISubprogram(name: "mbszero", scope: !1305, file: !1305, line: 1135, type: !1306, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !383, retainedNodes: !1309)
!1305 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1306 = !DISubroutineType(types: !1307)
!1307 = !{null, !1308}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!1309 = !{!1303}
!1310 = !DILocation(line: 0, scope: !1304, inlinedAt: !1311)
!1311 = distinct !DILocation(line: 48, column: 18, scope: !379)
!1312 = !DILocalVariable(name: "__dest", arg: 1, scope: !1313, file: !1314, line: 57, type: !94)
!1313 = distinct !DISubprogram(name: "memset", scope: !1314, file: !1314, line: 57, type: !1315, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !383, retainedNodes: !1317)
!1314 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!94, !94, !95, !97}
!1317 = !{!1312, !1318, !1319}
!1318 = !DILocalVariable(name: "__ch", arg: 2, scope: !1313, file: !1314, line: 57, type: !95)
!1319 = !DILocalVariable(name: "__len", arg: 3, scope: !1313, file: !1314, line: 57, type: !97)
