; ModuleID = 'src/truncate.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [29 x i8] c"Usage: %s OPTION... FILE...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [275 x i8] c"Shrink or extend the size of each FILE to the specified size\0A\0AA FILE argument that does not exist is created.\0A\0AIf a FILE is larger than the specified size, the extra data is lost.\0AIf a FILE is shorter, it is extended and the sparse extended part (hole)\0Areads as zero bytes.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [9 x i8] c"truncate\00", align 1, !dbg !17

!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 308, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 32)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 308, type: !180, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 21)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !154, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 26)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 27)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 19)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "no_create", scope: !76, file: !2, line: 39, type: !137, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "block_mode", scope: !76, file: !2, line: 42, type: !137, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "ref_file", scope: !76, file: !2, line: 45, type: !134, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !103, line: 736, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 75)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !227, file: !103, line: 575, type: !104, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "oputs_", scope: !103, file: !103, line: 573, type: !228, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !230)
!228 = !DISubroutineType(cc: DW_CC_nocall, types: !229)
!229 = !{null, !134, !134}
!230 = !{!231, !232, !233, !236, !237, !238, !239, !243, !244, !245, !246, !248, !298, !299, !300, !302, !303}
!231 = !DILocalVariable(name: "program", arg: 1, scope: !227, file: !103, line: 573, type: !134)
!232 = !DILocalVariable(name: "option", arg: 2, scope: !227, file: !103, line: 573, type: !134)
!233 = !DILocalVariable(name: "term", scope: !234, file: !103, line: 585, type: !134)
!234 = distinct !DILexicalBlock(scope: !235, file: !103, line: 582, column: 5)
!235 = distinct !DILexicalBlock(scope: !227, file: !103, line: 581, column: 7)
!236 = !DILocalVariable(name: "double_space", scope: !227, file: !103, line: 594, type: !137)
!237 = !DILocalVariable(name: "first_word", scope: !227, file: !103, line: 595, type: !134)
!238 = !DILocalVariable(name: "option_text", scope: !227, file: !103, line: 596, type: !134)
!239 = !DILocalVariable(name: "s", scope: !240, file: !103, line: 608, type: !134)
!240 = distinct !DILexicalBlock(scope: !241, file: !103, line: 605, column: 5)
!241 = distinct !DILexicalBlock(scope: !242, file: !103, line: 604, column: 12)
!242 = distinct !DILexicalBlock(scope: !227, file: !103, line: 597, column: 7)
!243 = !DILocalVariable(name: "spaces", scope: !240, file: !103, line: 609, type: !131)
!244 = !DILocalVariable(name: "anchor_len", scope: !227, file: !103, line: 620, type: !131)
!245 = !DILocalVariable(name: "desc_text", scope: !227, file: !103, line: 625, type: !134)
!246 = !DILocalVariable(name: "__ptr", scope: !247, file: !103, line: 644, type: !134)
!247 = distinct !DILexicalBlock(scope: !227, file: !103, line: 644, column: 3)
!248 = !DILocalVariable(name: "__stream", scope: !247, file: !103, line: 644, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !251, line: 7, baseType: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !253, line: 49, size: 1728, elements: !254)
!253 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !270, !272, !273, !274, !275, !276, !278, !279, !282, !284, !287, !290, !291, !292, !293, !294}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !252, file: !253, line: 51, baseType: !104, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !252, file: !253, line: 54, baseType: !129, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !252, file: !253, line: 55, baseType: !129, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !252, file: !253, line: 56, baseType: !129, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !252, file: !253, line: 57, baseType: !129, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !252, file: !253, line: 58, baseType: !129, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !252, file: !253, line: 59, baseType: !129, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !252, file: !253, line: 60, baseType: !129, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !252, file: !253, line: 61, baseType: !129, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !252, file: !253, line: 64, baseType: !129, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !252, file: !253, line: 65, baseType: !129, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !252, file: !253, line: 66, baseType: !129, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !252, file: !253, line: 68, baseType: !268, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !253, line: 36, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !252, file: !253, line: 70, baseType: !271, size: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !252, file: !253, line: 72, baseType: !104, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !252, file: !253, line: 73, baseType: !104, size: 32, offset: 928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !252, file: !253, line: 74, baseType: !126, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !252, file: !253, line: 77, baseType: !123, size: 16, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !252, file: !253, line: 78, baseType: !277, size: 8, offset: 1040)
!277 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !252, file: !253, line: 79, baseType: !56, size: 8, offset: 1048)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !252, file: !253, line: 81, baseType: !280, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !253, line: 43, baseType: null)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !252, file: !253, line: 89, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !252, file: !253, line: 91, baseType: !285, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !253, line: 37, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !252, file: !253, line: 92, baseType: !288, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !253, line: 38, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !252, file: !253, line: 93, baseType: !271, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !252, file: !253, line: 94, baseType: !130, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !252, file: !253, line: 95, baseType: !131, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !252, file: !253, line: 96, baseType: !104, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !252, file: !253, line: 98, baseType: !295, size: 160, offset: 1568)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DILocalVariable(name: "__cnt", scope: !247, file: !103, line: 644, type: !131)
!299 = !DILocalVariable(name: "url_program", scope: !227, file: !103, line: 648, type: !134)
!300 = !DILocalVariable(name: "__ptr", scope: !301, file: !103, line: 686, type: !134)
!301 = distinct !DILexicalBlock(scope: !227, file: !103, line: 686, column: 3)
!302 = !DILocalVariable(name: "__stream", scope: !301, file: !103, line: 686, type: !249)
!303 = !DILocalVariable(name: "__cnt", scope: !301, file: !103, line: 686, type: !131)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !103, line: 585, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 5)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !103, line: 586, type: !306, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !103, line: 595, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 4)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !103, line: 620, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 6)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !103, line: 648, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 2)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !103, line: 648, type: !306, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !103, line: 649, type: !313, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !103, line: 649, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !103, line: 650, type: !306, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !103, line: 651, type: !318, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !103, line: 651, type: !318, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !103, line: 652, type: !71, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !103, line: 653, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !103, line: 654, type: !61, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !103, line: 655, type: !61, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !103, line: 656, type: !61, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !103, line: 657, type: !61, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !103, line: 663, type: !71, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !103, line: 664, type: !61, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !103, line: 669, type: !159, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !103, line: 669, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 40)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !103, line: 676, type: !154, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !103, line: 676, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 61)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !103, line: 679, type: !332, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !103, line: 683, type: !306, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !103, line: 688, type: !306, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !103, line: 691, type: !345, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !103, line: 744, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 216)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !103, line: 839, type: !149, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !103, line: 840, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 22)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !103, line: 841, type: !154, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !103, line: 862, type: !313, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !103, line: 868, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 71)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !103, line: 875, type: !206, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !103, line: 877, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 51)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !103, line: 877, type: !180, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !61, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !61, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !61, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !306, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !306, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !345, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !149, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 46)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 42)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 179, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 35)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !438, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1792, elements: !72)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !446, line: 50, size: 256, elements: !447)
!446 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!447 = !{!448, !449, !450, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !446, line: 52, baseType: !134, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !445, file: !446, line: 55, baseType: !104, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !446, line: 56, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !445, file: !446, line: 57, baseType: !104, size: 32, offset: 192)
!453 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!454 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !457, line: 3, type: !154, isLocal: true, isDefinition: true)
!457 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "Version", scope: !460, file: !457, line: 3, type: !134, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C11, file: !457, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!461 = !{!455, !458}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "file_name", scope: !464, file: !465, line: 45, type: !134, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !466, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!466 = !{!467, !469, !471, !473, !462, !475}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !71, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !465, line: 121, type: !180, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !465, line: 123, type: !71, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 126, type: !332, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !464, file: !465, line: 55, type: !137, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !527, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!130, !136}
!482 = !{!483, !485, !509, !511, !513, !515, !477, !517, !519, !521, !523, !525}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 272, type: !306, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "old_file_name", scope: !487, file: !480, line: 304, type: !134, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !488, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !502)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !104, !104, !134, !79, !134, !490}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !125, line: 52, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !492, line: 14, baseType: !493)
!492 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !494, baseType: !495)
!494 = !DIFile(filename: "lib/error.c", directory: "/src")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !495, file: !494, baseType: !130, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !495, file: !494, baseType: !130, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !495, file: !494, baseType: !130, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !495, file: !494, baseType: !104, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !495, file: !494, baseType: !104, size: 32, offset: 224)
!502 = !{!503, !504, !505, !506, !507, !508}
!503 = !DILocalVariable(name: "status", arg: 1, scope: !487, file: !480, line: 298, type: !104)
!504 = !DILocalVariable(name: "errnum", arg: 2, scope: !487, file: !480, line: 298, type: !104)
!505 = !DILocalVariable(name: "file_name", arg: 3, scope: !487, file: !480, line: 298, type: !134)
!506 = !DILocalVariable(name: "line_number", arg: 4, scope: !487, file: !480, line: 298, type: !79)
!507 = !DILocalVariable(name: "message", arg: 5, scope: !487, file: !480, line: 298, type: !134)
!508 = !DILocalVariable(name: "args", arg: 6, scope: !487, file: !480, line: 298, type: !490)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "old_line_number", scope: !487, file: !480, line: 305, type: !79, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !480, line: 338, type: !313, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !345, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !480, line: 346, type: !323, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !79, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !104, isLocal: false, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !71, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !480, line: 208, type: !194, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !480, line: 214, type: !306, isLocal: true, isDefinition: true)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "program_name", scope: !532, file: !533, line: 31, type: !134, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C11, file: !533, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!534 = !{!129}
!535 = !{!530, !536, !538}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !533, line: 46, type: !345, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !533, line: 49, type: !313, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "utf07FF", scope: !542, file: !543, line: 46, type: !570, isLocal: true, isDefinition: true)
!542 = distinct !DISubprogram(name: "proper_name_lite", scope: !543, file: !543, line: 38, type: !544, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !546, retainedNodes: !548)
!543 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!544 = !DISubroutineType(types: !545)
!545 = !{!134, !134, !134}
!546 = distinct !DICompileUnit(language: DW_LANG_C11, file: !543, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !547, splitDebugInlining: false, nameTableKind: None)
!547 = !{!540}
!548 = !{!549, !550, !551, !552, !557}
!549 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !542, file: !543, line: 38, type: !134)
!550 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !542, file: !543, line: 38, type: !134)
!551 = !DILocalVariable(name: "translation", scope: !542, file: !543, line: 40, type: !134)
!552 = !DILocalVariable(name: "w", scope: !542, file: !543, line: 47, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !554, line: 37, baseType: !555)
!554 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !127, line: 57, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !127, line: 42, baseType: !79)
!557 = !DILocalVariable(name: "mbs", scope: !542, file: !543, line: 48, type: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !559, line: 6, baseType: !560)
!559 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !561, line: 21, baseType: !562)
!561 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 13, size: 64, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !562, file: !561, line: 15, baseType: !104, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !562, file: !561, line: 20, baseType: !566, size: 32, offset: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !562, file: !561, line: 16, size: 32, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !566, file: !561, line: 18, baseType: !79, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !566, file: !561, line: 19, baseType: !313, size: 32)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 16, elements: !324)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !573, line: 78, type: !345, isLocal: true, isDefinition: true)
!573 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !573, line: 79, type: !318, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !573, line: 80, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 13)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !573, line: 81, type: !578, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !573, line: 82, type: !295, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !573, line: 83, type: !323, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !573, line: 84, type: !345, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !573, line: 85, type: !71, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !573, line: 86, type: !71, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !573, line: 87, type: !345, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !597, file: !573, line: 76, type: !669, isLocal: false, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C11, file: !573, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !598, retainedTypes: !604, globals: !605, splitDebugInlining: false, nameTableKind: None)
!598 = !{!108, !599, !87}
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !109, line: 254, baseType: !79, size: 32, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!602 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!603 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!604 = !{!104, !123, !131}
!605 = !{!571, !574, !576, !581, !583, !585, !587, !589, !591, !593, !595, !606, !610, !620, !622, !627, !629, !631, !633, !635, !658, !665, !667}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !597, file: !573, line: 92, type: !608, isLocal: false, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 320, elements: !62)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !597, file: !573, line: 1040, type: !612, isLocal: false, isDefinition: true)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !573, line: 56, size: 448, elements: !613)
!613 = !{!614, !615, !616, !618, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !612, file: !573, line: 59, baseType: !108, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !612, file: !573, line: 62, baseType: !104, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !612, file: !573, line: 66, baseType: !617, size: 256, offset: 64)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !346)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !612, file: !573, line: 69, baseType: !134, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !612, file: !573, line: 72, baseType: !134, size: 64, offset: 384)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !597, file: !573, line: 107, type: !612, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "slot0", scope: !597, file: !573, line: 831, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 256)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !573, line: 321, type: !323, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !573, line: 357, type: !323, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !573, line: 358, type: !323, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !573, line: 199, type: !71, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "quote", scope: !637, file: !573, line: 228, type: !656, isLocal: true, isDefinition: true)
!637 = distinct !DISubprogram(name: "gettext_quote", scope: !573, file: !573, line: 197, type: !638, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !640)
!638 = !DISubroutineType(types: !639)
!639 = !{!134, !134, !108}
!640 = !{!641, !642, !643, !644, !645}
!641 = !DILocalVariable(name: "msgid", arg: 1, scope: !637, file: !573, line: 197, type: !134)
!642 = !DILocalVariable(name: "s", arg: 2, scope: !637, file: !573, line: 197, type: !108)
!643 = !DILocalVariable(name: "translation", scope: !637, file: !573, line: 199, type: !134)
!644 = !DILocalVariable(name: "w", scope: !637, file: !573, line: 229, type: !553)
!645 = !DILocalVariable(name: "mbs", scope: !637, file: !573, line: 230, type: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !559, line: 6, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !561, line: 21, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 13, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !648, file: !561, line: 15, baseType: !104, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !648, file: !561, line: 20, baseType: !652, size: 32, offset: 32)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !648, file: !561, line: 16, size: 32, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !652, file: !561, line: 18, baseType: !79, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !652, file: !561, line: 19, baseType: !313, size: 32)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !657)
!657 = !{!325, !315}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "slotvec", scope: !597, file: !573, line: 834, type: !660, isLocal: true, isDefinition: true)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !573, line: 823, size: 128, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !661, file: !573, line: 825, baseType: !131, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !661, file: !573, line: 826, baseType: !129, size: 64, offset: 64)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "nslots", scope: !597, file: !573, line: 832, type: !104, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "slotvec0", scope: !597, file: !573, line: 833, type: !661, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 704, elements: !671)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!671 = !{!672}
!672 = !DISubrange(count: 11)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !675, line: 67, type: !180, isLocal: true, isDefinition: true)
!675 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !675, line: 69, type: !71, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !675, line: 83, type: !71, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !675, line: 83, type: !313, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !675, line: 85, type: !323, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !675, line: 88, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 171)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !675, line: 88, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 34)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !675, line: 105, type: !149, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !675, line: 109, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 23)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !675, line: 113, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 28)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !675, line: 120, type: !187, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !675, line: 127, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 36)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !675, line: 134, type: !364, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !675, line: 142, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 44)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !675, line: 150, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 48)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !675, line: 159, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 52)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !675, line: 170, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 60)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !675, line: 248, type: !295, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !675, line: 248, type: !391, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !675, line: 254, type: !295, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !675, line: 254, type: !164, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !675, line: 254, type: !364, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !675, line: 259, type: !3, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !675, line: 259, type: !9, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !751, file: !752, line: 26, type: !754, isLocal: false, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C11, file: !752, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !753, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!753 = !{!749}
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 376, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 47)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "exit_failure", scope: !759, file: !760, line: 24, type: !762, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !761, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!761 = !{!757}
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !765, line: 34, type: !332, isLocal: true, isDefinition: true)
!765 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !765, line: 34, type: !71, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !765, line: 34, type: !159, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !772, line: 80, type: !71, isLocal: true, isDefinition: true)
!772 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !775, line: 108, type: !56, isLocal: true, isDefinition: true)
!775 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "internal_state", scope: !778, file: !775, line: 97, type: !781, isLocal: true, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !779, globals: !780, splitDebugInlining: false, nameTableKind: None)
!779 = !{!130, !131, !136}
!780 = !{!773, !776}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !559, line: 6, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !561, line: 21, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 13, size: 64, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !783, file: !561, line: 15, baseType: !104, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !783, file: !561, line: 20, baseType: !787, size: 32, offset: 32)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !561, line: 16, size: 32, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !787, file: !561, line: 18, baseType: !79, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !787, file: !561, line: 19, baseType: !313, size: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !793, line: 35, type: !323, isLocal: true, isDefinition: true)
!793 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !793, line: 35, type: !318, isLocal: true, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !799, retainedTypes: !803, globals: !804, splitDebugInlining: false, nameTableKind: None)
!799 = !{!800}
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 40, baseType: !79, size: 32, elements: !801)
!801 = !{!802}
!802 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!803 = !{!130}
!804 = !{!673, !676, !678, !680, !682, !684, !689, !694, !696, !701, !706, !708, !713, !715, !720, !725, !730, !735, !737, !739, !741, !743, !745, !747}
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !807, retainedTypes: !838, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!807 = !{!808, !820}
!808 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !809, file: !806, line: 188, baseType: !79, size: 32, elements: !818)
!809 = distinct !DISubprogram(name: "x2nrealloc", scope: !806, file: !806, line: 176, type: !810, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !805, retainedNodes: !813)
!810 = !DISubroutineType(types: !811)
!811 = !{!130, !130, !812, !131}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!813 = !{!814, !815, !816, !817}
!814 = !DILocalVariable(name: "p", arg: 1, scope: !809, file: !806, line: 176, type: !130)
!815 = !DILocalVariable(name: "pn", arg: 2, scope: !809, file: !806, line: 176, type: !812)
!816 = !DILocalVariable(name: "s", arg: 3, scope: !809, file: !806, line: 176, type: !131)
!817 = !DILocalVariable(name: "n", scope: !809, file: !806, line: 178, type: !131)
!818 = !{!819}
!819 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !821, file: !806, line: 228, baseType: !79, size: 32, elements: !818)
!821 = distinct !DISubprogram(name: "xpalloc", scope: !806, file: !806, line: 223, type: !822, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !805, retainedNodes: !828)
!822 = !DISubroutineType(types: !823)
!823 = !{!130, !130, !824, !825, !827, !825}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !826, line: 130, baseType: !827)
!826 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !132, line: 35, baseType: !128)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837}
!829 = !DILocalVariable(name: "pa", arg: 1, scope: !821, file: !806, line: 223, type: !130)
!830 = !DILocalVariable(name: "pn", arg: 2, scope: !821, file: !806, line: 223, type: !824)
!831 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !821, file: !806, line: 223, type: !825)
!832 = !DILocalVariable(name: "n_max", arg: 4, scope: !821, file: !806, line: 223, type: !827)
!833 = !DILocalVariable(name: "s", arg: 5, scope: !821, file: !806, line: 223, type: !825)
!834 = !DILocalVariable(name: "n0", scope: !821, file: !806, line: 230, type: !825)
!835 = !DILocalVariable(name: "n", scope: !821, file: !806, line: 237, type: !825)
!836 = !DILocalVariable(name: "nbytes", scope: !821, file: !806, line: 248, type: !825)
!837 = !DILocalVariable(name: "adjusted_nbytes", scope: !821, file: !806, line: 252, type: !825)
!838 = !{!129, !130, !137, !128, !133}
!839 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !840, splitDebugInlining: false, nameTableKind: None)
!840 = !{!763, !766, !768}
!841 = distinct !DICompileUnit(language: DW_LANG_C11, file: !842, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !843, globals: !859, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!843 = !{!844, !852}
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !845, line: 30, baseType: !79, size: 32, elements: !846)
!845 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!846 = !{!847, !848, !849, !850, !851}
!847 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!848 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!849 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!850 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!851 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !853, line: 24, baseType: !79, size: 32, elements: !854)
!853 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!854 = !{!855, !856, !857, !858}
!855 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!856 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!857 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!858 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!859 = !{!770}
!860 = distinct !DICompileUnit(language: DW_LANG_C11, file: !861, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !862, retainedTypes: !863, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!862 = !{!844}
!863 = !{!137, !128, !133, !138}
!864 = distinct !DICompileUnit(language: DW_LANG_C11, file: !865, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!868 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !803, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!870 = distinct !DICompileUnit(language: DW_LANG_C11, file: !871, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !803, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!872 = distinct !DICompileUnit(language: DW_LANG_C11, file: !873, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !874, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!874 = !{!137, !133, !130}
!875 = distinct !DICompileUnit(language: DW_LANG_C11, file: !793, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !876, splitDebugInlining: false, nameTableKind: None)
!876 = !{!791, !794}
!877 = distinct !DICompileUnit(language: DW_LANG_C11, file: !878, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!878 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!879 = distinct !DICompileUnit(language: DW_LANG_C11, file: !880, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !803, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!881 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!882 = !{i32 7, !"Dwarf Version", i32 5}
!883 = !{i32 2, !"Debug Info Version", i32 3}
!884 = !{i32 1, !"wchar_size", i32 4}
!885 = !{i32 8, !"PIC Level", i32 2}
!886 = !{i32 7, !"PIE Level", i32 2}
!887 = !{i32 7, !"uwtable", i32 2}
!888 = !{i32 7, !"frame-pointer", i32 1}
!889 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 62, type: !890, scopeLine: 63, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !104}
!892 = !{!893}
!893 = !DILocalVariable(name: "status", arg: 1, scope: !889, file: !2, line: 62, type: !104)
!894 = !DILocation(line: 0, scope: !889)
!895 = !DILocation(line: 64, column: 14, scope: !896)
!896 = distinct !DILexicalBlock(scope: !889, file: !2, line: 64, column: 7)
!897 = !DILocation(line: 64, column: 7, scope: !889)
!898 = !DILocation(line: 65, column: 5, scope: !899)
!899 = distinct !DILexicalBlock(scope: !896, file: !2, line: 65, column: 5)
!900 = !{!901, !901, i64 0}
!901 = !{!"any pointer", !902, i64 0}
!902 = !{!"omnipotent char", !903, i64 0}
!903 = !{!"Simple C/C++ TBAA"}
!904 = !DILocation(line: 68, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !896, file: !2, line: 67, column: 5)
!906 = !DILocation(line: 69, column: 7, scope: !905)
!907 = !DILocation(line: 736, column: 3, scope: !908, inlinedAt: !910)
!908 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !103, file: !103, line: 734, type: !528, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !909)
!909 = !{}
!910 = distinct !DILocation(line: 79, column: 7, scope: !905)
!911 = !DILocation(line: 81, column: 7, scope: !905)
!912 = !DILocation(line: 84, column: 7, scope: !905)
!913 = !DILocation(line: 87, column: 7, scope: !905)
!914 = !DILocation(line: 90, column: 7, scope: !905)
!915 = !DILocation(line: 93, column: 7, scope: !905)
!916 = !DILocation(line: 94, column: 7, scope: !905)
!917 = !DILocation(line: 744, column: 3, scope: !918, inlinedAt: !919)
!918 = distinct !DISubprogram(name: "emit_size_note", scope: !103, file: !103, line: 742, type: !528, scopeLine: 743, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !909)
!919 = distinct !DILocation(line: 95, column: 7, scope: !905)
!920 = !DILocation(line: 96, column: 7, scope: !905)
!921 = !DILocalVariable(name: "program", arg: 1, scope: !922, file: !103, line: 836, type: !134)
!922 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !103, file: !103, line: 836, type: !923, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !134}
!925 = !{!921, !926, !933, !934, !936, !937}
!926 = !DILocalVariable(name: "infomap", scope: !922, file: !103, line: 838, type: !927)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 896, elements: !72)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !922, file: !103, line: 838, size: 128, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !929, file: !103, line: 838, baseType: !134, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !929, file: !103, line: 838, baseType: !134, size: 64, offset: 64)
!933 = !DILocalVariable(name: "node", scope: !922, file: !103, line: 848, type: !134)
!934 = !DILocalVariable(name: "map_prog", scope: !922, file: !103, line: 849, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!936 = !DILocalVariable(name: "lc_messages", scope: !922, file: !103, line: 861, type: !134)
!937 = !DILocalVariable(name: "url_program", scope: !922, file: !103, line: 874, type: !134)
!938 = !DILocation(line: 0, scope: !922, inlinedAt: !939)
!939 = distinct !DILocation(line: 100, column: 7, scope: !905)
!940 = !DILocation(line: 857, column: 3, scope: !922, inlinedAt: !939)
!941 = !DILocation(line: 861, column: 29, scope: !922, inlinedAt: !939)
!942 = !DILocation(line: 862, column: 7, scope: !943, inlinedAt: !939)
!943 = distinct !DILexicalBlock(scope: !922, file: !103, line: 862, column: 7)
!944 = !DILocation(line: 862, column: 19, scope: !943, inlinedAt: !939)
!945 = !DILocation(line: 862, column: 22, scope: !943, inlinedAt: !939)
!946 = !DILocation(line: 862, column: 7, scope: !922, inlinedAt: !939)
!947 = !DILocation(line: 868, column: 7, scope: !948, inlinedAt: !939)
!948 = distinct !DILexicalBlock(scope: !943, file: !103, line: 863, column: 5)
!949 = !DILocation(line: 870, column: 5, scope: !948, inlinedAt: !939)
!950 = !DILocation(line: 875, column: 3, scope: !922, inlinedAt: !939)
!951 = !DILocation(line: 877, column: 3, scope: !922, inlinedAt: !939)
!952 = !DILocation(line: 102, column: 3, scope: !889)
!953 = !DISubprogram(name: "dcgettext", scope: !954, file: !954, line: 51, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!954 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!955 = !DISubroutineType(types: !956)
!956 = !{!129, !134, !134, !104}
!957 = !DISubprogram(name: "__fprintf_chk", scope: !958, file: !958, line: 93, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!958 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!959 = !DISubroutineType(types: !960)
!960 = !{!104, !961, !104, !962, null}
!961 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !249)
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!963 = !DISubprogram(name: "__printf_chk", scope: !958, file: !958, line: 95, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!964 = !DISubroutineType(types: !965)
!965 = !{!104, !104, !962, null}
!966 = !DISubprogram(name: "fputs_unlocked", scope: !125, file: !125, line: 691, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!967 = !DISubroutineType(types: !968)
!968 = !{!104, !962, !961}
!969 = !DILocation(line: 0, scope: !227)
!970 = !DILocation(line: 581, column: 7, scope: !235)
!971 = !{!972, !972, i64 0}
!972 = !{!"int", !902, i64 0}
!973 = !DILocation(line: 581, column: 19, scope: !235)
!974 = !DILocation(line: 581, column: 7, scope: !227)
!975 = !DILocation(line: 585, column: 26, scope: !234)
!976 = !DILocation(line: 0, scope: !234)
!977 = !DILocation(line: 586, column: 23, scope: !234)
!978 = !DILocation(line: 586, column: 28, scope: !234)
!979 = !DILocation(line: 586, column: 32, scope: !234)
!980 = !{!902, !902, i64 0}
!981 = !DILocation(line: 586, column: 38, scope: !234)
!982 = !DILocalVariable(name: "__s1", arg: 1, scope: !983, file: !984, line: 1359, type: !134)
!983 = distinct !DISubprogram(name: "streq", scope: !984, file: !984, line: 1359, type: !985, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !987)
!984 = !DIFile(filename: "./lib/string.h", directory: "/src")
!985 = !DISubroutineType(types: !986)
!986 = !{!137, !134, !134}
!987 = !{!982, !988}
!988 = !DILocalVariable(name: "__s2", arg: 2, scope: !983, file: !984, line: 1359, type: !134)
!989 = !DILocation(line: 0, scope: !983, inlinedAt: !990)
!990 = distinct !DILocation(line: 586, column: 41, scope: !234)
!991 = !DILocation(line: 1361, column: 11, scope: !983, inlinedAt: !990)
!992 = !DILocation(line: 1361, column: 10, scope: !983, inlinedAt: !990)
!993 = !DILocation(line: 586, column: 19, scope: !234)
!994 = !DILocation(line: 587, column: 5, scope: !234)
!995 = !DILocation(line: 588, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !227, file: !103, line: 588, column: 7)
!997 = !DILocation(line: 588, column: 7, scope: !227)
!998 = !DILocation(line: 590, column: 7, scope: !999)
!999 = distinct !DILexicalBlock(scope: !996, file: !103, line: 589, column: 5)
!1000 = !DILocation(line: 591, column: 7, scope: !999)
!1001 = !DILocation(line: 595, column: 37, scope: !227)
!1002 = !DILocation(line: 595, column: 35, scope: !227)
!1003 = !DILocation(line: 596, column: 29, scope: !227)
!1004 = !DILocation(line: 597, column: 8, scope: !242)
!1005 = !DILocation(line: 597, column: 7, scope: !227)
!1006 = !DILocation(line: 604, column: 24, scope: !241)
!1007 = !DILocation(line: 604, column: 12, scope: !242)
!1008 = !DILocation(line: 0, scope: !240)
!1009 = !DILocation(line: 610, column: 16, scope: !240)
!1010 = !DILocation(line: 610, column: 7, scope: !240)
!1011 = !DILocation(line: 611, column: 21, scope: !240)
!1012 = !{!1013, !1013, i64 0}
!1013 = !{!"short", !902, i64 0}
!1014 = !DILocation(line: 611, column: 19, scope: !240)
!1015 = !DILocation(line: 611, column: 16, scope: !240)
!1016 = !DILocation(line: 610, column: 30, scope: !240)
!1017 = distinct !{!1017, !1010, !1011, !1018}
!1018 = !{!"llvm.loop.mustprogress"}
!1019 = !DILocation(line: 612, column: 18, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !240, file: !103, line: 612, column: 11)
!1021 = !DILocation(line: 612, column: 11, scope: !240)
!1022 = !DILocation(line: 620, column: 23, scope: !227)
!1023 = !DILocation(line: 625, column: 39, scope: !227)
!1024 = !DILocation(line: 626, column: 3, scope: !227)
!1025 = !DILocation(line: 626, column: 10, scope: !227)
!1026 = !DILocation(line: 626, column: 21, scope: !227)
!1027 = !DILocation(line: 628, column: 44, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !103, line: 628, column: 11)
!1029 = distinct !DILexicalBlock(scope: !227, file: !103, line: 627, column: 5)
!1030 = !DILocation(line: 628, column: 32, scope: !1028)
!1031 = !DILocation(line: 628, column: 49, scope: !1028)
!1032 = !DILocation(line: 628, column: 11, scope: !1029)
!1033 = !DILocation(line: 630, column: 11, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1029, file: !103, line: 630, column: 11)
!1035 = !DILocation(line: 630, column: 11, scope: !1029)
!1036 = !DILocation(line: 632, column: 26, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !103, line: 632, column: 15)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !103, line: 631, column: 9)
!1039 = !DILocation(line: 632, column: 34, scope: !1037)
!1040 = !DILocation(line: 632, column: 37, scope: !1037)
!1041 = !DILocation(line: 632, column: 15, scope: !1038)
!1042 = !DILocation(line: 640, column: 16, scope: !1029)
!1043 = distinct !{!1043, !1024, !1044, !1018}
!1044 = !DILocation(line: 641, column: 5, scope: !227)
!1045 = !DILocation(line: 644, column: 3, scope: !227)
!1046 = !DILocation(line: 0, scope: !983, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 648, column: 31, scope: !227)
!1048 = !DILocation(line: 0, scope: !983, inlinedAt: !1049)
!1049 = distinct !DILocation(line: 649, column: 31, scope: !227)
!1050 = !DILocation(line: 0, scope: !983, inlinedAt: !1051)
!1051 = distinct !DILocation(line: 650, column: 31, scope: !227)
!1052 = !DILocation(line: 0, scope: !983, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 651, column: 31, scope: !227)
!1054 = !DILocation(line: 0, scope: !983, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 652, column: 31, scope: !227)
!1056 = !DILocation(line: 0, scope: !983, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 653, column: 31, scope: !227)
!1058 = !DILocation(line: 0, scope: !983, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 654, column: 31, scope: !227)
!1060 = !DILocation(line: 0, scope: !983, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 655, column: 31, scope: !227)
!1062 = !DILocation(line: 0, scope: !983, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 656, column: 31, scope: !227)
!1064 = !DILocation(line: 0, scope: !983, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 657, column: 31, scope: !227)
!1066 = !DILocation(line: 663, column: 7, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !227, file: !103, line: 663, column: 7)
!1068 = !DILocation(line: 664, column: 7, scope: !1067)
!1069 = !DILocation(line: 664, column: 10, scope: !1067)
!1070 = !DILocation(line: 663, column: 7, scope: !227)
!1071 = !DILocation(line: 669, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !103, line: 665, column: 5)
!1073 = !DILocation(line: 671, column: 5, scope: !1072)
!1074 = !DILocation(line: 676, column: 7, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1067, file: !103, line: 673, column: 5)
!1076 = !DILocation(line: 679, column: 3, scope: !227)
!1077 = !DILocation(line: 683, column: 3, scope: !227)
!1078 = !DILocation(line: 686, column: 3, scope: !227)
!1079 = !DILocation(line: 688, column: 3, scope: !227)
!1080 = !DILocation(line: 691, column: 3, scope: !227)
!1081 = !DILocation(line: 695, column: 3, scope: !227)
!1082 = !DILocation(line: 696, column: 1, scope: !227)
!1083 = !DISubprogram(name: "setlocale", scope: !1084, file: !1084, line: 122, type: !1085, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1084 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!129, !104, !134}
!1087 = !DISubprogram(name: "strncmp", scope: !1088, file: !1088, line: 159, type: !1089, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1088 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!104, !134, !134, !131}
!1091 = !DISubprogram(name: "exit", scope: !1092, file: !1092, line: 624, type: !890, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1092 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1093 = !DISubprogram(name: "getenv", scope: !1092, file: !1092, line: 641, type: !1094, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!129, !134}
!1096 = !DISubprogram(name: "strcmp", scope: !1088, file: !1088, line: 156, type: !1097, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!104, !134, !134}
!1099 = !DISubprogram(name: "strspn", scope: !1088, file: !1088, line: 297, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!133, !134, !134}
!1102 = !DISubprogram(name: "strchr", scope: !1088, file: !1088, line: 246, type: !1103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!129, !134, !104}
!1105 = !DISubprogram(name: "__ctype_b_loc", scope: !88, file: !88, line: 79, type: !1106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!1111 = !DISubprogram(name: "strcspn", scope: !1088, file: !1088, line: 293, type: !1100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1112 = !DISubprogram(name: "fwrite_unlocked", scope: !125, file: !125, line: 704, type: !1113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !909)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!131, !1115, !131, !131, !961}
!1115 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1118 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 201, type: !1119, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1122)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!104, !104, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1130, !1131, !1169, !1170, !1173, !1176, !1177, !1178, !1179, !1181}
!1123 = !DILocalVariable(name: "argc", arg: 1, scope: !1118, file: !2, line: 201, type: !104)
!1124 = !DILocalVariable(name: "argv", arg: 2, scope: !1118, file: !2, line: 201, type: !1121)
!1125 = !DILocalVariable(name: "got_size", scope: !1118, file: !2, line: 203, type: !137)
!1126 = !DILocalVariable(name: "size", scope: !1118, file: !2, line: 204, type: !124)
!1127 = !DILocalVariable(name: "rsize", scope: !1118, file: !2, line: 205, type: !124)
!1128 = !DILocalVariable(name: "rel_mode", scope: !1118, file: !2, line: 206, type: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_mode_t", file: !2, line: 59, baseType: !78)
!1130 = !DILocalVariable(name: "c", scope: !1118, file: !2, line: 207, type: !104)
!1131 = !DILocalVariable(name: "sb", scope: !1132, file: !2, line: 321, type: !1134)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 320, column: 5)
!1133 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 319, column: 7)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1135, line: 44, size: 1024, elements: !1136)
!1135 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1136 = !{!1137, !1139, !1141, !1143, !1145, !1147, !1149, !1150, !1151, !1152, !1154, !1155, !1157, !1165, !1166, !1167}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1134, file: !1135, line: 46, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !127, line: 145, baseType: !133)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1134, file: !1135, line: 47, baseType: !1140, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !127, line: 148, baseType: !133)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1134, file: !1135, line: 48, baseType: !1142, size: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !127, line: 150, baseType: !79)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1134, file: !1135, line: 49, baseType: !1144, size: 32, offset: 160)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !127, line: 151, baseType: !79)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1134, file: !1135, line: 50, baseType: !1146, size: 32, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !127, line: 146, baseType: !79)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1134, file: !1135, line: 51, baseType: !1148, size: 32, offset: 224)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !127, line: 147, baseType: !79)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1134, file: !1135, line: 52, baseType: !1138, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1134, file: !1135, line: 53, baseType: !1138, size: 64, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1134, file: !1135, line: 54, baseType: !126, size: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1134, file: !1135, line: 55, baseType: !1153, size: 32, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !127, line: 175, baseType: !104)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1134, file: !1135, line: 56, baseType: !104, size: 32, offset: 480)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1134, file: !1135, line: 57, baseType: !1156, size: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !127, line: 180, baseType: !128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1134, file: !1135, line: 65, baseType: !1158, size: 128, offset: 576)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1159, line: 11, size: 128, elements: !1160)
!1159 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1160 = !{!1161, !1163}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1158, file: !1159, line: 16, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 160, baseType: !128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1158, file: !1159, line: 21, baseType: !1164, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !127, line: 197, baseType: !128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1134, file: !1135, line: 66, baseType: !1158, size: 128, offset: 704)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1134, file: !1135, line: 67, baseType: !1158, size: 128, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1134, file: !1135, line: 79, baseType: !1168, size: 64, offset: 960)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !324)
!1169 = !DILocalVariable(name: "file_size", scope: !1132, file: !2, line: 322, type: !124)
!1170 = !DILocalVariable(name: "ref_fd", scope: !1171, file: !2, line: 329, type: !104)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 328, column: 9)
!1172 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 325, column: 11)
!1173 = !DILocalVariable(name: "file_end", scope: !1174, file: !2, line: 332, type: !124)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 331, column: 13)
!1175 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 330, column: 15)
!1176 = !DILocalVariable(name: "saved_errno", scope: !1174, file: !2, line: 333, type: !104)
!1177 = !DILocalVariable(name: "oflags", scope: !1118, file: !2, line: 353, type: !104)
!1178 = !DILocalVariable(name: "errors", scope: !1118, file: !2, line: 354, type: !137)
!1179 = !DILocalVariable(name: "fname", scope: !1180, file: !2, line: 356, type: !134)
!1180 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 356, column: 3)
!1181 = !DILocalVariable(name: "fd", scope: !1182, file: !2, line: 358, type: !104)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !2, line: 357, column: 5)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !2, line: 356, column: 3)
!1184 = !DILocation(line: 0, scope: !1118)
!1185 = !DILocation(line: 210, column: 21, scope: !1118)
!1186 = !DILocation(line: 210, column: 3, scope: !1118)
!1187 = !DILocation(line: 211, column: 3, scope: !1118)
!1188 = !DILocation(line: 212, column: 3, scope: !1118)
!1189 = !DILocation(line: 213, column: 3, scope: !1118)
!1190 = !DILocation(line: 215, column: 3, scope: !1118)
!1191 = !DILocation(line: 217, column: 3, scope: !1118)
!1192 = !DILocation(line: 217, column: 15, scope: !1118)
!1193 = !DILocation(line: 235, column: 18, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 220, column: 9)
!1195 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 218, column: 5)
!1196 = !DILocation(line: 235, column: 11, scope: !1194)
!1197 = !DILocation(line: 222, column: 21, scope: !1194)
!1198 = !DILocation(line: 223, column: 11, scope: !1194)
!1199 = !DILocation(line: 226, column: 22, scope: !1194)
!1200 = !DILocation(line: 227, column: 11, scope: !1194)
!1201 = !DILocation(line: 230, column: 22, scope: !1194)
!1202 = !DILocation(line: 230, column: 20, scope: !1194)
!1203 = !DILocation(line: 231, column: 11, scope: !1194)
!1204 = distinct !{!1204, !1191, !1205, !1018}
!1205 = !DILocation(line: 286, column: 5, scope: !1118)
!1206 = !DILocation(line: 236, column: 19, scope: !1194)
!1207 = distinct !{!1207, !1196, !1206, !1018}
!1208 = !DILocation(line: 237, column: 11, scope: !1194)
!1209 = !DILocation(line: 246, column: 15, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 238, column: 13)
!1211 = !DILocation(line: 250, column: 15, scope: !1210)
!1212 = !DILocation(line: 254, column: 15, scope: !1210)
!1213 = !DILocation(line: 0, scope: !1210)
!1214 = !DILocation(line: 257, column: 18, scope: !1194)
!1215 = !DILocation(line: 257, column: 11, scope: !1194)
!1216 = !DILocation(line: 258, column: 19, scope: !1194)
!1217 = distinct !{!1217, !1215, !1216, !1018}
!1218 = !DILocation(line: 259, column: 30, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 259, column: 15)
!1220 = !DILocation(line: 261, column: 19, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !2, line: 261, column: 19)
!1222 = distinct !DILexicalBlock(scope: !1219, file: !2, line: 260, column: 13)
!1223 = !DILocation(line: 261, column: 19, scope: !1222)
!1224 = !DILocation(line: 263, column: 19, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 262, column: 17)
!1226 = !DILocation(line: 265, column: 19, scope: !1225)
!1227 = !DILocation(line: 272, column: 30, scope: !1194)
!1228 = !DILocation(line: 271, column: 18, scope: !1194)
!1229 = !DILocation(line: 274, column: 35, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 274, column: 15)
!1231 = !DILocation(line: 275, column: 13, scope: !1230)
!1232 = !DILocation(line: 279, column: 9, scope: !1194)
!1233 = !DILocation(line: 281, column: 9, scope: !1194)
!1234 = !DILocation(line: 284, column: 11, scope: !1194)
!1235 = !DILocation(line: 288, column: 11, scope: !1118)
!1236 = !DILocation(line: 288, column: 8, scope: !1118)
!1237 = !DILocation(line: 292, column: 8, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 292, column: 7)
!1239 = !DILocation(line: 292, column: 17, scope: !1238)
!1240 = !DILocation(line: 294, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1238, file: !2, line: 293, column: 5)
!1242 = !DILocation(line: 296, column: 7, scope: !1241)
!1243 = !DILocation(line: 299, column: 16, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 299, column: 7)
!1245 = !DILocation(line: 301, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1244, file: !2, line: 300, column: 5)
!1247 = !DILocation(line: 303, column: 7, scope: !1246)
!1248 = !DILocation(line: 306, column: 7, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 306, column: 7)
!1250 = !DILocation(line: 306, column: 18, scope: !1249)
!1251 = !DILocation(line: 308, column: 7, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1249, file: !2, line: 307, column: 5)
!1253 = !DILocation(line: 310, column: 7, scope: !1252)
!1254 = !DILocation(line: 313, column: 12, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1118, file: !2, line: 313, column: 7)
!1256 = !DILocation(line: 313, column: 7, scope: !1118)
!1257 = !DILocation(line: 315, column: 7, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1255, file: !2, line: 314, column: 5)
!1259 = !DILocation(line: 316, column: 7, scope: !1258)
!1260 = !DILocation(line: 319, column: 7, scope: !1118)
!1261 = !DILocation(line: 321, column: 7, scope: !1132)
!1262 = !DILocation(line: 321, column: 19, scope: !1132)
!1263 = !DILocation(line: 0, scope: !1132)
!1264 = !DILocation(line: 323, column: 11, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 323, column: 11)
!1266 = !DILocation(line: 323, column: 32, scope: !1265)
!1267 = !DILocation(line: 323, column: 11, scope: !1132)
!1268 = !DILocation(line: 324, column: 9, scope: !1265)
!1269 = !DILocalVariable(name: "sb", arg: 1, scope: !1270, file: !103, line: 911, type: !1273)
!1270 = distinct !DISubprogram(name: "usable_st_size", scope: !103, file: !103, line: 911, type: !1271, scopeLine: 912, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1275)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!137, !1273}
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1275 = !{!1269}
!1276 = !DILocation(line: 0, scope: !1270, inlinedAt: !1277)
!1277 = distinct !DILocation(line: 325, column: 11, scope: !1172)
!1278 = !DILocation(line: 913, column: 11, scope: !1270, inlinedAt: !1277)
!1279 = !{!1280, !972, i64 16}
!1280 = !{!"stat", !1281, i64 0, !1281, i64 8, !972, i64 16, !972, i64 20, !972, i64 24, !972, i64 28, !1281, i64 32, !1281, i64 40, !1281, i64 48, !972, i64 56, !972, i64 60, !1281, i64 64, !1282, i64 72, !1282, i64 88, !1282, i64 104, !902, i64 120}
!1281 = !{!"long", !902, i64 0}
!1282 = !{!"timespec", !1281, i64 0, !1281, i64 8}
!1283 = !DILocation(line: 913, column: 33, scope: !1270, inlinedAt: !1277)
!1284 = !DILocation(line: 325, column: 11, scope: !1132)
!1285 = !DILocation(line: 329, column: 30, scope: !1171)
!1286 = !DILocation(line: 329, column: 24, scope: !1171)
!1287 = !DILocation(line: 0, scope: !1171)
!1288 = !DILocation(line: 330, column: 17, scope: !1175)
!1289 = !DILocation(line: 330, column: 15, scope: !1171)
!1290 = !DILocation(line: 332, column: 32, scope: !1174)
!1291 = !DILocation(line: 0, scope: !1174)
!1292 = !DILocation(line: 333, column: 33, scope: !1174)
!1293 = !DILocation(line: 334, column: 15, scope: !1174)
!1294 = !DILocation(line: 335, column: 21, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 335, column: 19)
!1296 = !DILocation(line: 335, column: 19, scope: !1174)
!1297 = !DILocation(line: 340, column: 25, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1295, file: !2, line: 338, column: 17)
!1299 = !DILocation(line: 326, column: 24, scope: !1172)
!1300 = !{!1280, !1281, i64 48}
!1301 = !DILocation(line: 344, column: 21, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 344, column: 11)
!1303 = !DILocation(line: 344, column: 11, scope: !1132)
!1304 = !DILocation(line: 345, column: 9, scope: !1302)
!1305 = !DILocation(line: 351, column: 5, scope: !1133)
!1306 = !DILocation(line: 351, column: 5, scope: !1132)
!1307 = !DILocation(line: 353, column: 28, scope: !1118)
!1308 = !DILocation(line: 353, column: 53, scope: !1118)
!1309 = !DILocation(line: 356, column: 36, scope: !1183)
!1310 = !DILocation(line: 0, scope: !1180)
!1311 = !DILocation(line: 356, column: 3, scope: !1180)
!1312 = !DILocation(line: 383, column: 10, scope: !1118)
!1313 = !DILocation(line: 383, column: 3, scope: !1118)
!1314 = !DILocation(line: 358, column: 16, scope: !1182)
!1315 = !DILocation(line: 0, scope: !1182)
!1316 = !DILocation(line: 359, column: 14, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1182, file: !2, line: 359, column: 11)
!1318 = !DILocation(line: 359, column: 11, scope: !1182)
!1319 = !DILocation(line: 365, column: 17, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1321, file: !2, line: 365, column: 15)
!1321 = distinct !DILexicalBlock(scope: !1317, file: !2, line: 360, column: 9)
!1322 = !DILocation(line: 0, scope: !1320)
!1323 = !DILocation(line: 365, column: 27, scope: !1320)
!1324 = !DILocation(line: 365, column: 30, scope: !1320)
!1325 = !DILocation(line: 365, column: 36, scope: !1320)
!1326 = !DILocation(line: 365, column: 15, scope: !1321)
!1327 = !DILocalVariable(name: "fd", arg: 1, scope: !1328, file: !2, line: 107, type: !104)
!1328 = distinct !DISubprogram(name: "do_ftruncate", scope: !2, file: !2, line: 107, type: !1329, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1331)
!1329 = !DISubroutineType(types: !1330)
