; ModuleID = 'src/tsort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.tokenbuffer = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.item = type { ptr, ptr, ptr, i8, i8, i64, ptr, ptr }
%struct.successor = type { ptr, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [100 x i8] c"Usage: %s [OPTION] [FILE]\0AWrite totally ordered list consistent with the partial ordering in FILE.\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"tsort\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !111, !116, !47, !121, !123, !128, !130, !135, !137, !142, !225, !227, !229, !234, !236, !238, !240, !242, !247, !249, !251, !253, !258, !260, !262, !264, !266, !268, !270, !272, !274, !279, !284, !289, !291, !293, !295, !297, !302, !307, !309, !311, !316, !321, !326, !331, !333, !335, !337, !342, !344, !349, !354, !356, !358, !360, !365, !367, !369, !387, !389}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 5)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 8)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !14, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 14)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !125, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 17)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 574, type: !14, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !58, line: 729, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 56)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !144, file: !58, line: 575, type: !52, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "oputs_", scope: !58, file: !58, line: 573, type: !145, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !147)
!145 = !DISubroutineType(cc: DW_CC_nocall, types: !146)
!146 = !{null, !107, !107}
!147 = !{!148, !149, !150, !153, !155, !156, !157, !161, !162, !163, !164, !166, !219, !220, !221, !223, !224}
!148 = !DILocalVariable(name: "program", arg: 1, scope: !144, file: !58, line: 573, type: !107)
!149 = !DILocalVariable(name: "option", arg: 2, scope: !144, file: !58, line: 573, type: !107)
!150 = !DILocalVariable(name: "term", scope: !151, file: !58, line: 585, type: !107)
!151 = distinct !DILexicalBlock(scope: !152, file: !58, line: 582, column: 5)
!152 = distinct !DILexicalBlock(scope: !144, file: !58, line: 581, column: 7)
!153 = !DILocalVariable(name: "double_space", scope: !144, file: !58, line: 594, type: !154)
!154 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!155 = !DILocalVariable(name: "first_word", scope: !144, file: !58, line: 595, type: !107)
!156 = !DILocalVariable(name: "option_text", scope: !144, file: !58, line: 596, type: !107)
!157 = !DILocalVariable(name: "s", scope: !158, file: !58, line: 608, type: !107)
!158 = distinct !DILexicalBlock(scope: !159, file: !58, line: 605, column: 5)
!159 = distinct !DILexicalBlock(scope: !160, file: !58, line: 604, column: 12)
!160 = distinct !DILexicalBlock(scope: !144, file: !58, line: 597, column: 7)
!161 = !DILocalVariable(name: "spaces", scope: !158, file: !58, line: 609, type: !104)
!162 = !DILocalVariable(name: "anchor_len", scope: !144, file: !58, line: 620, type: !104)
!163 = !DILocalVariable(name: "desc_text", scope: !144, file: !58, line: 625, type: !107)
!164 = !DILocalVariable(name: "__ptr", scope: !165, file: !58, line: 644, type: !107)
!165 = distinct !DILexicalBlock(scope: !144, file: !58, line: 644, column: 3)
!166 = !DILocalVariable(name: "__stream", scope: !165, file: !58, line: 644, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !169, line: 7, baseType: !170)
!169 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !171, line: 49, size: 1728, elements: !172)
!171 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !188, !190, !191, !192, !196, !197, !199, !200, !203, !205, !208, !211, !212, !213, !214, !215}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !170, file: !171, line: 51, baseType: !52, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !170, file: !171, line: 54, baseType: !54, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !170, file: !171, line: 55, baseType: !54, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !170, file: !171, line: 56, baseType: !54, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !170, file: !171, line: 57, baseType: !54, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !170, file: !171, line: 58, baseType: !54, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !170, file: !171, line: 59, baseType: !54, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !170, file: !171, line: 60, baseType: !54, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !170, file: !171, line: 61, baseType: !54, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !170, file: !171, line: 64, baseType: !54, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !170, file: !171, line: 65, baseType: !54, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !170, file: !171, line: 66, baseType: !54, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !170, file: !171, line: 68, baseType: !186, size: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !171, line: 36, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !170, file: !171, line: 70, baseType: !189, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !170, file: !171, line: 72, baseType: !52, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !170, file: !171, line: 73, baseType: !52, size: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !170, file: !171, line: 74, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !194, line: 152, baseType: !195)
!194 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!195 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !170, file: !171, line: 77, baseType: !103, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !170, file: !171, line: 78, baseType: !198, size: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !170, file: !171, line: 79, baseType: !34, size: 8, offset: 1048)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !170, file: !171, line: 81, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !171, line: 43, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !170, file: !171, line: 89, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !194, line: 153, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !170, file: !171, line: 91, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !171, line: 37, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !170, file: !171, line: 92, baseType: !209, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !171, line: 38, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !170, file: !171, line: 93, baseType: !189, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !170, file: !171, line: 94, baseType: !102, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !170, file: !171, line: 95, baseType: !104, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !170, file: !171, line: 96, baseType: !52, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !170, file: !171, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DILocalVariable(name: "__cnt", scope: !165, file: !58, line: 644, type: !104)
!220 = !DILocalVariable(name: "url_program", scope: !144, file: !58, line: 648, type: !107)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !58, line: 686, type: !107)
!222 = distinct !DILexicalBlock(scope: !144, file: !58, line: 686, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !58, line: 686, type: !167)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !58, line: 686, type: !104)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !58, line: 585, type: !113, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !58, line: 586, type: !113, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !58, line: 595, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !58, line: 620, type: !19, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !14, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !58, line: 648, type: !113, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !231, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !58, line: 649, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !58, line: 650, type: !113, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !58, line: 651, type: !19, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !58, line: 652, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !58, line: 653, type: !118, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !58, line: 654, type: !39, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !58, line: 655, type: !39, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !58, line: 656, type: !39, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !58, line: 657, type: !39, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !58, line: 663, type: !255, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !58, line: 664, type: !39, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !132, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !58, line: 669, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 40)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 15)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 61)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !58, line: 679, type: !244, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !58, line: 683, type: !113, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !58, line: 688, type: !113, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !58, line: 691, type: !118, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !58, line: 839, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !58, line: 840, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 22)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !58, line: 841, type: !281, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !58, line: 862, type: !231, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !58, line: 868, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 71)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !58, line: 875, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 27)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 51)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !58, line: 877, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 12)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !14, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !244, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !281, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 9)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !328, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 200, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 25)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 472, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 43)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !318, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !281, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 432, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 54)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !118, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "n_strings", scope: !55, file: !2, line: 72, type: !104, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "head", scope: !55, file: !2, line: 63, type: !371, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !2, line: 51, size: 448, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !372, file: !2, line: 53, baseType: !107, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !372, file: !2, line: 54, baseType: !371, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !372, file: !2, line: 55, baseType: !198, size: 8, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !372, file: !2, line: 56, baseType: !154, size: 8, offset: 200)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !372, file: !2, line: 57, baseType: !104, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "qlink", scope: !372, file: !2, line: 58, baseType: !371, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !372, file: !2, line: 59, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "successor", file: !2, line: 44, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "suc", scope: !383, file: !2, line: 46, baseType: !371, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !2, line: 47, baseType: !382, size: 64, offset: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "zeros", scope: !55, file: !2, line: 66, type: !371, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "loop", scope: !55, file: !2, line: 69, type: !371, isLocal: true, isDefinition: true)
!391 = !{!392, !393, !394}
!392 = !DILocalVariable(name: "argc", arg: 1, scope: !49, file: !2, line: 531, type: !52)
!393 = !DILocalVariable(name: "argv", arg: 2, scope: !49, file: !2, line: 531, type: !53)
!394 = !DILocalVariable(name: "c", scope: !395, file: !2, line: 549, type: !52)
!395 = distinct !DILexicalBlock(scope: !49, file: !2, line: 542, column: 5)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 768, elements: !245)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !399, line: 50, size: 256, elements: !400)
!399 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!400 = !{!401, !402, !403, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 52, baseType: !107, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !398, file: !399, line: 55, baseType: !52, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !399, line: 56, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !398, file: !399, line: 57, baseType: !52, size: 32, offset: 192)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !408, line: 3, type: !281, isLocal: true, isDefinition: true)
!408 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "Version", scope: !411, file: !408, line: 3, type: !107, isLocal: false, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C11, file: !408, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!412 = !{!406, !409}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "file_name", scope: !415, file: !416, line: 45, type: !107, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !417, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!417 = !{!418, !420, !422, !424, !413, !426}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !255, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !416, line: 121, type: !328, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !416, line: 123, type: !255, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !416, line: 126, type: !244, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !415, file: !416, line: 55, type: !154, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !430, file: !431, line: 66, type: !482, isLocal: false, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C11, file: !431, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !432, globals: !433, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!432 = !{!102, !109}
!433 = !{!434, !436, !461, !463, !465, !467, !428, !469, !471, !473, !475, !480}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !431, line: 272, type: !113, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "old_file_name", scope: !438, file: !431, line: 304, type: !107, isLocal: true, isDefinition: true)
!438 = distinct !DISubprogram(name: "verror_at_line", scope: !431, file: !431, line: 298, type: !439, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !430, retainedNodes: !454)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !52, !52, !107, !64, !107, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !442, line: 52, baseType: !443)
!442 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !444, line: 14, baseType: !445)
!444 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !446, baseType: !447)
!446 = !DIFile(filename: "lib/error.c", directory: "/src")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !447, file: !446, baseType: !102, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !447, file: !446, baseType: !102, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !447, file: !446, baseType: !102, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !447, file: !446, baseType: !52, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !447, file: !446, baseType: !52, size: 32, offset: 224)
!454 = !{!455, !456, !457, !458, !459, !460}
!455 = !DILocalVariable(name: "status", arg: 1, scope: !438, file: !431, line: 298, type: !52)
!456 = !DILocalVariable(name: "errnum", arg: 2, scope: !438, file: !431, line: 298, type: !52)
!457 = !DILocalVariable(name: "file_name", arg: 3, scope: !438, file: !431, line: 298, type: !107)
!458 = !DILocalVariable(name: "line_number", arg: 4, scope: !438, file: !431, line: 298, type: !64)
!459 = !DILocalVariable(name: "message", arg: 5, scope: !438, file: !431, line: 298, type: !107)
!460 = !DILocalVariable(name: "args", arg: 6, scope: !438, file: !431, line: 298, type: !441)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "old_line_number", scope: !438, file: !431, line: 305, type: !64, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !431, line: 338, type: !231, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !118, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !431, line: 346, type: !14, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "error_message_count", scope: !430, file: !431, line: 69, type: !64, isLocal: false, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !430, file: !431, line: 295, type: !52, isLocal: false, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !255, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !431, line: 208, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 21)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !431, line: 214, type: !113, isLocal: true, isDefinition: true)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null}
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !487, line: 40, type: !39, isLocal: true, isDefinition: true)
!487 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "program_name", scope: !490, file: !491, line: 31, type: !107, isLocal: false, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C11, file: !491, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !492, globals: !493, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!492 = !{!54}
!493 = !{!488, !494, !496}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !491, line: 46, type: !118, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !491, line: 49, type: !231, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "utf07FF", scope: !500, file: !501, line: 46, type: !528, isLocal: true, isDefinition: true)
!500 = distinct !DISubprogram(name: "proper_name_lite", scope: !501, file: !501, line: 38, type: !502, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !506)
!501 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!502 = !DISubroutineType(types: !503)
!503 = !{!107, !107, !107}
!504 = distinct !DICompileUnit(language: DW_LANG_C11, file: !501, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !505, splitDebugInlining: false, nameTableKind: None)
!505 = !{!498}
!506 = !{!507, !508, !509, !510, !515}
!507 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !500, file: !501, line: 38, type: !107)
!508 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !500, file: !501, line: 38, type: !107)
!509 = !DILocalVariable(name: "translation", scope: !500, file: !501, line: 40, type: !107)
!510 = !DILocalVariable(name: "w", scope: !500, file: !501, line: 47, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !512, line: 37, baseType: !513)
!512 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !194, line: 57, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !194, line: 42, baseType: !64)
!515 = !DILocalVariable(name: "mbs", scope: !500, file: !501, line: 48, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !517, line: 6, baseType: !518)
!517 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !519, line: 21, baseType: !520)
!519 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 13, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !520, file: !519, line: 15, baseType: !52, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !520, file: !519, line: 20, baseType: !524, size: 32, offset: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !519, line: 16, size: 32, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !524, file: !519, line: 18, baseType: !64, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !524, file: !519, line: 19, baseType: !231, size: 32)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16, elements: !15)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !531, line: 78, type: !118, isLocal: true, isDefinition: true)
!531 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !531, line: 79, type: !19, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !531, line: 80, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 13)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !531, line: 81, type: !536, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !531, line: 82, type: !216, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !531, line: 83, type: !14, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !531, line: 84, type: !118, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !531, line: 85, type: !255, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !531, line: 86, type: !255, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !531, line: 87, type: !118, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !555, file: !531, line: 76, type: !627, isLocal: false, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C11, file: !531, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !556, retainedTypes: !562, globals: !563, splitDebugInlining: false, nameTableKind: None)
!556 = !{!78, !557, !62}
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !79, line: 254, baseType: !64, size: 32, elements: !558)
!558 = !{!559, !560, !561}
!559 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!560 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!561 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!562 = !{!52, !103, !104}
!563 = !{!529, !532, !534, !539, !541, !543, !545, !547, !549, !551, !553, !564, !568, !578, !580, !585, !587, !589, !591, !593, !616, !623, !625}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !555, file: !531, line: 92, type: !566, isLocal: false, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 320, elements: !40)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !555, file: !531, line: 1040, type: !570, isLocal: false, isDefinition: true)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !531, line: 56, size: 448, elements: !571)
!571 = !{!572, !573, !574, !576, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !570, file: !531, line: 59, baseType: !78, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !570, file: !531, line: 62, baseType: !52, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !570, file: !531, line: 66, baseType: !575, size: 256, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !119)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !570, file: !531, line: 69, baseType: !107, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !570, file: !531, line: 72, baseType: !107, size: 64, offset: 384)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !555, file: !531, line: 107, type: !570, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "slot0", scope: !555, file: !531, line: 831, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 256)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !531, line: 321, type: !14, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !531, line: 357, type: !14, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !531, line: 358, type: !14, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !531, line: 199, type: !255, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "quote", scope: !595, file: !531, line: 228, type: !614, isLocal: true, isDefinition: true)
!595 = distinct !DISubprogram(name: "gettext_quote", scope: !531, file: !531, line: 197, type: !596, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !555, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!107, !107, !78}
!598 = !{!599, !600, !601, !602, !603}
!599 = !DILocalVariable(name: "msgid", arg: 1, scope: !595, file: !531, line: 197, type: !107)
!600 = !DILocalVariable(name: "s", arg: 2, scope: !595, file: !531, line: 197, type: !78)
!601 = !DILocalVariable(name: "translation", scope: !595, file: !531, line: 199, type: !107)
!602 = !DILocalVariable(name: "w", scope: !595, file: !531, line: 229, type: !511)
!603 = !DILocalVariable(name: "mbs", scope: !595, file: !531, line: 230, type: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !517, line: 6, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !519, line: 21, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 13, size: 64, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !606, file: !519, line: 15, baseType: !52, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !606, file: !519, line: 20, baseType: !610, size: 32, offset: 32)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !519, line: 16, size: 32, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !610, file: !519, line: 18, baseType: !64, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !610, file: !519, line: 19, baseType: !231, size: 32)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !615)
!615 = !{!16, !233}
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "slotvec", scope: !555, file: !531, line: 834, type: !618, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !531, line: 823, size: 128, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !531, line: 825, baseType: !104, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !619, file: !531, line: 826, baseType: !54, size: 64, offset: 64)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "nslots", scope: !555, file: !531, line: 832, type: !52, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "slotvec0", scope: !555, file: !531, line: 833, type: !619, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 704, elements: !629)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!629 = !{!630}
!630 = !DISubrange(count: 11)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !633, line: 67, type: !328, isLocal: true, isDefinition: true)
!633 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !633, line: 69, type: !255, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !633, line: 83, type: !255, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !633, line: 83, type: !231, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !633, line: 85, type: !14, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !633, line: 88, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 171)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !633, line: 88, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 34)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !633, line: 105, type: !299, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !633, line: 109, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 23)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !633, line: 113, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 28)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !633, line: 120, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 32)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !633, line: 127, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 36)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !633, line: 134, type: !276, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !633, line: 142, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 44)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !633, line: 150, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 48)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !633, line: 159, type: !688, isLocal: true, isDefinition: true)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 52)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !633, line: 170, type: !693, isLocal: true, isDefinition: true)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 60)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !633, line: 248, type: !216, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !633, line: 248, type: !304, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !633, line: 254, type: !216, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !633, line: 254, type: !125, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !633, line: 254, type: !276, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !633, line: 259, type: !3, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !633, line: 259, type: !710, isLocal: true, isDefinition: true)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 29)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !715, file: !716, line: 26, type: !718, isLocal: false, isDefinition: true)
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !716, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!717 = !{!713}
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 376, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 47)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "exit_failure", scope: !723, file: !724, line: 24, type: !726, isLocal: false, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!725 = !{!721}
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !729, line: 34, type: !244, isLocal: true, isDefinition: true)
!729 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !729, line: 34, type: !255, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !729, line: 34, type: !132, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !736, line: 108, type: !34, isLocal: true, isDefinition: true)
!736 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "internal_state", scope: !739, file: !736, line: 97, type: !742, isLocal: true, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C11, file: !736, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !740, globals: !741, splitDebugInlining: false, nameTableKind: None)
!740 = !{!102, !104, !109}
!741 = !{!734, !737}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !517, line: 6, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !519, line: 21, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 13, size: 64, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !744, file: !519, line: 15, baseType: !52, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !744, file: !519, line: 20, baseType: !748, size: 32, offset: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !744, file: !519, line: 16, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !748, file: !519, line: 18, baseType: !64, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !748, file: !519, line: 19, baseType: !231, size: 32)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !754, line: 35, type: !14, isLocal: true, isDefinition: true)
!754 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !754, line: 35, type: !19, isLocal: true, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !759, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!759 = !{!92}
!760 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!762 = distinct !DICompileUnit(language: DW_LANG_C11, file: !763, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!764 = !{!102}
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !487, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !766, splitDebugInlining: false, nameTableKind: None)
!766 = !{!485}
!767 = distinct !DICompileUnit(language: DW_LANG_C11, file: !768, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!769 = distinct !DICompileUnit(language: DW_LANG_C11, file: !770, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!771 = distinct !DICompileUnit(language: DW_LANG_C11, file: !772, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !773, retainedTypes: !777, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/readtokens.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bd27ae043f20cb5dd96b528a940c0bf9")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !772, line: 50, baseType: !64, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIEnumerator(name: "bits_per_word", value: 64)
!777 = !{!104, !102, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !633, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !764, globals: !784, splitDebugInlining: false, nameTableKind: None)
!780 = !{!781}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 40, baseType: !64, size: 32, elements: !782)
!782 = !{!783}
!783 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!784 = !{!631, !634, !636, !638, !640, !642, !647, !652, !654, !659, !664, !669, !674, !676, !681, !686, !691, !696, !698, !700, !702, !704, !706, !708}
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !787, retainedTypes: !818, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!787 = !{!788, !800}
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !789, file: !786, line: 188, baseType: !64, size: 32, elements: !798)
!789 = distinct !DISubprogram(name: "x2nrealloc", scope: !786, file: !786, line: 176, type: !790, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !785, retainedNodes: !793)
!790 = !DISubroutineType(types: !791)
!791 = !{!102, !102, !792, !104}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!793 = !{!794, !795, !796, !797}
!794 = !DILocalVariable(name: "p", arg: 1, scope: !789, file: !786, line: 176, type: !102)
!795 = !DILocalVariable(name: "pn", arg: 2, scope: !789, file: !786, line: 176, type: !792)
!796 = !DILocalVariable(name: "s", arg: 3, scope: !789, file: !786, line: 176, type: !104)
!797 = !DILocalVariable(name: "n", scope: !789, file: !786, line: 178, type: !104)
!798 = !{!799}
!799 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !801, file: !786, line: 228, baseType: !64, size: 32, elements: !798)
!801 = distinct !DISubprogram(name: "xpalloc", scope: !786, file: !786, line: 223, type: !802, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !785, retainedNodes: !808)
!802 = !DISubroutineType(types: !803)
!803 = !{!102, !102, !804, !805, !807, !805}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !806, line: 130, baseType: !807)
!806 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !105, line: 35, baseType: !195)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817}
!809 = !DILocalVariable(name: "pa", arg: 1, scope: !801, file: !786, line: 223, type: !102)
!810 = !DILocalVariable(name: "pn", arg: 2, scope: !801, file: !786, line: 223, type: !804)
!811 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !801, file: !786, line: 223, type: !805)
!812 = !DILocalVariable(name: "n_max", arg: 4, scope: !801, file: !786, line: 223, type: !807)
!813 = !DILocalVariable(name: "s", arg: 5, scope: !801, file: !786, line: 223, type: !805)
!814 = !DILocalVariable(name: "n0", scope: !801, file: !786, line: 230, type: !805)
!815 = !DILocalVariable(name: "n", scope: !801, file: !786, line: 237, type: !805)
!816 = !DILocalVariable(name: "nbytes", scope: !801, file: !786, line: 248, type: !805)
!817 = !DILocalVariable(name: "adjusted_nbytes", scope: !801, file: !786, line: 252, type: !805)
!818 = !{!54, !102, !154, !195, !106}
!819 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !820, splitDebugInlining: false, nameTableKind: None)
!820 = !{!727, !730, !732}
!821 = distinct !DICompileUnit(language: DW_LANG_C11, file: !822, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!822 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !824, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !825, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!825 = !{!154, !106, !102}
!826 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !827, splitDebugInlining: false, nameTableKind: None)
!827 = !{!752, !755}
!828 = distinct !DICompileUnit(language: DW_LANG_C11, file: !829, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!830 = distinct !DICompileUnit(language: DW_LANG_C11, file: !831, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!832 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!833 = !{i32 7, !"Dwarf Version", i32 5}
!834 = !{i32 2, !"Debug Info Version", i32 3}
!835 = !{i32 1, !"wchar_size", i32 4}
!836 = !{i32 8, !"PIC Level", i32 2}
!837 = !{i32 7, !"PIE Level", i32 2}
!838 = !{i32 7, !"uwtable", i32 2}
!839 = !{i32 7, !"frame-pointer", i32 1}
!840 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 75, type: !841, scopeLine: 76, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !52}
!843 = !{!844}
!844 = !DILocalVariable(name: "status", arg: 1, scope: !840, file: !2, line: 75, type: !52)
!845 = !DILocation(line: 0, scope: !840)
!846 = !DILocation(line: 77, column: 14, scope: !847)
!847 = distinct !DILexicalBlock(scope: !840, file: !2, line: 77, column: 7)
!848 = !DILocation(line: 77, column: 7, scope: !840)
!849 = !DILocation(line: 78, column: 5, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !2, line: 78, column: 5)
!851 = !{!852, !852, i64 0}
!852 = !{!"any pointer", !853, i64 0}
!853 = !{!"omnipotent char", !854, i64 0}
!854 = !{!"Simple C/C++ TBAA"}
!855 = !DILocation(line: 81, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !847, file: !2, line: 80, column: 5)
!857 = !DILocation(line: 729, column: 3, scope: !858, inlinedAt: !860)
!858 = distinct !DISubprogram(name: "emit_stdin_note", scope: !58, file: !58, line: 727, type: !483, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !859)
!859 = !{}
!860 = distinct !DILocation(line: 86, column: 7, scope: !856)
!861 = !DILocation(line: 88, column: 7, scope: !856)
!862 = !DILocation(line: 91, column: 7, scope: !856)
!863 = !DILocation(line: 92, column: 7, scope: !856)
!864 = !DILocalVariable(name: "program", arg: 1, scope: !865, file: !58, line: 836, type: !107)
!865 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 836, type: !866, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !107}
!868 = !{!864, !869, !876, !877, !879, !880}
!869 = !DILocalVariable(name: "infomap", scope: !865, file: !58, line: 838, type: !870)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 896, elements: !256)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !865, file: !58, line: 838, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !872, file: !58, line: 838, baseType: !107, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !872, file: !58, line: 838, baseType: !107, size: 64, offset: 64)
!876 = !DILocalVariable(name: "node", scope: !865, file: !58, line: 848, type: !107)
!877 = !DILocalVariable(name: "map_prog", scope: !865, file: !58, line: 849, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!879 = !DILocalVariable(name: "lc_messages", scope: !865, file: !58, line: 861, type: !107)
!880 = !DILocalVariable(name: "url_program", scope: !865, file: !58, line: 874, type: !107)
!881 = !DILocation(line: 0, scope: !865, inlinedAt: !882)
!882 = distinct !DILocation(line: 93, column: 7, scope: !856)
!883 = !DILocation(line: 857, column: 3, scope: !865, inlinedAt: !882)
!884 = !DILocation(line: 861, column: 29, scope: !865, inlinedAt: !882)
!885 = !DILocation(line: 862, column: 7, scope: !886, inlinedAt: !882)
!886 = distinct !DILexicalBlock(scope: !865, file: !58, line: 862, column: 7)
!887 = !DILocation(line: 862, column: 19, scope: !886, inlinedAt: !882)
!888 = !DILocation(line: 862, column: 22, scope: !886, inlinedAt: !882)
!889 = !DILocation(line: 862, column: 7, scope: !865, inlinedAt: !882)
!890 = !DILocation(line: 868, column: 7, scope: !891, inlinedAt: !882)
!891 = distinct !DILexicalBlock(scope: !886, file: !58, line: 863, column: 5)
!892 = !DILocation(line: 870, column: 5, scope: !891, inlinedAt: !882)
!893 = !DILocation(line: 875, column: 3, scope: !865, inlinedAt: !882)
!894 = !DILocation(line: 877, column: 3, scope: !865, inlinedAt: !882)
!895 = !DILocation(line: 96, column: 3, scope: !840)
!896 = !DISubprogram(name: "dcgettext", scope: !897, file: !897, line: 51, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!897 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!898 = !DISubroutineType(types: !899)
!899 = !{!54, !107, !107, !52}
!900 = !DISubprogram(name: "__fprintf_chk", scope: !901, file: !901, line: 93, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!901 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!902 = !DISubroutineType(types: !903)
!903 = !{!52, !904, !52, !905, null}
!904 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !167)
!905 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!906 = !DISubprogram(name: "__printf_chk", scope: !901, file: !901, line: 95, type: !907, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!907 = !DISubroutineType(types: !908)
!908 = !{!52, !52, !905, null}
!909 = !DISubprogram(name: "fputs_unlocked", scope: !442, file: !442, line: 691, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!910 = !DISubroutineType(types: !911)
!911 = !{!52, !905, !904}
!912 = !DILocation(line: 0, scope: !144)
!913 = !DILocation(line: 581, column: 7, scope: !152)
!914 = !{!915, !915, i64 0}
!915 = !{!"int", !853, i64 0}
!916 = !DILocation(line: 581, column: 19, scope: !152)
!917 = !DILocation(line: 581, column: 7, scope: !144)
!918 = !DILocation(line: 585, column: 26, scope: !151)
!919 = !DILocation(line: 0, scope: !151)
!920 = !DILocation(line: 586, column: 23, scope: !151)
!921 = !DILocation(line: 586, column: 28, scope: !151)
!922 = !DILocation(line: 586, column: 32, scope: !151)
!923 = !{!853, !853, i64 0}
!924 = !DILocation(line: 586, column: 38, scope: !151)
!925 = !DILocalVariable(name: "__s1", arg: 1, scope: !926, file: !927, line: 1359, type: !107)
!926 = distinct !DISubprogram(name: "streq", scope: !927, file: !927, line: 1359, type: !928, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !930)
!927 = !DIFile(filename: "./lib/string.h", directory: "/src")
!928 = !DISubroutineType(types: !929)
!929 = !{!154, !107, !107}
!930 = !{!925, !931}
!931 = !DILocalVariable(name: "__s2", arg: 2, scope: !926, file: !927, line: 1359, type: !107)
!932 = !DILocation(line: 0, scope: !926, inlinedAt: !933)
!933 = distinct !DILocation(line: 586, column: 41, scope: !151)
!934 = !DILocation(line: 1361, column: 11, scope: !926, inlinedAt: !933)
!935 = !DILocation(line: 1361, column: 10, scope: !926, inlinedAt: !933)
!936 = !DILocation(line: 586, column: 19, scope: !151)
!937 = !DILocation(line: 587, column: 5, scope: !151)
!938 = !DILocation(line: 588, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !144, file: !58, line: 588, column: 7)
!940 = !DILocation(line: 588, column: 7, scope: !144)
!941 = !DILocation(line: 590, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !939, file: !58, line: 589, column: 5)
!943 = !DILocation(line: 591, column: 7, scope: !942)
!944 = !DILocation(line: 595, column: 37, scope: !144)
!945 = !DILocation(line: 595, column: 35, scope: !144)
!946 = !DILocation(line: 596, column: 29, scope: !144)
!947 = !DILocation(line: 597, column: 8, scope: !160)
!948 = !DILocation(line: 597, column: 7, scope: !144)
!949 = !DILocation(line: 604, column: 24, scope: !159)
!950 = !DILocation(line: 604, column: 12, scope: !160)
!951 = !DILocation(line: 0, scope: !158)
!952 = !DILocation(line: 610, column: 16, scope: !158)
!953 = !DILocation(line: 610, column: 7, scope: !158)
!954 = !DILocation(line: 611, column: 21, scope: !158)
!955 = !{!956, !956, i64 0}
!956 = !{!"short", !853, i64 0}
!957 = !DILocation(line: 611, column: 19, scope: !158)
!958 = !DILocation(line: 611, column: 16, scope: !158)
!959 = !DILocation(line: 610, column: 30, scope: !158)
!960 = distinct !{!960, !953, !954, !961}
!961 = !{!"llvm.loop.mustprogress"}
!962 = !DILocation(line: 612, column: 18, scope: !963)
!963 = distinct !DILexicalBlock(scope: !158, file: !58, line: 612, column: 11)
!964 = !DILocation(line: 612, column: 11, scope: !158)
!965 = !DILocation(line: 620, column: 23, scope: !144)
!966 = !DILocation(line: 625, column: 39, scope: !144)
!967 = !DILocation(line: 626, column: 3, scope: !144)
!968 = !DILocation(line: 626, column: 10, scope: !144)
!969 = !DILocation(line: 626, column: 21, scope: !144)
!970 = !DILocation(line: 628, column: 44, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !58, line: 628, column: 11)
!972 = distinct !DILexicalBlock(scope: !144, file: !58, line: 627, column: 5)
!973 = !DILocation(line: 628, column: 32, scope: !971)
!974 = !DILocation(line: 628, column: 49, scope: !971)
!975 = !DILocation(line: 628, column: 11, scope: !972)
!976 = !DILocation(line: 630, column: 11, scope: !977)
!977 = distinct !DILexicalBlock(scope: !972, file: !58, line: 630, column: 11)
!978 = !DILocation(line: 630, column: 11, scope: !972)
!979 = !DILocation(line: 632, column: 26, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !58, line: 632, column: 15)
!981 = distinct !DILexicalBlock(scope: !977, file: !58, line: 631, column: 9)
!982 = !DILocation(line: 632, column: 34, scope: !980)
!983 = !DILocation(line: 632, column: 37, scope: !980)
!984 = !DILocation(line: 632, column: 15, scope: !981)
!985 = !DILocation(line: 640, column: 16, scope: !972)
!986 = distinct !{!986, !967, !987, !961}
!987 = !DILocation(line: 641, column: 5, scope: !144)
!988 = !DILocation(line: 644, column: 3, scope: !144)
!989 = !DILocation(line: 0, scope: !926, inlinedAt: !990)
!990 = distinct !DILocation(line: 648, column: 31, scope: !144)
!991 = !DILocation(line: 0, scope: !926, inlinedAt: !992)
!992 = distinct !DILocation(line: 649, column: 31, scope: !144)
!993 = !DILocation(line: 0, scope: !926, inlinedAt: !994)
!994 = distinct !DILocation(line: 650, column: 31, scope: !144)
!995 = !DILocation(line: 0, scope: !926, inlinedAt: !996)
!996 = distinct !DILocation(line: 651, column: 31, scope: !144)
!997 = !DILocation(line: 0, scope: !926, inlinedAt: !998)
!998 = distinct !DILocation(line: 652, column: 31, scope: !144)
!999 = !DILocation(line: 0, scope: !926, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 653, column: 31, scope: !144)
!1001 = !DILocation(line: 0, scope: !926, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 654, column: 31, scope: !144)
!1003 = !DILocation(line: 0, scope: !926, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 655, column: 31, scope: !144)
!1005 = !DILocation(line: 0, scope: !926, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 656, column: 31, scope: !144)
!1007 = !DILocation(line: 0, scope: !926, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 657, column: 31, scope: !144)
!1009 = !DILocation(line: 663, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !144, file: !58, line: 663, column: 7)
!1011 = !DILocation(line: 664, column: 7, scope: !1010)
!1012 = !DILocation(line: 664, column: 10, scope: !1010)
!1013 = !DILocation(line: 663, column: 7, scope: !144)
!1014 = !DILocation(line: 669, column: 7, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !58, line: 665, column: 5)
!1016 = !DILocation(line: 671, column: 5, scope: !1015)
!1017 = !DILocation(line: 676, column: 7, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1010, file: !58, line: 673, column: 5)
!1019 = !DILocation(line: 679, column: 3, scope: !144)
!1020 = !DILocation(line: 683, column: 3, scope: !144)
!1021 = !DILocation(line: 686, column: 3, scope: !144)
!1022 = !DILocation(line: 688, column: 3, scope: !144)
!1023 = !DILocation(line: 691, column: 3, scope: !144)
!1024 = !DILocation(line: 695, column: 3, scope: !144)
!1025 = !DILocation(line: 696, column: 1, scope: !144)
!1026 = !DISubprogram(name: "setlocale", scope: !1027, file: !1027, line: 122, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1027 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!54, !52, !107}
!1030 = !DISubprogram(name: "strncmp", scope: !1031, file: !1031, line: 159, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1031 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!52, !107, !107, !104}
!1034 = !DISubprogram(name: "exit", scope: !1035, file: !1035, line: 624, type: !841, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1035 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1036 = !DISubprogram(name: "getenv", scope: !1035, file: !1035, line: 641, type: !1037, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!54, !107}
!1039 = !DISubprogram(name: "strcmp", scope: !1031, file: !1031, line: 156, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!52, !107, !107}
!1042 = !DISubprogram(name: "strspn", scope: !1031, file: !1031, line: 297, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!106, !107, !107}
!1045 = !DISubprogram(name: "strchr", scope: !1031, file: !1031, line: 246, type: !1046, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!54, !107, !52}
!1048 = !DISubprogram(name: "__ctype_b_loc", scope: !63, file: !63, line: 79, type: !1049, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1054 = !DISubprogram(name: "strcspn", scope: !1031, file: !1031, line: 293, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1055 = !DISubprogram(name: "fwrite_unlocked", scope: !442, file: !442, line: 704, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!104, !1058, !104, !104, !904}
!1058 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1061 = !DILocation(line: 0, scope: !49)
!1062 = !DILocation(line: 534, column: 21, scope: !49)
!1063 = !DILocation(line: 534, column: 3, scope: !49)
!1064 = !DILocation(line: 535, column: 3, scope: !49)
!1065 = !DILocation(line: 536, column: 3, scope: !49)
!1066 = !DILocation(line: 537, column: 3, scope: !49)
!1067 = !DILocation(line: 539, column: 3, scope: !49)
!1068 = !DILocation(line: 541, column: 3, scope: !49)
!1069 = !DILocation(line: 549, column: 15, scope: !395)
!1070 = !DILocation(line: 0, scope: !395)
!1071 = !DILocation(line: 551, column: 11, scope: !395)
!1072 = !DILocation(line: 559, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !395, file: !2, line: 555, column: 9)
!1074 = !DILocation(line: 561, column: 9, scope: !1073)
!1075 = !DILocation(line: 564, column: 11, scope: !1073)
!1076 = !DILocation(line: 568, column: 18, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !49, file: !2, line: 568, column: 7)
!1078 = !DILocation(line: 568, column: 16, scope: !1077)
!1079 = !DILocation(line: 568, column: 9, scope: !1077)
!1080 = !DILocation(line: 568, column: 7, scope: !49)
!1081 = !DILocation(line: 570, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1077, file: !2, line: 569, column: 5)
!1083 = !DILocation(line: 571, column: 7, scope: !1082)
!1084 = !DILocation(line: 574, column: 17, scope: !49)
!1085 = !DILocation(line: 574, column: 10, scope: !49)
!1086 = !DILocation(line: 574, column: 33, scope: !49)
!1087 = !DILocation(line: 574, column: 3, scope: !49)
!1088 = !DISubprogram(name: "bindtextdomain", scope: !897, file: !897, line: 86, type: !1089, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!54, !107, !107}
!1091 = !DISubprogram(name: "textdomain", scope: !897, file: !897, line: 82, type: !1037, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1092 = !DISubprogram(name: "atexit", scope: !1035, file: !1035, line: 602, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!52, !482}
!1095 = !DISubprogram(name: "getopt_long", scope: !399, file: !399, line: 66, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!52, !52, !1098, !107, !1100, !404}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!1101 = distinct !DISubprogram(name: "tsort", scope: !2, file: !2, line: 429, type: !866, scopeLine: 430, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1114, !1115, !1116, !1118}
!1103 = !DILocalVariable(name: "file", arg: 1, scope: !1101, file: !2, line: 429, type: !107)
!1104 = !DILocalVariable(name: "ok", scope: !1101, file: !2, line: 431, type: !154)
!1105 = !DILocalVariable(name: "j", scope: !1101, file: !2, line: 432, type: !371)
!1106 = !DILocalVariable(name: "k", scope: !1101, file: !2, line: 433, type: !371)
!1107 = !DILocalVariable(name: "tokenbuffer", scope: !1101, file: !2, line: 434, type: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_buffer", file: !1109, line: 38, baseType: !1110)
!1109 = !DIFile(filename: "./lib/readtokens.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75cc48641d199743577b153a0d1c82de")
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !1109, line: 33, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !1109, line: 35, baseType: !104, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1110, file: !1109, line: 36, baseType: !54, size: 64, offset: 64)
!1114 = !DILocalVariable(name: "is_stdin", scope: !1101, file: !2, line: 435, type: !154)
!1115 = !DILocalVariable(name: "root", scope: !1101, file: !2, line: 438, type: !371)
!1116 = !DILocalVariable(name: "len", scope: !1117, file: !2, line: 450, type: !104)
!1117 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 448, column: 5)
!1118 = !DILocalVariable(name: "p", scope: !1119, file: !2, line: 485, type: !382)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 484, column: 9)
!1120 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 479, column: 5)
!1121 = !DILocation(line: 0, scope: !1101)
!1122 = !DILocation(line: 434, column: 3, scope: !1101)
!1123 = !DILocation(line: 434, column: 16, scope: !1101)
!1124 = !DILocation(line: 0, scope: !926, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 435, column: 19, scope: !1101)
!1126 = !DILocation(line: 1361, column: 11, scope: !926, inlinedAt: !1125)
!1127 = !DILocation(line: 1361, column: 10, scope: !926, inlinedAt: !1125)
!1128 = !DILocalVariable(name: "str", arg: 1, scope: !1129, file: !2, line: 101, type: !107)
!1129 = distinct !DISubprogram(name: "new_item", scope: !2, file: !2, line: 101, type: !1130, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1132)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!371, !107}
!1132 = !{!1128, !1133}
!1133 = !DILocalVariable(name: "k", scope: !1129, file: !2, line: 104, type: !371)
!1134 = !DILocation(line: 0, scope: !1129, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 438, column: 23, scope: !1101)
!1136 = !DILocation(line: 104, column: 20, scope: !1129, inlinedAt: !1135)
!1137 = !DILocation(line: 440, column: 17, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 440, column: 7)
!1139 = !DILocation(line: 440, column: 42, scope: !1138)
!1140 = !DILocation(line: 440, column: 22, scope: !1138)
!1141 = !DILocation(line: 440, column: 7, scope: !1101)
!1142 = !DILocation(line: 441, column: 5, scope: !1138)
!1143 = !DILocation(line: 443, column: 12, scope: !1101)
!1144 = !DILocation(line: 443, column: 3, scope: !1101)
!1145 = !DILocation(line: 445, column: 3, scope: !1101)
!1146 = !DILocation(line: 447, column: 3, scope: !1101)
!1147 = !DILocation(line: 433, column: 16, scope: !1101)
!1148 = !DILocation(line: 450, column: 31, scope: !1117)
!1149 = !DILocation(line: 450, column: 20, scope: !1117)
!1150 = !DILocation(line: 0, scope: !1117)
!1151 = !DILocation(line: 451, column: 11, scope: !1117)
!1152 = !DILocation(line: 453, column: 15, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 453, column: 15)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 452, column: 9)
!1155 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 451, column: 11)
!1156 = !DILocalVariable(name: "__stream", arg: 1, scope: !1157, file: !1158, line: 135, type: !167)
!1157 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1158, file: !1158, line: 135, type: !1159, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1161)
!1158 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!52, !167}
!1161 = !{!1156}
!1162 = !DILocation(line: 0, scope: !1157, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 453, column: 15, scope: !1153)
!1164 = !DILocation(line: 137, column: 10, scope: !1157, inlinedAt: !1163)
!1165 = !{!1166, !915, i64 0}
!1166 = !{!"_IO_FILE", !915, i64 0, !852, i64 8, !852, i64 16, !852, i64 24, !852, i64 32, !852, i64 40, !852, i64 48, !852, i64 56, !852, i64 64, !852, i64 72, !852, i64 80, !852, i64 88, !852, i64 96, !852, i64 104, !915, i64 112, !915, i64 116, !1167, i64 120, !956, i64 128, !853, i64 130, !853, i64 131, !852, i64 136, !1167, i64 144, !852, i64 152, !852, i64 160, !852, i64 168, !852, i64 176, !1167, i64 184, !915, i64 192, !853, i64 196}
!1167 = !{!"long", !853, i64 0}
!1168 = !DILocation(line: 453, column: 15, scope: !1154)
!1169 = !DILocation(line: 454, column: 13, scope: !1153)
!1170 = !DILocation(line: 458, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 458, column: 7)
!1172 = distinct !DILexicalBlock(scope: !1117, file: !2, line: 458, column: 7)
!1173 = !DILocation(line: 460, column: 42, scope: !1117)
!1174 = !{!1175, !852, i64 8}
!1175 = !{!"tokenbuffer", !1167, i64 0, !852, i64 8}
!1176 = !DILocalVariable(name: "root", arg: 1, scope: !1177, file: !2, line: 119, type: !371)
!1177 = distinct !DISubprogram(name: "search_item", scope: !2, file: !2, line: 119, type: !1178, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1180)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!371, !371, !107}
!1180 = !{!1176, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!1181 = !DILocalVariable(name: "str", arg: 2, scope: !1177, file: !2, line: 119, type: !107)
!1182 = !DILocalVariable(name: "p", scope: !1177, file: !2, line: 121, type: !371)
!1183 = !DILocalVariable(name: "q", scope: !1177, file: !2, line: 121, type: !371)
!1184 = !DILocalVariable(name: "r", scope: !1177, file: !2, line: 121, type: !371)
!1185 = !DILocalVariable(name: "s", scope: !1177, file: !2, line: 121, type: !371)
!1186 = !DILocalVariable(name: "t", scope: !1177, file: !2, line: 121, type: !371)
!1187 = !DILocalVariable(name: "a", scope: !1177, file: !2, line: 122, type: !52)
!1188 = !DILocalVariable(name: "cmp", scope: !1189, file: !2, line: 173, type: !52)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 172, column: 13)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 147, column: 9)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 146, column: 11)
!1192 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 134, column: 5)
!1193 = !DILocation(line: 0, scope: !1177, inlinedAt: !1194)
!1194 = distinct !DILocation(line: 460, column: 11, scope: !1117)
!1195 = !DILocation(line: 126, column: 13, scope: !1196, inlinedAt: !1194)
!1196 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 126, column: 7)
!1197 = !{!1198, !852, i64 16}
!1198 = !{!"item", !852, i64 0, !852, i64 8, !852, i64 16, !853, i64 24, !1199, i64 25, !1167, i64 32, !852, i64 40, !852, i64 48}
!1199 = !{!"_Bool", !853, i64 0}
!1200 = !DILocation(line: 126, column: 19, scope: !1196, inlinedAt: !1194)
!1201 = !DILocation(line: 126, column: 7, scope: !1177, inlinedAt: !1194)
!1202 = !DILocation(line: 136, column: 27, scope: !1192, inlinedAt: !1194)
!1203 = !{!1198, !852, i64 0}
!1204 = !DILocation(line: 136, column: 11, scope: !1192, inlinedAt: !1194)
!1205 = !DILocation(line: 137, column: 13, scope: !1206, inlinedAt: !1194)
!1206 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 137, column: 11)
!1207 = !DILocation(line: 137, column: 11, scope: !1192, inlinedAt: !1194)
!1208 = !DILocation(line: 0, scope: !1129, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 127, column: 27, scope: !1196, inlinedAt: !1194)
!1210 = !DILocation(line: 104, column: 20, scope: !1129, inlinedAt: !1209)
!1211 = !DILocation(line: 105, column: 7, scope: !1212, inlinedAt: !1209)
!1212 = distinct !DILexicalBlock(scope: !1129, file: !2, line: 105, column: 7)
!1213 = !DILocation(line: 105, column: 7, scope: !1129, inlinedAt: !1209)
!1214 = !DILocation(line: 106, column: 14, scope: !1212, inlinedAt: !1209)
!1215 = !DILocation(line: 106, column: 12, scope: !1212, inlinedAt: !1209)
!1216 = !DILocation(line: 106, column: 5, scope: !1212, inlinedAt: !1209)
!1217 = !DILocation(line: 127, column: 25, scope: !1196, inlinedAt: !1194)
!1218 = !DILocation(line: 127, column: 5, scope: !1196, inlinedAt: !1194)
!1219 = !DILocation(line: 141, column: 13, scope: !1220, inlinedAt: !1194)
!1220 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 141, column: 11)
!1221 = !DILocation(line: 141, column: 11, scope: !1192, inlinedAt: !1194)
!1222 = !DILocation(line: 0, scope: !1220, inlinedAt: !1194)
!1223 = !DILocation(line: 146, column: 13, scope: !1191, inlinedAt: !1194)
!1224 = !DILocation(line: 146, column: 11, scope: !1192, inlinedAt: !1194)
!1225 = !DILocation(line: 0, scope: !1129, inlinedAt: !1226)
!1226 = distinct !DILocation(line: 149, column: 15, scope: !1190, inlinedAt: !1194)
!1227 = !DILocation(line: 104, column: 20, scope: !1129, inlinedAt: !1226)
!1228 = !DILocation(line: 105, column: 7, scope: !1212, inlinedAt: !1226)
!1229 = !DILocation(line: 105, column: 7, scope: !1129, inlinedAt: !1226)
!1230 = !DILocation(line: 106, column: 14, scope: !1212, inlinedAt: !1226)
!1231 = !DILocation(line: 106, column: 12, scope: !1212, inlinedAt: !1226)
!1232 = !DILocation(line: 106, column: 5, scope: !1212, inlinedAt: !1226)
!1233 = !DILocation(line: 0, scope: !1234, inlinedAt: !1194)
!1234 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 152, column: 15)
!1235 = !DILocation(line: 158, column: 31, scope: !1190, inlinedAt: !1194)
!1236 = !DILocation(line: 158, column: 15, scope: !1190, inlinedAt: !1194)
!1237 = !DILocation(line: 159, column: 17, scope: !1238, inlinedAt: !1194)
!1238 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 159, column: 15)
!1239 = !DILocation(line: 159, column: 15, scope: !1190, inlinedAt: !1194)
!1240 = !DILocation(line: 161, column: 26, scope: !1241, inlinedAt: !1194)
!1241 = distinct !DILexicalBlock(scope: !1238, file: !2, line: 160, column: 13)
!1242 = !DILocation(line: 163, column: 13, scope: !1241, inlinedAt: !1194)
!1243 = !DILocation(line: 166, column: 15, scope: !1244, inlinedAt: !1194)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !2, line: 166, column: 15)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !2, line: 166, column: 15)
!1246 = distinct !DILexicalBlock(scope: !1238, file: !2, line: 165, column: 13)
!1247 = !DILocation(line: 166, column: 15, scope: !1245, inlinedAt: !1194)
!1248 = !DILocation(line: 167, column: 26, scope: !1246, inlinedAt: !1194)
