; ModuleID = 'src/tty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [67 x i8] c"Print the file name of the terminal connected to standard input.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"tty\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [76 x i8] c"  -s, --silent, --quiet\0A         print nothing, only return an exit status\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !32

!86 = !DIEnumerator(name: "_IScntrl", value: 2)
!87 = !DIEnumerator(name: "_ISpunct", value: 4)
!88 = !DIEnumerator(name: "_ISalnum", value: 8)
!89 = !{!90, !91, !70, !92, !93, !96, !98}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !100, !105, !110, !115, !117, !119, !122, !204, !209, !211, !213, !218, !220, !222, !224, !229, !231, !233, !235, !240, !245, !247, !249, !251, !253, !255, !257, !259, !264, !269, !274, !276, !278, !280, !282, !284, !289, !291, !293, !298, !303, !308, !313, !315, !317, !319, !57}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 14)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 16)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 17)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !102, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !44, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "silent", scope: !59, file: !2, line: 47, type: !121, isLocal: true, isDefinition: true)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !124, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!124 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !125, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !127)
!125 = !DISubroutineType(cc: DW_CC_nocall, types: !126)
!126 = !{null, !96, !96}
!127 = !{!128, !129, !130, !133, !134, !135, !136, !140, !141, !142, !143, !145, !198, !199, !200, !202, !203}
!128 = !DILocalVariable(name: "program", arg: 1, scope: !124, file: !69, line: 573, type: !96)
!129 = !DILocalVariable(name: "option", arg: 2, scope: !124, file: !69, line: 573, type: !96)
!130 = !DILocalVariable(name: "term", scope: !131, file: !69, line: 585, type: !96)
!131 = distinct !DILexicalBlock(scope: !132, file: !69, line: 582, column: 5)
!132 = distinct !DILexicalBlock(scope: !124, file: !69, line: 581, column: 7)
!133 = !DILocalVariable(name: "double_space", scope: !124, file: !69, line: 594, type: !121)
!134 = !DILocalVariable(name: "first_word", scope: !124, file: !69, line: 595, type: !96)
!135 = !DILocalVariable(name: "option_text", scope: !124, file: !69, line: 596, type: !96)
!136 = !DILocalVariable(name: "s", scope: !137, file: !69, line: 608, type: !96)
!137 = distinct !DILexicalBlock(scope: !138, file: !69, line: 605, column: 5)
!138 = distinct !DILexicalBlock(scope: !139, file: !69, line: 604, column: 12)
!139 = distinct !DILexicalBlock(scope: !124, file: !69, line: 597, column: 7)
!140 = !DILocalVariable(name: "spaces", scope: !137, file: !69, line: 609, type: !93)
!141 = !DILocalVariable(name: "anchor_len", scope: !124, file: !69, line: 620, type: !93)
!142 = !DILocalVariable(name: "desc_text", scope: !124, file: !69, line: 625, type: !96)
!143 = !DILocalVariable(name: "__ptr", scope: !144, file: !69, line: 644, type: !96)
!144 = distinct !DILexicalBlock(scope: !124, file: !69, line: 644, column: 3)
!145 = !DILocalVariable(name: "__stream", scope: !144, file: !69, line: 644, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !148, line: 7, baseType: !149)
!148 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !150, line: 49, size: 1728, elements: !151)
!150 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !167, !169, !170, !171, !175, !176, !178, !179, !182, !184, !187, !190, !191, !192, !193, !194}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !149, file: !150, line: 51, baseType: !70, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !149, file: !150, line: 54, baseType: !90, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !149, file: !150, line: 55, baseType: !90, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !149, file: !150, line: 56, baseType: !90, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !149, file: !150, line: 57, baseType: !90, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !149, file: !150, line: 58, baseType: !90, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !149, file: !150, line: 59, baseType: !90, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !149, file: !150, line: 60, baseType: !90, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !149, file: !150, line: 61, baseType: !90, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !149, file: !150, line: 64, baseType: !90, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !149, file: !150, line: 65, baseType: !90, size: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !149, file: !150, line: 66, baseType: !90, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !149, file: !150, line: 68, baseType: !165, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !150, line: 36, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !149, file: !150, line: 70, baseType: !168, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !149, file: !150, line: 72, baseType: !70, size: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !149, file: !150, line: 73, baseType: !70, size: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !149, file: !150, line: 74, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !173, line: 152, baseType: !174)
!173 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !149, file: !150, line: 77, baseType: !92, size: 16, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !149, file: !150, line: 78, baseType: !177, size: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !149, file: !150, line: 79, baseType: !39, size: 8, offset: 1048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !149, file: !150, line: 81, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !150, line: 43, baseType: null)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !149, file: !150, line: 89, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !173, line: 153, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !149, file: !150, line: 91, baseType: !185, size: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !150, line: 37, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !149, file: !150, line: 92, baseType: !188, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !150, line: 38, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !149, file: !150, line: 93, baseType: !168, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !149, file: !150, line: 94, baseType: !91, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !149, file: !150, line: 95, baseType: !93, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !149, file: !150, line: 96, baseType: !70, size: 32, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !149, file: !150, line: 98, baseType: !195, size: 160, offset: 1568)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 20)
!198 = !DILocalVariable(name: "__cnt", scope: !144, file: !69, line: 644, type: !93)
!199 = !DILocalVariable(name: "url_program", scope: !124, file: !69, line: 648, type: !96)
!200 = !DILocalVariable(name: "__ptr", scope: !201, file: !69, line: 686, type: !96)
!201 = distinct !DILexicalBlock(scope: !124, file: !69, line: 686, column: 3)
!202 = !DILocalVariable(name: "__stream", scope: !201, file: !69, line: 686, type: !146)
!203 = !DILocalVariable(name: "__cnt", scope: !201, file: !69, line: 686, type: !93)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 5)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !206, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !19, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 6)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !54, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !206, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !19, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !206, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !215, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !215, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 7)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 8)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !44, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !44, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !44, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !44, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !237, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !44, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !112, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 40)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 15)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 61)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !226, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !206, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !206, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !242, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !107, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 22)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !266, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 71)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 27)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 51)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 12)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !237, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !215, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !206, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !242, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1280, elements: !207)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !324, line: 50, size: 256, elements: !325)
!324 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!325 = !{!326, !327, !328, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !324, line: 52, baseType: !96, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !323, file: !324, line: 55, baseType: !70, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 56, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !323, file: !324, line: 57, baseType: !70, size: 32, offset: 192)
!331 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !334, line: 3, type: !266, isLocal: true, isDefinition: true)
!334 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "Version", scope: !337, file: !334, line: 3, type: !96, isLocal: false, isDefinition: true)
!337 = distinct !DICompileUnit(language: DW_LANG_C11, file: !334, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !338, splitDebugInlining: false, nameTableKind: None)
!338 = !{!332, !335}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "file_name", scope: !341, file: !342, line: 45, type: !96, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C11, file: !342, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!343 = !{!344, !346, !348, !350, !339, !352}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !342, line: 121, type: !237, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !342, line: 121, type: !310, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !342, line: 123, type: !237, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !342, line: 126, type: !226, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !341, file: !342, line: 55, type: !121, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !356, file: !357, line: 66, type: !408, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C11, file: !357, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!358 = !{!91, !98}
!359 = !{!360, !362, !387, !389, !391, !393, !354, !395, !397, !399, !401, !406}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !357, line: 272, type: !206, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "old_file_name", scope: !364, file: !357, line: 304, type: !96, isLocal: true, isDefinition: true)
!364 = distinct !DISubprogram(name: "verror_at_line", scope: !357, file: !357, line: 298, type: !365, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !380)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !70, !70, !96, !62, !96, !367}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !368, line: 52, baseType: !369)
!368 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !370, line: 14, baseType: !371)
!370 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !372, baseType: !373)
!372 = !DIFile(filename: "lib/error.c", directory: "/src")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !373, file: !372, baseType: !91, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !373, file: !372, baseType: !91, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !373, file: !372, baseType: !91, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !373, file: !372, baseType: !70, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !373, file: !372, baseType: !70, size: 32, offset: 224)
!380 = !{!381, !382, !383, !384, !385, !386}
!381 = !DILocalVariable(name: "status", arg: 1, scope: !364, file: !357, line: 298, type: !70)
!382 = !DILocalVariable(name: "errnum", arg: 2, scope: !364, file: !357, line: 298, type: !70)
!383 = !DILocalVariable(name: "file_name", arg: 3, scope: !364, file: !357, line: 298, type: !96)
!384 = !DILocalVariable(name: "line_number", arg: 4, scope: !364, file: !357, line: 298, type: !62)
!385 = !DILocalVariable(name: "message", arg: 5, scope: !364, file: !357, line: 298, type: !96)
!386 = !DILocalVariable(name: "args", arg: 6, scope: !364, file: !357, line: 298, type: !367)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "old_line_number", scope: !364, file: !357, line: 305, type: !62, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !357, line: 338, type: !19, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !357, line: 346, type: !242, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !357, line: 346, type: !54, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "error_message_count", scope: !356, file: !357, line: 69, type: !62, isLocal: false, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !356, file: !357, line: 295, type: !70, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !357, line: 208, type: !237, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !357, line: 208, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 21)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !357, line: 214, type: !206, isLocal: true, isDefinition: true)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "program_name", scope: !413, file: !414, line: 31, type: !96, isLocal: false, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C11, file: !414, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !415, globals: !416, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!415 = !{!90}
!416 = !{!411, !417, !419}
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !414, line: 46, type: !242, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !414, line: 49, type: !19, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "utf07FF", scope: !423, file: !424, line: 46, type: !451, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "proper_name_lite", scope: !424, file: !424, line: 38, type: !425, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !427, retainedNodes: !429)
!424 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!425 = !DISubroutineType(types: !426)
!426 = !{!96, !96, !96}
!427 = distinct !DICompileUnit(language: DW_LANG_C11, file: !424, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !428, splitDebugInlining: false, nameTableKind: None)
!428 = !{!421}
!429 = !{!430, !431, !432, !433, !438}
!430 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !423, file: !424, line: 38, type: !96)
!431 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !423, file: !424, line: 38, type: !96)
!432 = !DILocalVariable(name: "translation", scope: !423, file: !424, line: 40, type: !96)
!433 = !DILocalVariable(name: "w", scope: !423, file: !424, line: 47, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !435, line: 37, baseType: !436)
!435 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !173, line: 57, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !173, line: 42, baseType: !62)
!438 = !DILocalVariable(name: "mbs", scope: !423, file: !424, line: 48, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !441)
!440 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !443)
!442 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !443, file: !442, line: 15, baseType: !70, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !443, file: !442, line: 20, baseType: !447, size: 32, offset: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !442, line: 16, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !447, file: !442, line: 18, baseType: !62, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !447, file: !442, line: 19, baseType: !19, size: 32)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16, elements: !55)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !454, line: 78, type: !242, isLocal: true, isDefinition: true)
!454 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !454, line: 79, type: !215, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !454, line: 80, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 13)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !454, line: 81, type: !459, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !454, line: 82, type: !195, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !454, line: 83, type: !54, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !454, line: 84, type: !242, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !454, line: 85, type: !237, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !454, line: 86, type: !237, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !454, line: 87, type: !242, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !478, file: !454, line: 76, type: !564, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C11, file: !454, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, retainedTypes: !499, globals: !500, splitDebugInlining: false, nameTableKind: None)
!479 = !{!480, !494, !74}
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !481, line: 42, baseType: !62, size: 32, elements: !482)
!481 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!483 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!484 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!485 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!486 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!487 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!488 = !DIEnumerator(name: "c_quoting_style", value: 5)
!489 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!490 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!491 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!492 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!493 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !481, line: 254, baseType: !62, size: 32, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!497 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!498 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!499 = !{!70, !92, !93}
!500 = !{!452, !455, !457, !462, !464, !466, !468, !470, !472, !474, !476, !501, !505, !515, !517, !522, !524, !526, !528, !530, !553, !560, !562}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !478, file: !454, line: 92, type: !503, isLocal: false, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !45)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !478, file: !454, line: 1040, type: !507, isLocal: false, isDefinition: true)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !454, line: 56, size: 448, elements: !508)
!508 = !{!509, !510, !511, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !507, file: !454, line: 59, baseType: !480, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !507, file: !454, line: 62, baseType: !70, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !507, file: !454, line: 66, baseType: !512, size: 256, offset: 64)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !243)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !507, file: !454, line: 69, baseType: !96, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !507, file: !454, line: 72, baseType: !96, size: 64, offset: 384)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !478, file: !454, line: 107, type: !507, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "slot0", scope: !478, file: !454, line: 831, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 256)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !454, line: 321, type: !54, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !454, line: 357, type: !54, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !454, line: 358, type: !54, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !454, line: 199, type: !237, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "quote", scope: !532, file: !454, line: 228, type: !551, isLocal: true, isDefinition: true)
!532 = distinct !DISubprogram(name: "gettext_quote", scope: !454, file: !454, line: 197, type: !533, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !478, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!96, !96, !480}
!535 = !{!536, !537, !538, !539, !540}
!536 = !DILocalVariable(name: "msgid", arg: 1, scope: !532, file: !454, line: 197, type: !96)
!537 = !DILocalVariable(name: "s", arg: 2, scope: !532, file: !454, line: 197, type: !480)
!538 = !DILocalVariable(name: "translation", scope: !532, file: !454, line: 199, type: !96)
!539 = !DILocalVariable(name: "w", scope: !532, file: !454, line: 229, type: !434)
!540 = !DILocalVariable(name: "mbs", scope: !532, file: !454, line: 230, type: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !543, file: !442, line: 15, baseType: !70, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !543, file: !442, line: 20, baseType: !547, size: 32, offset: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !442, line: 16, size: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !547, file: !442, line: 18, baseType: !62, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !547, file: !442, line: 19, baseType: !19, size: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !552)
!552 = !{!56, !21}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "slotvec", scope: !478, file: !454, line: 834, type: !555, isLocal: true, isDefinition: true)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !454, line: 823, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !454, line: 825, baseType: !93, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !556, file: !454, line: 826, baseType: !90, size: 64, offset: 64)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "nslots", scope: !478, file: !454, line: 832, type: !70, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "slotvec0", scope: !478, file: !454, line: 833, type: !556, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 704, elements: !566)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!566 = !{!567}
!567 = !DISubrange(count: 11)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !570, line: 67, type: !310, isLocal: true, isDefinition: true)
!570 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !570, line: 69, type: !237, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !570, line: 83, type: !237, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !570, line: 83, type: !19, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !570, line: 85, type: !54, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !570, line: 88, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 171)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !570, line: 88, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 34)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !570, line: 105, type: !107, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !570, line: 109, type: !9, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !570, line: 113, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 28)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !570, line: 120, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !570, line: 127, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 36)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !570, line: 134, type: !261, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !570, line: 142, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 44)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !570, line: 150, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 48)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !570, line: 159, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 52)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !570, line: 170, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 60)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !570, line: 248, type: !195, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !570, line: 248, type: !286, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !570, line: 254, type: !195, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !570, line: 254, type: !102, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !570, line: 254, type: !261, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !570, line: 259, type: !3, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !570, line: 259, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 29)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !649, file: !650, line: 26, type: !652, isLocal: false, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C11, file: !650, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !651, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!651 = !{!647}
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 376, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 47)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "exit_failure", scope: !657, file: !658, line: 24, type: !660, isLocal: false, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C11, file: !658, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !659, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!659 = !{!655}
!660 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !663, line: 34, type: !226, isLocal: true, isDefinition: true)
!663 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !663, line: 34, type: !237, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !663, line: 34, type: !112, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !670, line: 108, type: !39, isLocal: true, isDefinition: true)
!670 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "internal_state", scope: !673, file: !670, line: 97, type: !676, isLocal: true, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C11, file: !670, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, globals: !675, splitDebugInlining: false, nameTableKind: None)
!674 = !{!91, !93, !98}
!675 = !{!668, !671}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !440, line: 6, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !442, line: 21, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 13, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !678, file: !442, line: 15, baseType: !70, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !678, file: !442, line: 20, baseType: !682, size: 32, offset: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !442, line: 16, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !682, file: !442, line: 18, baseType: !62, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !682, file: !442, line: 19, baseType: !19, size: 32)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !688, line: 35, type: !54, isLocal: true, isDefinition: true)
!688 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !688, line: 35, type: !215, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !570, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !698, globals: !699, splitDebugInlining: false, nameTableKind: None)
!694 = !{!695}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 40, baseType: !62, size: 32, elements: !696)
!696 = !{!697}
!697 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!698 = !{!91}
!699 = !{!568, !571, !573, !575, !577, !579, !584, !589, !591, !593, !598, !603, !608, !610, !615, !620, !625, !630, !632, !634, !636, !638, !640, !642}
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !702, retainedTypes: !733, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!702 = !{!703, !715}
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !704, file: !701, line: 188, baseType: !62, size: 32, elements: !713)
!704 = distinct !DISubprogram(name: "x2nrealloc", scope: !701, file: !701, line: 176, type: !705, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !700, retainedNodes: !708)
!705 = !DISubroutineType(types: !706)
!706 = !{!91, !91, !707, !93}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!708 = !{!709, !710, !711, !712}
!709 = !DILocalVariable(name: "p", arg: 1, scope: !704, file: !701, line: 176, type: !91)
!710 = !DILocalVariable(name: "pn", arg: 2, scope: !704, file: !701, line: 176, type: !707)
!711 = !DILocalVariable(name: "s", arg: 3, scope: !704, file: !701, line: 176, type: !93)
!712 = !DILocalVariable(name: "n", scope: !704, file: !701, line: 178, type: !93)
!713 = !{!714}
!714 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !716, file: !701, line: 228, baseType: !62, size: 32, elements: !713)
!716 = distinct !DISubprogram(name: "xpalloc", scope: !701, file: !701, line: 223, type: !717, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !700, retainedNodes: !723)
!717 = !DISubroutineType(types: !718)
!718 = !{!91, !91, !719, !720, !722, !720}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !721, line: 130, baseType: !722)
!721 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !94, line: 35, baseType: !174)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732}
!724 = !DILocalVariable(name: "pa", arg: 1, scope: !716, file: !701, line: 223, type: !91)
!725 = !DILocalVariable(name: "pn", arg: 2, scope: !716, file: !701, line: 223, type: !719)
!726 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !716, file: !701, line: 223, type: !720)
!727 = !DILocalVariable(name: "n_max", arg: 4, scope: !716, file: !701, line: 223, type: !722)
!728 = !DILocalVariable(name: "s", arg: 5, scope: !716, file: !701, line: 223, type: !720)
!729 = !DILocalVariable(name: "n0", scope: !716, file: !701, line: 230, type: !720)
!730 = !DILocalVariable(name: "n", scope: !716, file: !701, line: 237, type: !720)
!731 = !DILocalVariable(name: "nbytes", scope: !716, file: !701, line: 248, type: !720)
!732 = !DILocalVariable(name: "adjusted_nbytes", scope: !716, file: !701, line: 252, type: !720)
!733 = !{!90, !91, !121, !174, !95}
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !663, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !735, splitDebugInlining: false, nameTableKind: None)
!735 = !{!661, !664, !666}
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !698, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!742 = distinct !DICompileUnit(language: DW_LANG_C11, file: !743, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !698, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!744 = distinct !DICompileUnit(language: DW_LANG_C11, file: !745, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !746, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!746 = !{!121, !95, !91}
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !748, splitDebugInlining: false, nameTableKind: None)
!748 = !{!686, !689}
!749 = distinct !DICompileUnit(language: DW_LANG_C11, file: !750, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!751 = distinct !DICompileUnit(language: DW_LANG_C11, file: !752, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !698, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!753 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!754 = !{i32 7, !"Dwarf Version", i32 5}
!755 = !{i32 2, !"Debug Info Version", i32 3}
!756 = !{i32 1, !"wchar_size", i32 4}
!757 = !{i32 8, !"PIC Level", i32 2}
!758 = !{i32 7, !"PIE Level", i32 2}
!759 = !{i32 7, !"uwtable", i32 2}
!760 = !{i32 7, !"frame-pointer", i32 1}
!761 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 59, type: !762, scopeLine: 60, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !70}
!764 = !{!765}
!765 = !DILocalVariable(name: "status", arg: 1, scope: !761, file: !2, line: 59, type: !70)
!766 = !DILocation(line: 0, scope: !761)
!767 = !DILocation(line: 61, column: 14, scope: !768)
!768 = distinct !DILexicalBlock(scope: !761, file: !2, line: 61, column: 7)
!769 = !DILocation(line: 61, column: 7, scope: !761)
!770 = !DILocation(line: 62, column: 5, scope: !771)
!771 = distinct !DILexicalBlock(scope: !768, file: !2, line: 62, column: 5)
!772 = !{!773, !773, i64 0}
!773 = !{!"any pointer", !774, i64 0}
!774 = !{!"omnipotent char", !775, i64 0}
!775 = !{!"Simple C/C++ TBAA"}
!776 = !DILocation(line: 65, column: 7, scope: !777)
!777 = distinct !DILexicalBlock(scope: !768, file: !2, line: 64, column: 5)
!778 = !DILocation(line: 66, column: 7, scope: !777)
!779 = !DILocation(line: 70, column: 7, scope: !777)
!780 = !DILocation(line: 74, column: 7, scope: !777)
!781 = !DILocation(line: 75, column: 7, scope: !777)
!782 = !DILocalVariable(name: "program", arg: 1, scope: !783, file: !69, line: 836, type: !96)
!783 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !784, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !96}
!786 = !{!782, !787, !794, !795, !797, !798}
!787 = !DILocalVariable(name: "infomap", scope: !783, file: !69, line: 838, type: !788)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 896, elements: !238)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !783, file: !69, line: 838, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !790, file: !69, line: 838, baseType: !96, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !790, file: !69, line: 838, baseType: !96, size: 64, offset: 64)
!794 = !DILocalVariable(name: "node", scope: !783, file: !69, line: 848, type: !96)
!795 = !DILocalVariable(name: "map_prog", scope: !783, file: !69, line: 849, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!797 = !DILocalVariable(name: "lc_messages", scope: !783, file: !69, line: 861, type: !96)
!798 = !DILocalVariable(name: "url_program", scope: !783, file: !69, line: 874, type: !96)
!799 = !DILocation(line: 0, scope: !783, inlinedAt: !800)
!800 = distinct !DILocation(line: 76, column: 7, scope: !777)
!801 = !DILocation(line: 857, column: 3, scope: !783, inlinedAt: !800)
!802 = !DILocation(line: 861, column: 29, scope: !783, inlinedAt: !800)
!803 = !DILocation(line: 862, column: 7, scope: !804, inlinedAt: !800)
!804 = distinct !DILexicalBlock(scope: !783, file: !69, line: 862, column: 7)
!805 = !DILocation(line: 862, column: 19, scope: !804, inlinedAt: !800)
!806 = !DILocation(line: 862, column: 22, scope: !804, inlinedAt: !800)
!807 = !DILocation(line: 862, column: 7, scope: !783, inlinedAt: !800)
!808 = !DILocation(line: 868, column: 7, scope: !809, inlinedAt: !800)
!809 = distinct !DILexicalBlock(scope: !804, file: !69, line: 863, column: 5)
!810 = !DILocation(line: 870, column: 5, scope: !809, inlinedAt: !800)
!811 = !DILocation(line: 875, column: 3, scope: !783, inlinedAt: !800)
!812 = !DILocation(line: 877, column: 3, scope: !783, inlinedAt: !800)
!813 = !DILocation(line: 78, column: 3, scope: !761)
!814 = !DISubprogram(name: "dcgettext", scope: !815, file: !815, line: 51, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!815 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!816 = !DISubroutineType(types: !817)
!817 = !{!90, !96, !96, !70}
!818 = !{}
!819 = !DISubprogram(name: "__fprintf_chk", scope: !820, file: !820, line: 93, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!820 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!821 = !DISubroutineType(types: !822)
!822 = !{!70, !823, !70, !824, null}
!823 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !146)
!824 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!825 = !DISubprogram(name: "__printf_chk", scope: !820, file: !820, line: 95, type: !826, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!826 = !DISubroutineType(types: !827)
!827 = !{!70, !70, !824, null}
!828 = !DISubprogram(name: "fputs_unlocked", scope: !368, file: !368, line: 691, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!829 = !DISubroutineType(types: !830)
!830 = !{!70, !824, !823}
!831 = !DILocation(line: 0, scope: !124)
!832 = !DILocation(line: 581, column: 7, scope: !132)
!833 = !{!834, !834, i64 0}
!834 = !{!"int", !774, i64 0}
!835 = !DILocation(line: 581, column: 19, scope: !132)
!836 = !DILocation(line: 581, column: 7, scope: !124)
!837 = !DILocation(line: 585, column: 26, scope: !131)
!838 = !DILocation(line: 0, scope: !131)
!839 = !DILocation(line: 586, column: 23, scope: !131)
!840 = !DILocation(line: 586, column: 28, scope: !131)
!841 = !DILocation(line: 586, column: 32, scope: !131)
!842 = !{!774, !774, i64 0}
!843 = !DILocation(line: 586, column: 38, scope: !131)
!844 = !DILocalVariable(name: "__s1", arg: 1, scope: !845, file: !846, line: 1359, type: !96)
!845 = distinct !DISubprogram(name: "streq", scope: !846, file: !846, line: 1359, type: !847, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !849)
!846 = !DIFile(filename: "./lib/string.h", directory: "/src")
!847 = !DISubroutineType(types: !848)
!848 = !{!121, !96, !96}
!849 = !{!844, !850}
!850 = !DILocalVariable(name: "__s2", arg: 2, scope: !845, file: !846, line: 1359, type: !96)
!851 = !DILocation(line: 0, scope: !845, inlinedAt: !852)
!852 = distinct !DILocation(line: 586, column: 41, scope: !131)
!853 = !DILocation(line: 1361, column: 11, scope: !845, inlinedAt: !852)
!854 = !DILocation(line: 1361, column: 10, scope: !845, inlinedAt: !852)
!855 = !DILocation(line: 586, column: 19, scope: !131)
!856 = !DILocation(line: 587, column: 5, scope: !131)
!857 = !DILocation(line: 588, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !124, file: !69, line: 588, column: 7)
!859 = !DILocation(line: 588, column: 7, scope: !124)
!860 = !DILocation(line: 590, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !69, line: 589, column: 5)
!862 = !DILocation(line: 591, column: 7, scope: !861)
!863 = !DILocation(line: 595, column: 37, scope: !124)
!864 = !DILocation(line: 595, column: 35, scope: !124)
!865 = !DILocation(line: 596, column: 29, scope: !124)
!866 = !DILocation(line: 597, column: 8, scope: !139)
!867 = !DILocation(line: 597, column: 7, scope: !124)
!868 = !DILocation(line: 604, column: 24, scope: !138)
!869 = !DILocation(line: 604, column: 12, scope: !139)
!870 = !DILocation(line: 0, scope: !137)
!871 = !DILocation(line: 610, column: 16, scope: !137)
!872 = !DILocation(line: 610, column: 7, scope: !137)
!873 = !DILocation(line: 611, column: 21, scope: !137)
!874 = !{!875, !875, i64 0}
!875 = !{!"short", !774, i64 0}
!876 = !DILocation(line: 611, column: 19, scope: !137)
!877 = !DILocation(line: 611, column: 16, scope: !137)
!878 = !DILocation(line: 610, column: 30, scope: !137)
!879 = distinct !{!879, !872, !873, !880}
!880 = !{!"llvm.loop.mustprogress"}
!881 = !DILocation(line: 612, column: 18, scope: !882)
!882 = distinct !DILexicalBlock(scope: !137, file: !69, line: 612, column: 11)
!883 = !DILocation(line: 612, column: 11, scope: !137)
!884 = !DILocation(line: 620, column: 23, scope: !124)
!885 = !DILocation(line: 625, column: 39, scope: !124)
!886 = !DILocation(line: 626, column: 3, scope: !124)
!887 = !DILocation(line: 626, column: 10, scope: !124)
!888 = !DILocation(line: 626, column: 21, scope: !124)
!889 = !DILocation(line: 628, column: 44, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !69, line: 628, column: 11)
!891 = distinct !DILexicalBlock(scope: !124, file: !69, line: 627, column: 5)
!892 = !DILocation(line: 628, column: 32, scope: !890)
!893 = !DILocation(line: 628, column: 49, scope: !890)
!894 = !DILocation(line: 628, column: 11, scope: !891)
!895 = !DILocation(line: 630, column: 11, scope: !896)
!896 = distinct !DILexicalBlock(scope: !891, file: !69, line: 630, column: 11)
!897 = !DILocation(line: 630, column: 11, scope: !891)
!898 = !DILocation(line: 632, column: 26, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !69, line: 632, column: 15)
!900 = distinct !DILexicalBlock(scope: !896, file: !69, line: 631, column: 9)
!901 = !DILocation(line: 632, column: 34, scope: !899)
!902 = !DILocation(line: 632, column: 37, scope: !899)
!903 = !DILocation(line: 632, column: 15, scope: !900)
!904 = !DILocation(line: 640, column: 16, scope: !891)
!905 = distinct !{!905, !886, !906, !880}
!906 = !DILocation(line: 641, column: 5, scope: !124)
!907 = !DILocation(line: 644, column: 3, scope: !124)
!908 = !DILocation(line: 0, scope: !845, inlinedAt: !909)
!909 = distinct !DILocation(line: 648, column: 31, scope: !124)
!910 = !DILocation(line: 0, scope: !845, inlinedAt: !911)
!911 = distinct !DILocation(line: 649, column: 31, scope: !124)
!912 = !DILocation(line: 0, scope: !845, inlinedAt: !913)
!913 = distinct !DILocation(line: 650, column: 31, scope: !124)
!914 = !DILocation(line: 0, scope: !845, inlinedAt: !915)
!915 = distinct !DILocation(line: 651, column: 31, scope: !124)
!916 = !DILocation(line: 0, scope: !845, inlinedAt: !917)
!917 = distinct !DILocation(line: 652, column: 31, scope: !124)
!918 = !DILocation(line: 0, scope: !845, inlinedAt: !919)
!919 = distinct !DILocation(line: 653, column: 31, scope: !124)
!920 = !DILocation(line: 0, scope: !845, inlinedAt: !921)
!921 = distinct !DILocation(line: 654, column: 31, scope: !124)
!922 = !DILocation(line: 0, scope: !845, inlinedAt: !923)
!923 = distinct !DILocation(line: 655, column: 31, scope: !124)
!924 = !DILocation(line: 0, scope: !845, inlinedAt: !925)
!925 = distinct !DILocation(line: 656, column: 31, scope: !124)
!926 = !DILocation(line: 0, scope: !845, inlinedAt: !927)
!927 = distinct !DILocation(line: 657, column: 31, scope: !124)
!928 = !DILocation(line: 663, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !124, file: !69, line: 663, column: 7)
!930 = !DILocation(line: 664, column: 7, scope: !929)
!931 = !DILocation(line: 664, column: 10, scope: !929)
!932 = !DILocation(line: 663, column: 7, scope: !124)
!933 = !DILocation(line: 669, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !929, file: !69, line: 665, column: 5)
!935 = !DILocation(line: 671, column: 5, scope: !934)
!936 = !DILocation(line: 676, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !929, file: !69, line: 673, column: 5)
!938 = !DILocation(line: 679, column: 3, scope: !124)
!939 = !DILocation(line: 683, column: 3, scope: !124)
!940 = !DILocation(line: 686, column: 3, scope: !124)
!941 = !DILocation(line: 688, column: 3, scope: !124)
!942 = !DILocation(line: 691, column: 3, scope: !124)
!943 = !DILocation(line: 695, column: 3, scope: !124)
!944 = !DILocation(line: 696, column: 1, scope: !124)
!945 = !DISubprogram(name: "setlocale", scope: !946, file: !946, line: 122, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!946 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!947 = !DISubroutineType(types: !948)
!948 = !{!90, !70, !96}
!949 = !DISubprogram(name: "strncmp", scope: !950, file: !950, line: 159, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!950 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!951 = !DISubroutineType(types: !952)
!952 = !{!70, !96, !96, !93}
!953 = !DISubprogram(name: "exit", scope: !954, file: !954, line: 624, type: !762, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !818)
!954 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!955 = !DISubprogram(name: "getenv", scope: !954, file: !954, line: 641, type: !956, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!956 = !DISubroutineType(types: !957)
!957 = !{!90, !96}
!958 = !DISubprogram(name: "strcmp", scope: !950, file: !950, line: 156, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!959 = !DISubroutineType(types: !960)
!960 = !{!70, !96, !96}
!961 = !DISubprogram(name: "strspn", scope: !950, file: !950, line: 297, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!962 = !DISubroutineType(types: !963)
!963 = !{!95, !96, !96}
!964 = !DISubprogram(name: "strchr", scope: !950, file: !950, line: 246, type: !965, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!965 = !DISubroutineType(types: !966)
!966 = !{!90, !96, !70}
!967 = !DISubprogram(name: "__ctype_b_loc", scope: !75, file: !75, line: 79, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!968 = !DISubroutineType(types: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!973 = !DISubprogram(name: "strcspn", scope: !950, file: !950, line: 293, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!974 = !DISubprogram(name: "fwrite_unlocked", scope: !368, file: !368, line: 704, type: !975, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!975 = !DISubroutineType(types: !976)
!976 = !{!93, !977, !93, !93, !823}
!977 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!980 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !981, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !984)
!981 = !DISubroutineType(types: !982)
!982 = !{!70, !70, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!984 = !{!985, !986, !987, !988, !989, !990}
!985 = !DILocalVariable(name: "argc", arg: 1, scope: !980, file: !2, line: 82, type: !70)
!986 = !DILocalVariable(name: "argv", arg: 2, scope: !980, file: !2, line: 82, type: !983)
!987 = !DILocalVariable(name: "optc", scope: !980, file: !2, line: 84, type: !70)
!988 = !DILocalVariable(name: "status", scope: !980, file: !2, line: 121, type: !70)
!989 = !DILocalVariable(name: "tty", scope: !980, file: !2, line: 122, type: !96)
!990 = !DILocalVariable(name: "ttyname_err", scope: !991, file: !2, line: 128, type: !70)
!991 = distinct !DILexicalBlock(scope: !992, file: !2, line: 127, column: 5)
!992 = distinct !DILexicalBlock(scope: !980, file: !2, line: 124, column: 7)
!993 = !DILocation(line: 0, scope: !980)
!994 = !DILocation(line: 87, column: 21, scope: !980)
!995 = !DILocation(line: 87, column: 3, scope: !980)
!996 = !DILocation(line: 88, column: 3, scope: !980)
!997 = !DILocation(line: 89, column: 3, scope: !980)
!998 = !DILocation(line: 90, column: 3, scope: !980)
!999 = !DILocalVariable(name: "status", arg: 1, scope: !1000, file: !69, line: 102, type: !70)
!1000 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !69, file: !69, line: 102, type: !762, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1001)
!1001 = !{!999}
!1002 = !DILocation(line: 0, scope: !1000, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 92, column: 3, scope: !980)
!1004 = !DILocation(line: 105, column: 18, scope: !1005, inlinedAt: !1003)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !69, line: 104, column: 7)
!1006 = !DILocation(line: 93, column: 3, scope: !980)
!1007 = !DILocation(line: 95, column: 3, scope: !980)
!1008 = !DILocation(line: 95, column: 18, scope: !980)
!1009 = !DILocation(line: 100, column: 18, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !2, line: 98, column: 9)
!1011 = distinct !DILexicalBlock(scope: !980, file: !2, line: 96, column: 5)
!1012 = distinct !{!1012, !1007, !1013, !880}
!1013 = !DILocation(line: 110, column: 5, scope: !980)
!1014 = !DILocation(line: 103, column: 9, scope: !1010)
!1015 = !DILocation(line: 105, column: 9, scope: !1010)
!1016 = !DILocation(line: 108, column: 11, scope: !1010)
!1017 = !DILocation(line: 112, column: 7, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !980, file: !2, line: 112, column: 7)
!1019 = !DILocation(line: 112, column: 14, scope: !1018)
!1020 = !DILocation(line: 112, column: 7, scope: !980)
!1021 = !DILocation(line: 114, column: 7, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 113, column: 5)
!1023 = !DILocation(line: 115, column: 7, scope: !1022)
!1024 = !DILocation(line: 118, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !980, file: !2, line: 118, column: 7)
!1026 = !DILocation(line: 118, column: 7, scope: !980)
!1027 = !DILocation(line: 119, column: 12, scope: !1025)
!1028 = !DILocation(line: 119, column: 5, scope: !1025)
!1029 = !DILocation(line: 122, column: 21, scope: !980)
!1030 = !DILocation(line: 124, column: 7, scope: !992)
!1031 = !DILocation(line: 124, column: 7, scope: !980)
!1032 = !DILocation(line: 128, column: 25, scope: !991)
!1033 = !DILocation(line: 0, scope: !991)
!1034 = !DILocation(line: 129, column: 11, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !991, file: !2, line: 129, column: 11)
!1036 = !DILocation(line: 129, column: 11, scope: !991)
!1037 = !DILocation(line: 130, column: 9, scope: !1035)
!1038 = !DILocation(line: 131, column: 13, scope: !991)
!1039 = !DILocation(line: 0, scope: !992)
!1040 = !DILocation(line: 135, column: 3, scope: !980)
!1041 = !DILocation(line: 137, column: 1, scope: !980)
!1042 = !DISubprogram(name: "bindtextdomain", scope: !815, file: !815, line: 86, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!90, !96, !96}
!1045 = !DISubprogram(name: "textdomain", scope: !815, file: !815, line: 82, type: !956, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1046 = !DISubprogram(name: "atexit", scope: !954, file: !954, line: 602, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!70, !408}
!1049 = !DISubprogram(name: "getopt_long", scope: !324, file: !324, line: 66, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!70, !70, !1052, !96, !1054, !329}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!1055 = !DISubprogram(name: "isatty", scope: !1056, file: !1056, line: 809, type: !1057, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1056 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!70, !70}
!1059 = !DISubprogram(name: "ttyname", scope: !1056, file: !1056, line: 799, type: !1060, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!90, !70}
!1062 = !DISubprogram(name: "__errno_location", scope: !1063, file: !1063, line: 37, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1063 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!329}
!1066 = !DISubprogram(name: "puts", scope: !368, file: !368, line: 661, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!70, !96}
!1069 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !342, file: !342, line: 50, type: !784, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1070)
!1070 = !{!1071}
!1071 = !DILocalVariable(name: "file", arg: 1, scope: !1069, file: !342, line: 50, type: !96)
!1072 = !DILocation(line: 0, scope: !1069)
!1073 = !DILocation(line: 52, column: 13, scope: !1069)
!1074 = !DILocation(line: 53, column: 1, scope: !1069)
!1075 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !342, file: !342, line: 87, type: !1076, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !121}
!1078 = !{!1079}
!1079 = !DILocalVariable(name: "ignore", arg: 1, scope: !1075, file: !342, line: 87, type: !121)
!1080 = !DILocation(line: 0, scope: !1075)
!1081 = !DILocation(line: 89, column: 16, scope: !1075)
!1082 = !{!1083, !1083, i64 0}
!1083 = !{!"_Bool", !774, i64 0}
!1084 = !DILocation(line: 90, column: 1, scope: !1075)
!1085 = distinct !DISubprogram(name: "close_stdout", scope: !342, file: !342, line: 116, type: !409, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !1086)
!1086 = !{!1087}
!1087 = !DILocalVariable(name: "write_error", scope: !1088, file: !342, line: 121, type: !96)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !342, line: 120, column: 5)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !342, line: 118, column: 7)
!1090 = !DILocation(line: 118, column: 21, scope: !1089)
!1091 = !DILocation(line: 118, column: 7, scope: !1089)
!1092 = !DILocation(line: 118, column: 29, scope: !1089)
!1093 = !DILocation(line: 119, column: 7, scope: !1089)
!1094 = !DILocation(line: 119, column: 12, scope: !1089)
!1095 = !{i8 0, i8 2}
!1096 = !DILocation(line: 119, column: 25, scope: !1089)
!1097 = !DILocation(line: 119, column: 28, scope: !1089)
!1098 = !DILocation(line: 119, column: 34, scope: !1089)
!1099 = !DILocation(line: 118, column: 7, scope: !1085)
!1100 = !DILocation(line: 121, column: 33, scope: !1088)
!1101 = !DILocation(line: 0, scope: !1088)
!1102 = !DILocation(line: 122, column: 11, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1088, file: !342, line: 122, column: 11)
!1104 = !DILocation(line: 0, scope: !1103)
!1105 = !DILocation(line: 122, column: 11, scope: !1088)
!1106 = !DILocation(line: 123, column: 9, scope: !1103)
!1107 = !DILocation(line: 126, column: 9, scope: !1103)
!1108 = !DILocation(line: 128, column: 14, scope: !1088)
!1109 = !DILocation(line: 128, column: 7, scope: !1088)
!1110 = !DILocation(line: 133, column: 42, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1085, file: !342, line: 133, column: 7)
!1112 = !DILocation(line: 133, column: 28, scope: !1111)
!1113 = !DILocation(line: 133, column: 50, scope: !1111)
!1114 = !DILocation(line: 133, column: 7, scope: !1085)
!1115 = !DILocation(line: 134, column: 12, scope: !1111)
!1116 = !DILocation(line: 134, column: 5, scope: !1111)
!1117 = !DILocation(line: 135, column: 1, scope: !1085)
!1118 = !DISubprogram(name: "_exit", scope: !1056, file: !1056, line: 624, type: !762, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !818)
!1119 = distinct !DISubprogram(name: "verror", scope: !357, file: !357, line: 251, type: !1120, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1122)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{null, !70, !70, !96, !367}
!1122 = !{!1123, !1124, !1125, !1126}
!1123 = !DILocalVariable(name: "status", arg: 1, scope: !1119, file: !357, line: 251, type: !70)
!1124 = !DILocalVariable(name: "errnum", arg: 2, scope: !1119, file: !357, line: 251, type: !70)
!1125 = !DILocalVariable(name: "message", arg: 3, scope: !1119, file: !357, line: 251, type: !96)
!1126 = !DILocalVariable(name: "args", arg: 4, scope: !1119, file: !357, line: 251, type: !367)
!1127 = !DILocation(line: 0, scope: !1119)
!1128 = !DILocation(line: 251, column: 1, scope: !1119)
!1129 = !DILocation(line: 261, column: 3, scope: !1119)
!1130 = !DILocation(line: 265, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1119, file: !357, line: 265, column: 7)
!1132 = !DILocation(line: 265, column: 7, scope: !1119)
!1133 = !DILocation(line: 266, column: 5, scope: !1131)
!1134 = !DILocation(line: 272, column: 7, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !357, line: 268, column: 5)
!1136 = !DILocation(line: 276, column: 3, scope: !1119)
!1137 = !{i64 0, i64 8, !772, i64 8, i64 8, !772, i64 16, i64 8, !772, i64 24, i64 4, !833, i64 28, i64 4, !833}
!1138 = !DILocation(line: 282, column: 1, scope: !1119)
!1139 = distinct !DISubprogram(name: "flush_stdout", scope: !357, file: !357, line: 163, type: !409, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1140)
!1140 = !{!1141}
!1141 = !DILocalVariable(name: "stdout_fd", scope: !1139, file: !357, line: 166, type: !70)
!1142 = !DILocation(line: 0, scope: !1139)
!1143 = !DILocalVariable(name: "fd", arg: 1, scope: !1144, file: !357, line: 145, type: !70)
!1144 = distinct !DISubprogram(name: "is_open", scope: !357, file: !357, line: 145, type: !1057, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1145)
!1145 = !{!1143}
!1146 = !DILocation(line: 0, scope: !1144, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 182, column: 25, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1139, file: !357, line: 182, column: 7)
!1149 = !DILocation(line: 157, column: 15, scope: !1144, inlinedAt: !1147)
!1150 = !DILocation(line: 157, column: 12, scope: !1144, inlinedAt: !1147)
!1151 = !DILocation(line: 182, column: 7, scope: !1139)
!1152 = !DILocation(line: 184, column: 5, scope: !1148)
!1153 = !DILocation(line: 185, column: 1, scope: !1139)
!1154 = distinct !DISubprogram(name: "error_tail", scope: !357, file: !357, line: 219, type: !1120, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1155)
!1155 = !{!1156, !1157, !1158, !1159}
!1156 = !DILocalVariable(name: "status", arg: 1, scope: !1154, file: !357, line: 219, type: !70)
!1157 = !DILocalVariable(name: "errnum", arg: 2, scope: !1154, file: !357, line: 219, type: !70)
!1158 = !DILocalVariable(name: "message", arg: 3, scope: !1154, file: !357, line: 219, type: !96)
!1159 = !DILocalVariable(name: "args", arg: 4, scope: !1154, file: !357, line: 219, type: !367)
!1160 = !DILocation(line: 0, scope: !1154)
!1161 = !DILocation(line: 219, column: 1, scope: !1154)
!1162 = !DILocation(line: 229, column: 13, scope: !1154)
!1163 = !DILocation(line: 135, column: 10, scope: !1164, inlinedAt: !1206)
!1164 = distinct !DISubprogram(name: "vfprintf", scope: !820, file: !820, line: 132, type: !1165, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1202)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!70, !1167, !824, !369}
!1167 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !148, line: 7, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !150, line: 49, size: 1728, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1170, file: !150, line: 51, baseType: !70, size: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1170, file: !150, line: 54, baseType: !90, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1170, file: !150, line: 55, baseType: !90, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1170, file: !150, line: 56, baseType: !90, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1170, file: !150, line: 57, baseType: !90, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1170, file: !150, line: 58, baseType: !90, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1170, file: !150, line: 59, baseType: !90, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1170, file: !150, line: 60, baseType: !90, size: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1170, file: !150, line: 61, baseType: !90, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1170, file: !150, line: 64, baseType: !90, size: 64, offset: 576)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1170, file: !150, line: 65, baseType: !90, size: 64, offset: 640)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1170, file: !150, line: 66, baseType: !90, size: 64, offset: 704)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1170, file: !150, line: 68, baseType: !165, size: 64, offset: 768)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1170, file: !150, line: 70, baseType: !1186, size: 64, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1170, file: !150, line: 72, baseType: !70, size: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1170, file: !150, line: 73, baseType: !70, size: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1170, file: !150, line: 74, baseType: !172, size: 64, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1170, file: !150, line: 77, baseType: !92, size: 16, offset: 1024)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1170, file: !150, line: 78, baseType: !177, size: 8, offset: 1040)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1170, file: !150, line: 79, baseType: !39, size: 8, offset: 1048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1170, file: !150, line: 81, baseType: !180, size: 64, offset: 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1170, file: !150, line: 89, baseType: !183, size: 64, offset: 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1170, file: !150, line: 91, baseType: !185, size: 64, offset: 1216)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1170, file: !150, line: 92, baseType: !188, size: 64, offset: 1280)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1170, file: !150, line: 93, baseType: !1186, size: 64, offset: 1344)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1170, file: !150, line: 94, baseType: !91, size: 64, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1170, file: !150, line: 95, baseType: !93, size: 64, offset: 1472)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1170, file: !150, line: 96, baseType: !70, size: 32, offset: 1536)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1170, file: !150, line: 98, baseType: !195, size: 160, offset: 1568)
!1202 = !{!1203, !1204, !1205}
!1203 = !DILocalVariable(name: "__stream", arg: 1, scope: !1164, file: !820, line: 132, type: !1167)
!1204 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1164, file: !820, line: 133, type: !824)
!1205 = !DILocalVariable(name: "__ap", arg: 3, scope: !1164, file: !820, line: 133, type: !369)
!1206 = distinct !DILocation(line: 229, column: 3, scope: !1154)
!1207 = !{!1208, !1210}
!1208 = distinct !{!1208, !1209, !"vfprintf.inline: argument 0"}
!1209 = distinct !{!1209, !"vfprintf.inline"}
!1210 = distinct !{!1210, !1209, !"vfprintf.inline: argument 1"}
!1211 = !DILocation(line: 229, column: 3, scope: !1154)
!1212 = !DILocation(line: 0, scope: !1164, inlinedAt: !1206)
!1213 = !DILocation(line: 133, column: 49, scope: !1164, inlinedAt: !1206)
!1214 = !DILocation(line: 232, column: 3, scope: !1154)
!1215 = !DILocation(line: 233, column: 7, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1154, file: !357, line: 233, column: 7)
!1217 = !DILocation(line: 233, column: 7, scope: !1154)
!1218 = !DILocalVariable(name: "errnum", arg: 1, scope: !1219, file: !357, line: 188, type: !70)
!1219 = distinct !DISubprogram(name: "print_errno_message", scope: !357, file: !357, line: 188, type: !762, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !1220)
!1220 = !{!1218, !1221, !1222}
!1221 = !DILocalVariable(name: "s", scope: !1219, file: !357, line: 190, type: !96)
!1222 = !DILocalVariable(name: "errbuf", scope: !1219, file: !357, line: 193, type: !1223)
