; ModuleID = 'src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [9 x i8] c"unexpand\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [73 x i8] c"  -a, --all\0A         convert all blanks, instead of just initial blanks\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [85 x i8] c"      --first-only\0A         convert only leading sequences of blanks (overrides -a)\0A\00", align 1, !dbg !27

!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!110 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!111 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 46, baseType: !111)
!114 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!117 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!118 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !119, !124, !129, !134, !139, !144, !225, !230, !232, !237, !242, !247, !249, !251, !256, !258, !260, !262, !267, !272, !274, !276, !278, !280, !282, !284, !289, !294, !296, !301, !303, !305, !307, !309, !311, !316, !318, !320, !325, !330, !335, !340, !342, !344, !349, !351, !67, !353, !422, !427}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 314, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 14)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 314, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 16)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 28)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !76, line: 729, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 56)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !76, line: 736, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 75)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !146, file: !76, line: 575, type: !77, isLocal: true, isDefinition: true)
!146 = distinct !DISubprogram(name: "oputs_", scope: !76, file: !76, line: 573, type: !147, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !149)
!147 = !DISubroutineType(cc: DW_CC_nocall, types: !148)
!148 = !{null, !115, !115}
!149 = !{!150, !151, !152, !155, !156, !157, !158, !162, !163, !164, !165, !167, !219, !220, !221, !223, !224}
!150 = !DILocalVariable(name: "program", arg: 1, scope: !146, file: !76, line: 573, type: !115)
!151 = !DILocalVariable(name: "option", arg: 2, scope: !146, file: !76, line: 573, type: !115)
!152 = !DILocalVariable(name: "term", scope: !153, file: !76, line: 585, type: !115)
!153 = distinct !DILexicalBlock(scope: !154, file: !76, line: 582, column: 5)
!154 = distinct !DILexicalBlock(scope: !146, file: !76, line: 581, column: 7)
!155 = !DILocalVariable(name: "double_space", scope: !146, file: !76, line: 594, type: !109)
!156 = !DILocalVariable(name: "first_word", scope: !146, file: !76, line: 595, type: !115)
!157 = !DILocalVariable(name: "option_text", scope: !146, file: !76, line: 596, type: !115)
!158 = !DILocalVariable(name: "s", scope: !159, file: !76, line: 608, type: !115)
!159 = distinct !DILexicalBlock(scope: !160, file: !76, line: 605, column: 5)
!160 = distinct !DILexicalBlock(scope: !161, file: !76, line: 604, column: 12)
!161 = distinct !DILexicalBlock(scope: !146, file: !76, line: 597, column: 7)
!162 = !DILocalVariable(name: "spaces", scope: !159, file: !76, line: 609, type: !113)
!163 = !DILocalVariable(name: "anchor_len", scope: !146, file: !76, line: 620, type: !113)
!164 = !DILocalVariable(name: "desc_text", scope: !146, file: !76, line: 625, type: !115)
!165 = !DILocalVariable(name: "__ptr", scope: !166, file: !76, line: 644, type: !115)
!166 = distinct !DILexicalBlock(scope: !146, file: !76, line: 644, column: 3)
!167 = !DILocalVariable(name: "__stream", scope: !166, file: !76, line: 644, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 7, baseType: !171)
!170 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 49, size: 1728, elements: !173)
!172 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !189, !191, !192, !193, !196, !197, !199, !200, !203, !205, !208, !211, !212, !213, !214, !215}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !171, file: !172, line: 51, baseType: !77, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !171, file: !172, line: 54, baseType: !107, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !171, file: !172, line: 55, baseType: !107, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !171, file: !172, line: 56, baseType: !107, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !171, file: !172, line: 57, baseType: !107, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !171, file: !172, line: 58, baseType: !107, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !171, file: !172, line: 59, baseType: !107, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !171, file: !172, line: 60, baseType: !107, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !171, file: !172, line: 61, baseType: !107, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !171, file: !172, line: 64, baseType: !107, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !171, file: !172, line: 65, baseType: !107, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !171, file: !172, line: 66, baseType: !107, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !171, file: !172, line: 68, baseType: !187, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !172, line: 36, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !171, file: !172, line: 70, baseType: !190, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !171, file: !172, line: 72, baseType: !77, size: 32, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !171, file: !172, line: 73, baseType: !77, size: 32, offset: 928)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !171, file: !172, line: 74, baseType: !194, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !195, line: 152, baseType: !110)
!195 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !171, file: !172, line: 77, baseType: !112, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !171, file: !172, line: 78, baseType: !198, size: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !171, file: !172, line: 79, baseType: !49, size: 8, offset: 1048)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !171, file: !172, line: 81, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !172, line: 43, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !171, file: !172, line: 89, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !195, line: 153, baseType: !110)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !171, file: !172, line: 91, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !172, line: 37, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !171, file: !172, line: 92, baseType: !209, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !172, line: 38, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !171, file: !172, line: 93, baseType: !190, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !171, file: !172, line: 94, baseType: !108, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !171, file: !172, line: 95, baseType: !113, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !171, file: !172, line: 96, baseType: !77, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !171, file: !172, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DILocalVariable(name: "__cnt", scope: !166, file: !76, line: 644, type: !113)
!220 = !DILocalVariable(name: "url_program", scope: !146, file: !76, line: 648, type: !115)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !76, line: 686, type: !115)
!222 = distinct !DILexicalBlock(scope: !146, file: !76, line: 686, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !76, line: 686, type: !168)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !76, line: 686, type: !113)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !76, line: 585, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 5)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !76, line: 586, type: !227, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !76, line: 595, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 4)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !76, line: 620, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 6)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 2)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !227, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !234, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 3)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !76, line: 650, type: !227, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !239, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !239, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !76, line: 652, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 7)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !76, line: 653, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !76, line: 654, type: !54, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !76, line: 655, type: !54, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !76, line: 656, type: !54, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !76, line: 657, type: !54, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !76, line: 663, type: !264, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !76, line: 664, type: !54, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 17)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 40)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !64, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 61)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !76, line: 679, type: !253, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !76, line: 683, type: !227, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !76, line: 688, type: !227, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !76, line: 691, type: !269, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !76, line: 839, type: !126, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !76, line: 840, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 22)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !76, line: 841, type: !64, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !76, line: 862, type: !234, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !76, line: 868, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 71)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !76, line: 875, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 27)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 51)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 12)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !227, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !234, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 11)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !227, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !269, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "line_in", scope: !355, file: !2, line: 127, type: !419, isLocal: true, isDefinition: true)
!355 = distinct !DISubprogram(name: "unexpand", scope: !2, file: !2, line: 114, type: !356, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !358)
!356 = !DISubroutineType(types: !357)
!357 = !{null}
!358 = !{!359, !360, !361, !374, !386, !387, !393, !394, !395, !396, !397, !398, !402, !405, !408, !413, !414, !415, !417, !418}
!359 = !DILocalVariable(name: "fp", scope: !355, file: !2, line: 117, type: !168)
!360 = !DILocalVariable(name: "pending_blank", scope: !355, file: !2, line: 122, type: !107)
!361 = !DILocalVariable(name: "mbbuf", scope: !355, file: !2, line: 128, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !363, line: 50, baseType: !364)
!363 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 43, size: 320, elements: !365)
!365 = !{!366, !367, !368, !372, !373}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !364, file: !363, line: 45, baseType: !107, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !364, file: !363, line: 46, baseType: !168, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !364, file: !363, line: 47, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !370, line: 130, baseType: !371)
!370 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !114, line: 35, baseType: !110)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !364, file: !363, line: 48, baseType: !369, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !364, file: !363, line: 49, baseType: !369, size: 64, offset: 256)
!374 = !DILocalVariable(name: "g", scope: !375, file: !2, line: 139, type: !376)
!375 = distinct !DILexicalBlock(scope: !355, file: !2, line: 137, column: 5)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !97, line: 143, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 138, size: 64, elements: !378)
!378 = !{!379, !384, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !377, file: !97, line: 140, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !381, line: 37, baseType: !382)
!381 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !195, line: 57, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !195, line: 42, baseType: !72)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !377, file: !97, line: 141, baseType: !117, size: 8, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !377, file: !97, line: 142, baseType: !117, size: 8, offset: 40)
!386 = !DILocalVariable(name: "convert", scope: !375, file: !2, line: 142, type: !109)
!387 = !DILocalVariable(name: "column", scope: !375, file: !2, line: 149, type: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !389, line: 20, baseType: !390)
!389 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !391, line: 101, baseType: !392)
!391 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !195, line: 72, baseType: !110)
!393 = !DILocalVariable(name: "next_tab_column", scope: !375, file: !2, line: 152, type: !388)
!394 = !DILocalVariable(name: "tab_index", scope: !375, file: !2, line: 155, type: !369)
!395 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !375, file: !2, line: 158, type: !109)
!396 = !DILocalVariable(name: "prev_blank", scope: !375, file: !2, line: 163, type: !109)
!397 = !DILocalVariable(name: "pending", scope: !375, file: !2, line: 166, type: !369)
!398 = !DILocalVariable(name: "blank", scope: !399, file: !2, line: 179, type: !109)
!399 = distinct !DILexicalBlock(scope: !400, file: !2, line: 178, column: 13)
!400 = distinct !DILexicalBlock(scope: !401, file: !2, line: 177, column: 15)
!401 = distinct !DILexicalBlock(scope: !375, file: !2, line: 172, column: 9)
!402 = !DILocalVariable(name: "last_tab", scope: !403, file: !2, line: 183, type: !109)
!403 = distinct !DILexicalBlock(scope: !404, file: !2, line: 182, column: 17)
!404 = distinct !DILexicalBlock(scope: !399, file: !2, line: 181, column: 19)
!405 = !DILocalVariable(name: "width", scope: !406, file: !2, line: 239, type: !77)
!406 = distinct !DILexicalBlock(scope: !407, file: !2, line: 238, column: 17)
!407 = distinct !DILexicalBlock(scope: !404, file: !2, line: 229, column: 24)
!408 = !DILocalVariable(name: "__ptr", scope: !409, file: !2, line: 248, type: !115)
!409 = distinct !DILexicalBlock(scope: !410, file: !2, line: 248, column: 23)
!410 = distinct !DILexicalBlock(scope: !411, file: !2, line: 248, column: 23)
!411 = distinct !DILexicalBlock(scope: !412, file: !2, line: 245, column: 17)
!412 = distinct !DILexicalBlock(scope: !399, file: !2, line: 244, column: 19)
!413 = !DILocalVariable(name: "__stream", scope: !409, file: !2, line: 248, type: !168)
!414 = !DILocalVariable(name: "__cnt", scope: !409, file: !2, line: 248, type: !113)
!415 = !DILocalVariable(name: "__ptr", scope: !416, file: !2, line: 264, type: !115)
!416 = distinct !DILexicalBlock(scope: !401, file: !2, line: 264, column: 11)
!417 = !DILocalVariable(name: "__stream", scope: !416, file: !2, line: 264, type: !168)
!418 = !DILocalVariable(name: "__cnt", scope: !416, file: !2, line: 264, type: !113)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 262144)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 241, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 23)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !76, line: 952, type: !337, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1536, elements: !240)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !432, line: 50, size: 256, elements: !433)
!432 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!433 = !{!434, !435, !436, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !432, line: 52, baseType: !115, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !431, file: !432, line: 55, baseType: !77, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !432, line: 56, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !431, file: !432, line: 57, baseType: !77, size: 32, offset: 192)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !441, file: !442, line: 30, type: !109, isLocal: false, isDefinition: true)
!441 = distinct !DICompileUnit(language: DW_LANG_C11, file: !442, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !443, retainedTypes: !467, globals: !468, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!443 = !{!81, !444, !458}
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !445, line: 42, baseType: !72, size: 32, elements: !446)
!445 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!447 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!448 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!449 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!450 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!451 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!452 = !DIEnumerator(name: "c_quoting_style", value: 5)
!453 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!454 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!455 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!456 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!457 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 44, baseType: !72, size: 32, elements: !460)
!459 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!460 = !{!461, !462, !463, !464, !465, !466}
!461 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!462 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!463 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!464 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!465 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!466 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!467 = !{!77, !112, !109, !110, !111, !108, !113, !115, !117}
!468 = !{!439, !469, !471, !476, !478, !480, !485, !490, !492, !537, !539, !541, !543, !545, !550, !552, !554, !557, !559, !561, !566, !568, !573, !575, !580, !582, !584, !586, !588, !591, !594, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "exit_status", scope: !441, file: !442, line: 69, type: !77, isLocal: false, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !442, line: 177, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 41)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !442, line: 188, type: !473, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !442, line: 207, type: !346, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !442, line: 209, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 25)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !442, line: 217, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 43)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !442, line: 326, type: !424, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "prev_file", scope: !494, file: !442, line: 351, type: !107, isLocal: true, isDefinition: true)
!494 = distinct !DISubprogram(name: "next_file", scope: !442, file: !442, line: 349, type: !495, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !441, retainedNodes: !531)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 7, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 49, size: 1728, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !499, file: !172, line: 51, baseType: !77, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !499, file: !172, line: 54, baseType: !107, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !499, file: !172, line: 55, baseType: !107, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !499, file: !172, line: 56, baseType: !107, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !499, file: !172, line: 57, baseType: !107, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !499, file: !172, line: 58, baseType: !107, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !499, file: !172, line: 59, baseType: !107, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !499, file: !172, line: 60, baseType: !107, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !499, file: !172, line: 61, baseType: !107, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !499, file: !172, line: 64, baseType: !107, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !499, file: !172, line: 65, baseType: !107, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !499, file: !172, line: 66, baseType: !107, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !499, file: !172, line: 68, baseType: !187, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !499, file: !172, line: 70, baseType: !515, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !499, file: !172, line: 72, baseType: !77, size: 32, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !499, file: !172, line: 73, baseType: !77, size: 32, offset: 928)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !499, file: !172, line: 74, baseType: !194, size: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !499, file: !172, line: 77, baseType: !112, size: 16, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !499, file: !172, line: 78, baseType: !198, size: 8, offset: 1040)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !499, file: !172, line: 79, baseType: !49, size: 8, offset: 1048)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !499, file: !172, line: 81, baseType: !201, size: 64, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !499, file: !172, line: 89, baseType: !204, size: 64, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !499, file: !172, line: 91, baseType: !206, size: 64, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !499, file: !172, line: 92, baseType: !209, size: 64, offset: 1280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !499, file: !172, line: 93, baseType: !515, size: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !499, file: !172, line: 94, baseType: !108, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !499, file: !172, line: 95, baseType: !113, size: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !499, file: !172, line: 96, baseType: !77, size: 32, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !499, file: !172, line: 98, baseType: !216, size: 160, offset: 1568)
!531 = !{!532, !533, !534}
!532 = !DILocalVariable(name: "fp", arg: 1, scope: !494, file: !442, line: 349, type: !497)
!533 = !DILocalVariable(name: "file", scope: !494, file: !442, line: 352, type: !107)
!534 = !DILocalVariable(name: "err", scope: !535, file: !442, line: 356, type: !77)
!535 = distinct !DILexicalBlock(scope: !536, file: !442, line: 355, column: 5)
!536 = distinct !DILexicalBlock(scope: !494, file: !442, line: 354, column: 7)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !442, line: 359, type: !244, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !442, line: 365, type: !253, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !442, line: 378, type: !244, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !442, line: 405, type: !322, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !442, line: 409, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2440, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 305)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "max_column_width", scope: !441, file: !442, line: 42, type: !369, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !441, file: !442, line: 54, type: !369, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "tab_list", scope: !441, file: !442, line: 47, type: !556, isLocal: true, isDefinition: true)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !441, file: !442, line: 50, type: !369, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !442, line: 78, type: !424, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !442, line: 103, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 47)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !442, line: 122, type: !563, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !442, line: 249, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 21)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !442, line: 251, type: !131, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !442, line: 256, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 45)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "extend_size", scope: !441, file: !442, line: 36, type: !388, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "increment_size", scope: !441, file: !442, line: 39, type: !388, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "tab_size", scope: !441, file: !442, line: 33, type: !388, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !441, file: !442, line: 66, type: !109, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !441, file: !442, line: 60, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !245)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "file_list", scope: !441, file: !442, line: 57, type: !593, isLocal: true, isDefinition: true)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !596, file: !76, line: 575, type: !77, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "oputs_", scope: !76, file: !76, line: 573, type: !597, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !441, retainedNodes: !598)
!597 = !DISubroutineType(types: !148)
!598 = !{!599, !600, !601, !604, !605, !606, !607, !611, !612, !613, !614, !616, !617, !618, !619, !621, !622}
!599 = !DILocalVariable(name: "program", arg: 1, scope: !596, file: !76, line: 573, type: !115)
!600 = !DILocalVariable(name: "option", arg: 2, scope: !596, file: !76, line: 573, type: !115)
!601 = !DILocalVariable(name: "term", scope: !602, file: !76, line: 585, type: !115)
!602 = distinct !DILexicalBlock(scope: !603, file: !76, line: 582, column: 5)
!603 = distinct !DILexicalBlock(scope: !596, file: !76, line: 581, column: 7)
!604 = !DILocalVariable(name: "double_space", scope: !596, file: !76, line: 594, type: !109)
!605 = !DILocalVariable(name: "first_word", scope: !596, file: !76, line: 595, type: !115)
!606 = !DILocalVariable(name: "option_text", scope: !596, file: !76, line: 596, type: !115)
!607 = !DILocalVariable(name: "s", scope: !608, file: !76, line: 608, type: !115)
!608 = distinct !DILexicalBlock(scope: !609, file: !76, line: 605, column: 5)
!609 = distinct !DILexicalBlock(scope: !610, file: !76, line: 604, column: 12)
!610 = distinct !DILexicalBlock(scope: !596, file: !76, line: 597, column: 7)
!611 = !DILocalVariable(name: "spaces", scope: !608, file: !76, line: 609, type: !113)
!612 = !DILocalVariable(name: "anchor_len", scope: !596, file: !76, line: 620, type: !113)
!613 = !DILocalVariable(name: "desc_text", scope: !596, file: !76, line: 625, type: !115)
!614 = !DILocalVariable(name: "__ptr", scope: !615, file: !76, line: 644, type: !115)
!615 = distinct !DILexicalBlock(scope: !596, file: !76, line: 644, column: 3)
!616 = !DILocalVariable(name: "__stream", scope: !615, file: !76, line: 644, type: !497)
!617 = !DILocalVariable(name: "__cnt", scope: !615, file: !76, line: 644, type: !113)
!618 = !DILocalVariable(name: "url_program", scope: !596, file: !76, line: 648, type: !115)
!619 = !DILocalVariable(name: "__ptr", scope: !620, file: !76, line: 686, type: !115)
!620 = distinct !DILexicalBlock(scope: !596, file: !76, line: 686, column: 3)
!621 = !DILocalVariable(name: "__stream", scope: !620, file: !76, line: 686, type: !497)
!622 = !DILocalVariable(name: "__cnt", scope: !620, file: !76, line: 686, type: !113)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !76, line: 585, type: !227, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !76, line: 586, type: !227, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !76, line: 595, type: !234, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !76, line: 620, type: !239, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !244, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !227, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !234, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !253, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !76, line: 650, type: !227, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !239, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !239, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !76, line: 652, type: !264, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !76, line: 653, type: !269, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !76, line: 654, type: !54, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !76, line: 655, type: !54, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !76, line: 656, type: !54, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !76, line: 657, type: !54, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !76, line: 663, type: !264, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !76, line: 664, type: !54, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !286, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !291, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !64, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !298, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !76, line: 679, type: !253, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !76, line: 683, type: !227, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !76, line: 688, type: !227, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !76, line: 691, type: !269, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 3, type: !64, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "Version", scope: !683, file: !680, line: 3, type: !115, isLocal: false, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!684 = !{!678, !681}
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "file_name", scope: !687, file: !688, line: 45, type: !115, isLocal: true, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !689, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!689 = !{!690, !692, !694, !696, !685, !698}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !688, line: 121, type: !264, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !688, line: 121, type: !337, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !688, line: 123, type: !264, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !688, line: 126, type: !253, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !687, file: !688, line: 55, type: !109, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !702, file: !703, line: 66, type: !751, isLocal: false, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !704, globals: !705, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!704 = !{!108, !117}
!705 = !{!706, !708, !733, !735, !737, !739, !700, !741, !743, !745, !747, !749}
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !703, line: 272, type: !227, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "old_file_name", scope: !710, file: !703, line: 304, type: !115, isLocal: true, isDefinition: true)
!710 = distinct !DISubprogram(name: "verror_at_line", scope: !703, file: !703, line: 298, type: !711, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !702, retainedNodes: !726)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !77, !77, !115, !72, !115, !713}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !714, line: 52, baseType: !715)
!714 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !716, line: 14, baseType: !717)
!716 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !718, baseType: !719)
!718 = !DIFile(filename: "lib/error.c", directory: "/src")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !720)
!720 = !{!721, !722, !723, !724, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !719, file: !718, baseType: !108, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !719, file: !718, baseType: !108, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !719, file: !718, baseType: !108, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !719, file: !718, baseType: !77, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !719, file: !718, baseType: !77, size: 32, offset: 224)
!726 = !{!727, !728, !729, !730, !731, !732}
!727 = !DILocalVariable(name: "status", arg: 1, scope: !710, file: !703, line: 298, type: !77)
!728 = !DILocalVariable(name: "errnum", arg: 2, scope: !710, file: !703, line: 298, type: !77)
!729 = !DILocalVariable(name: "file_name", arg: 3, scope: !710, file: !703, line: 298, type: !115)
!730 = !DILocalVariable(name: "line_number", arg: 4, scope: !710, file: !703, line: 298, type: !72)
!731 = !DILocalVariable(name: "message", arg: 5, scope: !710, file: !703, line: 298, type: !115)
!732 = !DILocalVariable(name: "args", arg: 6, scope: !710, file: !703, line: 298, type: !713)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "old_line_number", scope: !710, file: !703, line: 305, type: !72, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !703, line: 338, type: !234, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !703, line: 346, type: !269, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !703, line: 346, type: !244, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "error_message_count", scope: !702, file: !703, line: 69, type: !72, isLocal: false, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !702, file: !703, line: 295, type: !77, isLocal: false, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !703, line: 208, type: !264, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !703, line: 208, type: !570, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !703, line: 214, type: !227, isLocal: true, isDefinition: true)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "program_name", scope: !754, file: !755, line: 31, type: !115, isLocal: false, isDefinition: true)
!754 = distinct !DICompileUnit(language: DW_LANG_C11, file: !755, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !756, globals: !757, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!756 = !{!107}
!757 = !{!752, !758, !760}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !755, line: 46, type: !269, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !755, line: 49, type: !234, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "utf07FF", scope: !764, file: !765, line: 46, type: !788, isLocal: true, isDefinition: true)
!764 = distinct !DISubprogram(name: "proper_name_lite", scope: !765, file: !765, line: 38, type: !766, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !768, retainedNodes: !770)
!765 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!766 = !DISubroutineType(types: !767)
!767 = !{!115, !115, !115}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !769, splitDebugInlining: false, nameTableKind: None)
!769 = !{!762}
!770 = !{!771, !772, !773, !774, !775}
!771 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !764, file: !765, line: 38, type: !115)
!772 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !764, file: !765, line: 38, type: !115)
!773 = !DILocalVariable(name: "translation", scope: !764, file: !765, line: 40, type: !115)
!774 = !DILocalVariable(name: "w", scope: !764, file: !765, line: 47, type: !380)
!775 = !DILocalVariable(name: "mbs", scope: !764, file: !765, line: 48, type: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !777, line: 6, baseType: !778)
!777 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !779, line: 21, baseType: !780)
!779 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 13, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !780, file: !779, line: 15, baseType: !77, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !780, file: !779, line: 20, baseType: !784, size: 32, offset: 32)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !780, file: !779, line: 16, size: 32, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !784, file: !779, line: 18, baseType: !72, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !784, file: !779, line: 19, baseType: !234, size: 32)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 16, elements: !245)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !791, line: 78, type: !269, isLocal: true, isDefinition: true)
!791 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !791, line: 79, type: !239, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !791, line: 80, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 13)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !791, line: 81, type: !796, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !791, line: 82, type: !216, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !791, line: 83, type: !244, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !791, line: 84, type: !269, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !791, line: 85, type: !264, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !791, line: 86, type: !264, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !791, line: 87, type: !269, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !815, file: !791, line: 76, type: !887, isLocal: false, isDefinition: true)
!815 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !816, retainedTypes: !822, globals: !823, splitDebugInlining: false, nameTableKind: None)
!816 = !{!444, !817, !81}
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !445, line: 254, baseType: !72, size: 32, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!820 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!821 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!822 = !{!77, !112, !113}
!823 = !{!789, !792, !794, !799, !801, !803, !805, !807, !809, !811, !813, !824, !828, !838, !840, !845, !847, !849, !851, !853, !876, !883, !885}
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !815, file: !791, line: 92, type: !826, isLocal: false, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 320, elements: !55)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !815, file: !791, line: 1040, type: !830, isLocal: false, isDefinition: true)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !791, line: 56, size: 448, elements: !831)
!831 = !{!832, !833, !834, !836, !837}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !830, file: !791, line: 59, baseType: !444, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !830, file: !791, line: 62, baseType: !77, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !830, file: !791, line: 66, baseType: !835, size: 256, offset: 64)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !270)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !830, file: !791, line: 69, baseType: !115, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !830, file: !791, line: 72, baseType: !115, size: 64, offset: 384)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !815, file: !791, line: 107, type: !830, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "slot0", scope: !815, file: !791, line: 831, type: !842, isLocal: true, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 256)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !791, line: 321, type: !244, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !791, line: 357, type: !244, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !791, line: 358, type: !244, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !791, line: 199, type: !264, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "quote", scope: !855, file: !791, line: 228, type: !874, isLocal: true, isDefinition: true)
!855 = distinct !DISubprogram(name: "gettext_quote", scope: !791, file: !791, line: 197, type: !856, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !815, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!115, !115, !444}
!858 = !{!859, !860, !861, !862, !863}
!859 = !DILocalVariable(name: "msgid", arg: 1, scope: !855, file: !791, line: 197, type: !115)
!860 = !DILocalVariable(name: "s", arg: 2, scope: !855, file: !791, line: 197, type: !444)
!861 = !DILocalVariable(name: "translation", scope: !855, file: !791, line: 199, type: !115)
!862 = !DILocalVariable(name: "w", scope: !855, file: !791, line: 229, type: !380)
!863 = !DILocalVariable(name: "mbs", scope: !855, file: !791, line: 230, type: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !777, line: 6, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !779, line: 21, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 13, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !866, file: !779, line: 15, baseType: !77, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !866, file: !779, line: 20, baseType: !870, size: 32, offset: 32)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !866, file: !779, line: 16, size: 32, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !870, file: !779, line: 18, baseType: !72, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !870, file: !779, line: 19, baseType: !234, size: 32)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !875)
!875 = !{!246, !236}
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "slotvec", scope: !815, file: !791, line: 834, type: !878, isLocal: true, isDefinition: true)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !791, line: 823, size: 128, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !879, file: !791, line: 825, baseType: !113, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !879, file: !791, line: 826, baseType: !107, size: 64, offset: 64)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "nslots", scope: !815, file: !791, line: 832, type: !77, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "slotvec0", scope: !815, file: !791, line: 833, type: !879, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 704, elements: !347)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !891, line: 67, type: !337, isLocal: true, isDefinition: true)
!891 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !891, line: 69, type: !264, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !891, line: 83, type: !264, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !891, line: 83, type: !234, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !891, line: 85, type: !244, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !891, line: 88, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 171)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !891, line: 88, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 34)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !891, line: 105, type: !126, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !891, line: 109, type: !424, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !891, line: 113, type: !131, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !891, line: 120, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 32)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !891, line: 127, type: !923, isLocal: true, isDefinition: true)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 36)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !891, line: 134, type: !291, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !891, line: 142, type: !930, isLocal: true, isDefinition: true)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 44)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !891, line: 150, type: !935, isLocal: true, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 48)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !891, line: 159, type: !940, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 52)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !891, line: 170, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 60)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !891, line: 248, type: !216, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !891, line: 248, type: !313, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !891, line: 254, type: !216, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !891, line: 254, type: !121, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !891, line: 254, type: !291, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !891, line: 259, type: !3, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !891, line: 259, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 29)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !967, file: !968, line: 26, type: !970, isLocal: false, isDefinition: true)
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !968, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !969, splitDebugInlining: false, nameTableKind: None)
!968 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!969 = !{!965}
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 376, elements: !564)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "exit_failure", scope: !973, file: !974, line: 24, type: !976, isLocal: false, isDefinition: true)
!973 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!975 = !{!971}
!976 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !979, line: 34, type: !253, isLocal: true, isDefinition: true)
!979 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !979, line: 34, type: !264, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !979, line: 34, type: !286, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !986, line: 108, type: !49, isLocal: true, isDefinition: true)
!986 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "internal_state", scope: !989, file: !986, line: 97, type: !992, isLocal: true, isDefinition: true)
!989 = distinct !DICompileUnit(language: DW_LANG_C11, file: !986, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, globals: !991, splitDebugInlining: false, nameTableKind: None)
!990 = !{!108, !113, !117}
!991 = !{!984, !987}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !777, line: 6, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !779, line: 21, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 13, size: 64, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !994, file: !779, line: 15, baseType: !77, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !994, file: !779, line: 20, baseType: !998, size: 32, offset: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !994, file: !779, line: 16, size: 32, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !998, file: !779, line: 18, baseType: !72, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !998, file: !779, line: 19, baseType: !234, size: 32)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !1004, line: 35, type: !244, isLocal: true, isDefinition: true)
!1004 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !1004, line: 35, type: !239, isLocal: true, isDefinition: true)
!1007 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1008, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1009 = !{!458}
!1010 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1011, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1012 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1013, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1014, splitDebugInlining: false, nameTableKind: None)
!1013 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1014 = !{!108}
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1016, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1017 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1018, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1014, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1019 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1020, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1020 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1021 = distinct !DICompileUnit(language: DW_LANG_C11, file: !891, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1022, retainedTypes: !1014, globals: !1026, splitDebugInlining: false, nameTableKind: None)
!1022 = !{!1023}
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !891, line: 40, baseType: !72, size: 32, elements: !1024)
!1024 = !{!1025}
!1025 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1026 = !{!889, !892, !894, !896, !898, !900, !905, !910, !912, !914, !916, !921, !926, !928, !933, !938, !943, !948, !950, !952, !954, !956, !958, !960}
!1027 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1028, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1029, retainedTypes: !1057, splitDebugInlining: false, nameTableKind: None)
!1028 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1029 = !{!1030, !1042}
!1030 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1031, file: !1028, line: 188, baseType: !72, size: 32, elements: !1040)
!1031 = distinct !DISubprogram(name: "x2nrealloc", scope: !1028, file: !1028, line: 176, type: !1032, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1027, retainedNodes: !1035)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!108, !108, !1034, !113}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!1035 = !{!1036, !1037, !1038, !1039}
!1036 = !DILocalVariable(name: "p", arg: 1, scope: !1031, file: !1028, line: 176, type: !108)
!1037 = !DILocalVariable(name: "pn", arg: 2, scope: !1031, file: !1028, line: 176, type: !1034)
!1038 = !DILocalVariable(name: "s", arg: 3, scope: !1031, file: !1028, line: 176, type: !113)
!1039 = !DILocalVariable(name: "n", scope: !1031, file: !1028, line: 178, type: !113)
!1040 = !{!1041}
!1041 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1042 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1043, file: !1028, line: 228, baseType: !72, size: 32, elements: !1040)
!1043 = distinct !DISubprogram(name: "xpalloc", scope: !1028, file: !1028, line: 223, type: !1044, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1027, retainedNodes: !1047)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!108, !108, !1046, !369, !371, !369}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1048 = !DILocalVariable(name: "pa", arg: 1, scope: !1043, file: !1028, line: 223, type: !108)
!1049 = !DILocalVariable(name: "pn", arg: 2, scope: !1043, file: !1028, line: 223, type: !1046)
!1050 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1043, file: !1028, line: 223, type: !369)
!1051 = !DILocalVariable(name: "n_max", arg: 4, scope: !1043, file: !1028, line: 223, type: !371)
!1052 = !DILocalVariable(name: "s", arg: 5, scope: !1043, file: !1028, line: 223, type: !369)
!1053 = !DILocalVariable(name: "n0", scope: !1043, file: !1028, line: 230, type: !369)
!1054 = !DILocalVariable(name: "n", scope: !1043, file: !1028, line: 237, type: !369)
!1055 = !DILocalVariable(name: "nbytes", scope: !1043, file: !1028, line: 248, type: !369)
!1056 = !DILocalVariable(name: "adjusted_nbytes", scope: !1043, file: !1028, line: 252, type: !369)
!1057 = !{!107, !108, !109, !110, !111}
!1058 = distinct !DICompileUnit(language: DW_LANG_C11, file: !979, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1059, splitDebugInlining: false, nameTableKind: None)
!1059 = !{!977, !980, !982}
!1060 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1061, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1014, splitDebugInlining: false, nameTableKind: None)
!1061 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1062 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1063, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1063 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1064 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1065, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1066, splitDebugInlining: false, nameTableKind: None)
!1065 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1066 = !{!109, !111, !108}
!1067 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1004, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1068, splitDebugInlining: false, nameTableKind: None)
!1068 = !{!1002, !1005}
!1069 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1070, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1070 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1071 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1072, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1014, splitDebugInlining: false, nameTableKind: None)
!1072 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1073 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1074 = !{i32 7, !"Dwarf Version", i32 5}
!1075 = !{i32 2, !"Debug Info Version", i32 3}
!1076 = !{i32 1, !"wchar_size", i32 4}
!1077 = !{i32 8, !"PIC Level", i32 2}
!1078 = !{i32 7, !"PIE Level", i32 2}
!1079 = !{i32 7, !"uwtable", i32 2}
!1080 = !{i32 7, !"frame-pointer", i32 1}
!1081 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 73, type: !1082, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1084)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !77}
!1084 = !{!1085}
!1085 = !DILocalVariable(name: "status", arg: 1, scope: !1081, file: !2, line: 73, type: !77)
!1086 = !DILocation(line: 0, scope: !1081)
!1087 = !DILocation(line: 75, column: 14, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1081, file: !2, line: 75, column: 7)
!1089 = !DILocation(line: 75, column: 7, scope: !1081)
!1090 = !DILocation(line: 76, column: 5, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !2, line: 76, column: 5)
!1092 = !{!1093, !1093, i64 0}
!1093 = !{!"any pointer", !1094, i64 0}
!1094 = !{!"omnipotent char", !1095, i64 0}
!1095 = !{!"Simple C/C++ TBAA"}
!1096 = !DILocation(line: 79, column: 7, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1088, file: !2, line: 78, column: 5)
!1098 = !DILocation(line: 83, column: 7, scope: !1097)
!1099 = !DILocation(line: 729, column: 3, scope: !1100, inlinedAt: !1102)
!1100 = distinct !DISubprogram(name: "emit_stdin_note", scope: !76, file: !76, line: 727, type: !356, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1101)
!1101 = !{}
!1102 = distinct !DILocation(line: 87, column: 7, scope: !1097)
!1103 = !DILocation(line: 736, column: 3, scope: !1104, inlinedAt: !1105)
!1104 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !76, file: !76, line: 734, type: !356, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1101)
!1105 = distinct !DILocation(line: 88, column: 7, scope: !1097)
!1106 = !DILocation(line: 90, column: 7, scope: !1097)
!1107 = !DILocation(line: 94, column: 7, scope: !1097)
!1108 = !DILocation(line: 98, column: 7, scope: !1097)
!1109 = !DILocation(line: 102, column: 7, scope: !1097)
!1110 = !DILocation(line: 103, column: 7, scope: !1097)
!1111 = !DILocation(line: 104, column: 7, scope: !1097)
!1112 = !DILocalVariable(name: "program", arg: 1, scope: !1113, file: !76, line: 836, type: !115)
!1113 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !76, file: !76, line: 836, type: !1114, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{null, !115}
!1116 = !{!1112, !1117, !1124, !1125, !1127, !1128}
!1117 = !DILocalVariable(name: "infomap", scope: !1113, file: !76, line: 838, type: !1118)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 896, elements: !265)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1113, file: !76, line: 838, size: 128, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1120, file: !76, line: 838, baseType: !115, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1120, file: !76, line: 838, baseType: !115, size: 64, offset: 64)
!1124 = !DILocalVariable(name: "node", scope: !1113, file: !76, line: 848, type: !115)
!1125 = !DILocalVariable(name: "map_prog", scope: !1113, file: !76, line: 849, type: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1127 = !DILocalVariable(name: "lc_messages", scope: !1113, file: !76, line: 861, type: !115)
!1128 = !DILocalVariable(name: "url_program", scope: !1113, file: !76, line: 874, type: !115)
!1129 = !DILocation(line: 0, scope: !1113, inlinedAt: !1130)
!1130 = distinct !DILocation(line: 105, column: 7, scope: !1097)
!1131 = !DILocation(line: 857, column: 3, scope: !1113, inlinedAt: !1130)
!1132 = !DILocation(line: 861, column: 29, scope: !1113, inlinedAt: !1130)
!1133 = !DILocation(line: 862, column: 7, scope: !1134, inlinedAt: !1130)
!1134 = distinct !DILexicalBlock(scope: !1113, file: !76, line: 862, column: 7)
!1135 = !DILocation(line: 862, column: 19, scope: !1134, inlinedAt: !1130)
!1136 = !DILocation(line: 862, column: 22, scope: !1134, inlinedAt: !1130)
!1137 = !DILocation(line: 862, column: 7, scope: !1113, inlinedAt: !1130)
!1138 = !DILocation(line: 868, column: 7, scope: !1139, inlinedAt: !1130)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !76, line: 863, column: 5)
!1140 = !DILocation(line: 870, column: 5, scope: !1139, inlinedAt: !1130)
!1141 = !DILocation(line: 875, column: 3, scope: !1113, inlinedAt: !1130)
!1142 = !DILocation(line: 877, column: 3, scope: !1113, inlinedAt: !1130)
!1143 = !DILocation(line: 107, column: 3, scope: !1081)
!1144 = !DISubprogram(name: "dcgettext", scope: !1145, file: !1145, line: 51, type: !1146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1101)
!1145 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!107, !115, !115, !77}
!1148 = !DISubprogram(name: "__fprintf_chk", scope: !1149, file: !1149, line: 93, type: !1150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1101)
!1149 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!77, !1152, !77, !1153, null}
