; ModuleID = 'src/unlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s FILE\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [57 x i8] c"Call the unlink function to remove the specified FILE.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"unlink\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 15)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 61)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !143, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !117, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !117, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !156, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !56, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 22)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !180, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !124, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 71)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 27)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 51)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 12)
!227 = !{!228, !229, !230, !233, !235, !236, !237, !241, !242, !243, !244, !246, !300, !301, !302, !304, !305}
!228 = !DILocalVariable(name: "program", arg: 1, scope: !68, file: !69, line: 573, type: !72)
!229 = !DILocalVariable(name: "option", arg: 2, scope: !68, file: !69, line: 573, type: !72)
!230 = !DILocalVariable(name: "term", scope: !231, file: !69, line: 585, type: !72)
!231 = distinct !DILexicalBlock(scope: !232, file: !69, line: 582, column: 5)
!232 = distinct !DILexicalBlock(scope: !68, file: !69, line: 581, column: 7)
!233 = !DILocalVariable(name: "double_space", scope: !68, file: !69, line: 594, type: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DILocalVariable(name: "first_word", scope: !68, file: !69, line: 595, type: !72)
!236 = !DILocalVariable(name: "option_text", scope: !68, file: !69, line: 596, type: !72)
!237 = !DILocalVariable(name: "s", scope: !238, file: !69, line: 608, type: !72)
!238 = distinct !DILexicalBlock(scope: !239, file: !69, line: 605, column: 5)
!239 = distinct !DILexicalBlock(scope: !240, file: !69, line: 604, column: 12)
!240 = distinct !DILexicalBlock(scope: !68, file: !69, line: 597, column: 7)
!241 = !DILocalVariable(name: "spaces", scope: !238, file: !69, line: 609, type: !110)
!242 = !DILocalVariable(name: "anchor_len", scope: !68, file: !69, line: 620, type: !110)
!243 = !DILocalVariable(name: "desc_text", scope: !68, file: !69, line: 625, type: !72)
!244 = !DILocalVariable(name: "__ptr", scope: !245, file: !69, line: 644, type: !72)
!245 = distinct !DILexicalBlock(scope: !68, file: !69, line: 644, column: 3)
!246 = !DILocalVariable(name: "__stream", scope: !245, file: !69, line: 644, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !250)
!249 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!252 = !{!253, !254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !269, !271, !272, !273, !277, !278, !280, !281, !284, !286, !289, !292, !293, !294, !295, !296}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !250, file: !251, line: 51, baseType: !108, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !250, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !250, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !250, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !250, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !250, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !250, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !250, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !250, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !250, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !250, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !250, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !250, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !251, line: 36, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !250, file: !251, line: 70, baseType: !270, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !250, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !250, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !250, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !275, line: 152, baseType: !276)
!275 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !250, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !250, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!279 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !250, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !250, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !251, line: 43, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !250, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !275, line: 153, baseType: !276)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !250, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !251, line: 37, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !250, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !251, line: 38, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !250, file: !251, line: 93, baseType: !270, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !250, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !250, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !250, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !250, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DILocalVariable(name: "__cnt", scope: !245, file: !69, line: 644, type: !110)
!301 = !DILocalVariable(name: "url_program", scope: !68, file: !69, line: 648, type: !72)
!302 = !DILocalVariable(name: "__ptr", scope: !303, file: !69, line: 686, type: !72)
!303 = distinct !DILexicalBlock(scope: !68, file: !69, line: 686, column: 3)
!304 = !DILocalVariable(name: "__stream", scope: !303, file: !69, line: 686, type: !247)
!305 = !DILocalVariable(name: "__cnt", scope: !303, file: !69, line: 686, type: !110)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !308, line: 3, type: !180, isLocal: true, isDefinition: true)
!308 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !308, line: 3, type: !72, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !308, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !312, splitDebugInlining: false, nameTableKind: None)
!312 = !{!306, !309}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "file_name", scope: !315, file: !316, line: 45, type: !72, isLocal: true, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C11, file: !316, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!317 = !{!318, !320, !322, !324, !313, !326}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !19, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !316, line: 121, type: !224, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !316, line: 123, type: !19, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !316, line: 126, type: !143, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !315, file: !316, line: 55, type: !234, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !330, file: !331, line: 66, type: !382, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !331, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !332, globals: !333, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!332 = !{!107, !113}
!333 = !{!334, !336, !361, !363, !365, !367, !328, !369, !371, !373, !375, !380}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !331, line: 272, type: !117, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "old_file_name", scope: !338, file: !331, line: 304, type: !72, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "verror_at_line", scope: !331, file: !331, line: 298, type: !339, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !354)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !108, !108, !72, !78, !72, !341}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !342, line: 52, baseType: !343)
!342 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !344, line: 14, baseType: !345)
!344 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !346, baseType: !347)
!346 = !DIFile(filename: "lib/error.c", directory: "/src")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !348)
!348 = !{!349, !350, !351, !352, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !347, file: !346, baseType: !107, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !347, file: !346, baseType: !107, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !347, file: !346, baseType: !107, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !347, file: !346, baseType: !108, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !347, file: !346, baseType: !108, size: 32, offset: 224)
!354 = !{!355, !356, !357, !358, !359, !360}
!355 = !DILocalVariable(name: "status", arg: 1, scope: !338, file: !331, line: 298, type: !108)
!356 = !DILocalVariable(name: "errnum", arg: 2, scope: !338, file: !331, line: 298, type: !108)
!357 = !DILocalVariable(name: "file_name", arg: 3, scope: !338, file: !331, line: 298, type: !72)
!358 = !DILocalVariable(name: "line_number", arg: 4, scope: !338, file: !331, line: 298, type: !78)
!359 = !DILocalVariable(name: "message", arg: 5, scope: !338, file: !331, line: 298, type: !72)
!360 = !DILocalVariable(name: "args", arg: 6, scope: !338, file: !331, line: 298, type: !341)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "old_line_number", scope: !338, file: !331, line: 305, type: !78, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !331, line: 338, type: !124, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !156, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !331, line: 346, type: !134, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "error_message_count", scope: !330, file: !331, line: 69, type: !78, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !330, file: !331, line: 295, type: !108, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !19, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !331, line: 208, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 21)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !331, line: 214, type: !117, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !387, line: 60, type: !134, isLocal: true, isDefinition: true)
!387 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "long_options", scope: !390, file: !387, line: 34, type: !398, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C11, file: !387, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!391 = !{!385, !392, !394, !396, !388}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !387, line: 112, type: !34, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !387, line: 36, type: !117, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !387, line: 37, type: !156, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 768, elements: !144)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !401, line: 50, size: 256, elements: !402)
!401 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!402 = !{!403, !404, !405, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !401, line: 52, baseType: !72, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !400, file: !401, line: 55, baseType: !108, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !401, line: 56, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !400, file: !401, line: 57, baseType: !108, size: 32, offset: 192)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "program_name", scope: !410, file: !411, line: 31, type: !72, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!412 = !{!255}
!413 = !{!408, !414, !416}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !411, line: 46, type: !156, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !411, line: 49, type: !124, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "utf07FF", scope: !420, file: !421, line: 46, type: !448, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "proper_name_lite", scope: !421, file: !421, line: 38, type: !422, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !426)
!421 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!422 = !DISubroutineType(types: !423)
!423 = !{!72, !72, !72}
!424 = distinct !DICompileUnit(language: DW_LANG_C11, file: !421, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !425, splitDebugInlining: false, nameTableKind: None)
!425 = !{!418}
!426 = !{!427, !428, !429, !430, !435}
!427 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !420, file: !421, line: 38, type: !72)
!428 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !420, file: !421, line: 38, type: !72)
!429 = !DILocalVariable(name: "translation", scope: !420, file: !421, line: 40, type: !72)
!430 = !DILocalVariable(name: "w", scope: !420, file: !421, line: 47, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !432, line: 37, baseType: !433)
!432 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !275, line: 57, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !275, line: 42, baseType: !78)
!435 = !DILocalVariable(name: "mbs", scope: !420, file: !421, line: 48, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !438)
!437 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !440)
!439 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !440, file: !439, line: 15, baseType: !108, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !440, file: !439, line: 20, baseType: !444, size: 32, offset: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !439, line: 16, size: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !444, file: !439, line: 18, baseType: !78, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !444, file: !439, line: 19, baseType: !124, size: 32)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !135)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !451, line: 78, type: !156, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !451, line: 79, type: !129, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !451, line: 80, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 13)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !451, line: 81, type: !456, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !451, line: 82, type: !297, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !451, line: 83, type: !134, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !451, line: 84, type: !156, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !451, line: 85, type: !19, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !451, line: 86, type: !19, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !451, line: 87, type: !156, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !475, file: !451, line: 76, type: !547, isLocal: false, isDefinition: true)
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !451, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !482, globals: !483, splitDebugInlining: false, nameTableKind: None)
!476 = !{!76, !477, !91}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 254, baseType: !78, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!480 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!481 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!482 = !{!108, !109, !110}
!483 = !{!449, !452, !454, !459, !461, !463, !465, !467, !469, !471, !473, !484, !488, !498, !500, !505, !507, !509, !511, !513, !536, !543, !545}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !475, file: !451, line: 92, type: !486, isLocal: false, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !40)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !475, file: !451, line: 1040, type: !490, isLocal: false, isDefinition: true)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !451, line: 56, size: 448, elements: !491)
!491 = !{!492, !493, !494, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !490, file: !451, line: 59, baseType: !76, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !490, file: !451, line: 62, baseType: !108, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !490, file: !451, line: 66, baseType: !495, size: 256, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 256, elements: !157)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !490, file: !451, line: 69, baseType: !72, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !490, file: !451, line: 72, baseType: !72, size: 64, offset: 384)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !475, file: !451, line: 107, type: !490, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "slot0", scope: !475, file: !451, line: 831, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 256)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !451, line: 321, type: !134, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !451, line: 357, type: !134, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !451, line: 358, type: !134, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !451, line: 199, type: !19, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quote", scope: !515, file: !451, line: 228, type: !534, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "gettext_quote", scope: !451, file: !451, line: 197, type: !516, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !475, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!72, !72, !76}
!518 = !{!519, !520, !521, !522, !523}
!519 = !DILocalVariable(name: "msgid", arg: 1, scope: !515, file: !451, line: 197, type: !72)
!520 = !DILocalVariable(name: "s", arg: 2, scope: !515, file: !451, line: 197, type: !76)
!521 = !DILocalVariable(name: "translation", scope: !515, file: !451, line: 199, type: !72)
!522 = !DILocalVariable(name: "w", scope: !515, file: !451, line: 229, type: !431)
!523 = !DILocalVariable(name: "mbs", scope: !515, file: !451, line: 230, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !526, file: !439, line: 15, baseType: !108, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !526, file: !439, line: 20, baseType: !530, size: 32, offset: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !439, line: 16, size: 32, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !530, file: !439, line: 18, baseType: !78, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !530, file: !439, line: 19, baseType: !124, size: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !535)
!535 = !{!136, !126}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "slotvec", scope: !475, file: !451, line: 834, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !451, line: 823, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !451, line: 825, baseType: !110, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !451, line: 826, baseType: !255, size: 64, offset: 64)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "nslots", scope: !475, file: !451, line: 832, type: !108, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec0", scope: !475, file: !451, line: 833, type: !539, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 704, elements: !549)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!549 = !{!550}
!550 = !DISubrange(count: 11)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !553, line: 67, type: !224, isLocal: true, isDefinition: true)
!553 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !553, line: 69, type: !19, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !19, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !553, line: 83, type: !124, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !553, line: 85, type: !134, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 171)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !553, line: 88, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 34)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !553, line: 105, type: !56, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !553, line: 109, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 23)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !553, line: 113, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 28)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !553, line: 120, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 32)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !553, line: 127, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 36)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !553, line: 134, type: !175, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !553, line: 142, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 44)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !553, line: 150, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 48)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !553, line: 159, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 52)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !553, line: 170, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 60)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !297, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !553, line: 248, type: !200, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !297, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !49, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !553, line: 254, type: !175, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !3, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !553, line: 259, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 29)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !635, file: !636, line: 26, type: !638, isLocal: false, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !636, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!637 = !{!633}
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 47)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "exit_failure", scope: !643, file: !644, line: 24, type: !646, isLocal: false, isDefinition: true)
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !645, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!645 = !{!641}
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !143, isLocal: true, isDefinition: true)
!649 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !19, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !649, line: 34, type: !61, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !656, line: 108, type: !34, isLocal: true, isDefinition: true)
!656 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "internal_state", scope: !659, file: !656, line: 97, type: !662, isLocal: true, isDefinition: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C11, file: !656, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !660, globals: !661, splitDebugInlining: false, nameTableKind: None)
!660 = !{!107, !110, !113}
!661 = !{!654, !657}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !437, line: 6, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !439, line: 21, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 64, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !664, file: !439, line: 15, baseType: !108, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !664, file: !439, line: 20, baseType: !668, size: 32, offset: 32)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !664, file: !439, line: 16, size: 32, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !668, file: !439, line: 18, baseType: !78, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !668, file: !439, line: 19, baseType: !124, size: 32)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !674, line: 35, type: !134, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !674, line: 35, type: !129, isLocal: true, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C11, file: !678, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!679 = distinct !DICompileUnit(language: DW_LANG_C11, file: !553, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !680, retainedTypes: !684, globals: !685, splitDebugInlining: false, nameTableKind: None)
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 40, baseType: !78, size: 32, elements: !682)
!682 = !{!683}
!683 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!684 = !{!107}
!685 = !{!551, !554, !556, !558, !560, !562, !567, !572, !574, !579, !584, !589, !594, !596, !601, !606, !611, !616, !618, !620, !622, !624, !626, !628}
!686 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !688, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!688 = !{!689, !701}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !690, file: !687, line: 188, baseType: !78, size: 32, elements: !699)
!690 = distinct !DISubprogram(name: "x2nrealloc", scope: !687, file: !687, line: 176, type: !691, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !686, retainedNodes: !694)
!691 = !DISubroutineType(types: !692)
!692 = !{!107, !107, !693, !110}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!694 = !{!695, !696, !697, !698}
!695 = !DILocalVariable(name: "p", arg: 1, scope: !690, file: !687, line: 176, type: !107)
!696 = !DILocalVariable(name: "pn", arg: 2, scope: !690, file: !687, line: 176, type: !693)
!697 = !DILocalVariable(name: "s", arg: 3, scope: !690, file: !687, line: 176, type: !110)
!698 = !DILocalVariable(name: "n", scope: !690, file: !687, line: 178, type: !110)
!699 = !{!700}
!700 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !702, file: !687, line: 228, baseType: !78, size: 32, elements: !699)
!702 = distinct !DISubprogram(name: "xpalloc", scope: !687, file: !687, line: 223, type: !703, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !686, retainedNodes: !709)
!703 = !DISubroutineType(types: !704)
!704 = !{!107, !107, !705, !706, !708, !706}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !707, line: 130, baseType: !708)
!707 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !111, line: 35, baseType: !276)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718}
!710 = !DILocalVariable(name: "pa", arg: 1, scope: !702, file: !687, line: 223, type: !107)
!711 = !DILocalVariable(name: "pn", arg: 2, scope: !702, file: !687, line: 223, type: !705)
!712 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !702, file: !687, line: 223, type: !706)
!713 = !DILocalVariable(name: "n_max", arg: 4, scope: !702, file: !687, line: 223, type: !708)
!714 = !DILocalVariable(name: "s", arg: 5, scope: !702, file: !687, line: 223, type: !706)
!715 = !DILocalVariable(name: "n0", scope: !702, file: !687, line: 230, type: !706)
!716 = !DILocalVariable(name: "n", scope: !702, file: !687, line: 237, type: !706)
!717 = !DILocalVariable(name: "nbytes", scope: !702, file: !687, line: 248, type: !706)
!718 = !DILocalVariable(name: "adjusted_nbytes", scope: !702, file: !687, line: 252, type: !706)
!719 = !{!255, !107, !234, !276, !112}
!720 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !721, splitDebugInlining: false, nameTableKind: None)
!721 = !{!647, !650, !652}
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !684, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !684, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !732, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!732 = !{!234, !112, !107}
!733 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !734, splitDebugInlining: false, nameTableKind: None)
!734 = !{!672, !675}
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !736, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !684, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!739 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!740 = !{i32 7, !"Dwarf Version", i32 5}
!741 = !{i32 2, !"Debug Info Version", i32 3}
!742 = !{i32 1, !"wchar_size", i32 4}
!743 = !{i32 8, !"PIC Level", i32 2}
!744 = !{i32 7, !"PIE Level", i32 2}
!745 = !{i32 7, !"uwtable", i32 2}
!746 = !{i32 7, !"frame-pointer", i32 1}
!747 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !748, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !750)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !108}
!750 = !{!751}
!751 = !DILocalVariable(name: "status", arg: 1, scope: !747, file: !2, line: 37, type: !108)
!752 = !DILocation(line: 0, scope: !747)
!753 = !DILocation(line: 39, column: 14, scope: !754)
!754 = distinct !DILexicalBlock(scope: !747, file: !2, line: 39, column: 7)
!755 = !DILocation(line: 39, column: 7, scope: !747)
!756 = !DILocation(line: 40, column: 5, scope: !757)
!757 = distinct !DILexicalBlock(scope: !754, file: !2, line: 40, column: 5)
!758 = !{!759, !759, i64 0}
!759 = !{!"any pointer", !760, i64 0}
!760 = !{!"omnipotent char", !761, i64 0}
!761 = !{!"Simple C/C++ TBAA"}
!762 = !DILocation(line: 43, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !754, file: !2, line: 42, column: 5)
!764 = !DILocation(line: 46, column: 7, scope: !763)
!765 = !DILocation(line: 48, column: 7, scope: !763)
!766 = !DILocation(line: 49, column: 7, scope: !763)
!767 = !DILocalVariable(name: "program", arg: 1, scope: !768, file: !69, line: 836, type: !72)
!768 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !769, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !72}
!771 = !{!767, !772, !779, !780, !782, !783}
!772 = !DILocalVariable(name: "infomap", scope: !768, file: !69, line: 838, type: !773)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 896, elements: !20)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !768, file: !69, line: 838, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !775, file: !69, line: 838, baseType: !72, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !775, file: !69, line: 838, baseType: !72, size: 64, offset: 64)
!779 = !DILocalVariable(name: "node", scope: !768, file: !69, line: 848, type: !72)
!780 = !DILocalVariable(name: "map_prog", scope: !768, file: !69, line: 849, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!782 = !DILocalVariable(name: "lc_messages", scope: !768, file: !69, line: 861, type: !72)
!783 = !DILocalVariable(name: "url_program", scope: !768, file: !69, line: 874, type: !72)
!784 = !DILocation(line: 0, scope: !768, inlinedAt: !785)
!785 = distinct !DILocation(line: 50, column: 7, scope: !763)
!786 = !DILocation(line: 857, column: 3, scope: !768, inlinedAt: !785)
!787 = !DILocation(line: 861, column: 29, scope: !768, inlinedAt: !785)
!788 = !DILocation(line: 862, column: 7, scope: !789, inlinedAt: !785)
!789 = distinct !DILexicalBlock(scope: !768, file: !69, line: 862, column: 7)
!790 = !DILocation(line: 862, column: 19, scope: !789, inlinedAt: !785)
!791 = !DILocation(line: 862, column: 22, scope: !789, inlinedAt: !785)
!792 = !DILocation(line: 862, column: 7, scope: !768, inlinedAt: !785)
!793 = !DILocation(line: 868, column: 7, scope: !794, inlinedAt: !785)
!794 = distinct !DILexicalBlock(scope: !789, file: !69, line: 863, column: 5)
!795 = !DILocation(line: 870, column: 5, scope: !794, inlinedAt: !785)
!796 = !DILocation(line: 875, column: 3, scope: !768, inlinedAt: !785)
!797 = !DILocation(line: 877, column: 3, scope: !768, inlinedAt: !785)
!798 = !DILocation(line: 52, column: 3, scope: !747)
!799 = !DISubprogram(name: "dcgettext", scope: !800, file: !800, line: 51, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!800 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!801 = !DISubroutineType(types: !802)
!802 = !{!255, !72, !72, !108}
!803 = !{}
!804 = !DISubprogram(name: "__fprintf_chk", scope: !805, file: !805, line: 93, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!805 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!806 = !DISubroutineType(types: !807)
!807 = !{!108, !808, !108, !809, null}
!808 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!809 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!810 = !DISubprogram(name: "__printf_chk", scope: !805, file: !805, line: 95, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!811 = !DISubroutineType(types: !812)
!812 = !{!108, !108, !809, null}
!813 = !DISubprogram(name: "fputs_unlocked", scope: !342, file: !342, line: 691, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!814 = !DISubroutineType(types: !815)
!815 = !{!108, !809, !808}
!816 = !DILocation(line: 0, scope: !68)
!817 = !DILocation(line: 581, column: 7, scope: !232)
!818 = !{!819, !819, i64 0}
!819 = !{!"int", !760, i64 0}
!820 = !DILocation(line: 581, column: 19, scope: !232)
!821 = !DILocation(line: 581, column: 7, scope: !68)
!822 = !DILocation(line: 585, column: 26, scope: !231)
!823 = !DILocation(line: 0, scope: !231)
!824 = !DILocation(line: 586, column: 23, scope: !231)
!825 = !DILocation(line: 586, column: 28, scope: !231)
!826 = !DILocation(line: 586, column: 32, scope: !231)
!827 = !{!760, !760, i64 0}
!828 = !DILocation(line: 586, column: 38, scope: !231)
!829 = !DILocalVariable(name: "__s1", arg: 1, scope: !830, file: !831, line: 1359, type: !72)
!830 = distinct !DISubprogram(name: "streq", scope: !831, file: !831, line: 1359, type: !832, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !834)
!831 = !DIFile(filename: "./lib/string.h", directory: "/src")
!832 = !DISubroutineType(types: !833)
!833 = !{!234, !72, !72}
!834 = !{!829, !835}
!835 = !DILocalVariable(name: "__s2", arg: 2, scope: !830, file: !831, line: 1359, type: !72)
!836 = !DILocation(line: 0, scope: !830, inlinedAt: !837)
!837 = distinct !DILocation(line: 586, column: 41, scope: !231)
!838 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !837)
!839 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !837)
!840 = !DILocation(line: 586, column: 19, scope: !231)
!841 = !DILocation(line: 587, column: 5, scope: !231)
!842 = !DILocation(line: 588, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !68, file: !69, line: 588, column: 7)
!844 = !DILocation(line: 588, column: 7, scope: !68)
!845 = !DILocation(line: 590, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !69, line: 589, column: 5)
!847 = !DILocation(line: 591, column: 7, scope: !846)
!848 = !DILocation(line: 595, column: 37, scope: !68)
!849 = !DILocation(line: 595, column: 35, scope: !68)
!850 = !DILocation(line: 596, column: 29, scope: !68)
!851 = !DILocation(line: 597, column: 8, scope: !240)
!852 = !DILocation(line: 597, column: 7, scope: !68)
!853 = !DILocation(line: 604, column: 24, scope: !239)
!854 = !DILocation(line: 604, column: 12, scope: !240)
!855 = !DILocation(line: 0, scope: !238)
!856 = !DILocation(line: 610, column: 16, scope: !238)
!857 = !DILocation(line: 610, column: 7, scope: !238)
!858 = !DILocation(line: 611, column: 21, scope: !238)
!859 = !{!860, !860, i64 0}
!860 = !{!"short", !760, i64 0}
!861 = !DILocation(line: 611, column: 19, scope: !238)
!862 = !DILocation(line: 611, column: 16, scope: !238)
!863 = !DILocation(line: 610, column: 30, scope: !238)
!864 = distinct !{!864, !857, !858, !865}
!865 = !{!"llvm.loop.mustprogress"}
!866 = !DILocation(line: 612, column: 18, scope: !867)
!867 = distinct !DILexicalBlock(scope: !238, file: !69, line: 612, column: 11)
!868 = !DILocation(line: 612, column: 11, scope: !238)
!869 = !DILocation(line: 620, column: 23, scope: !68)
!870 = !DILocation(line: 625, column: 39, scope: !68)
!871 = !DILocation(line: 626, column: 3, scope: !68)
!872 = !DILocation(line: 626, column: 10, scope: !68)
!873 = !DILocation(line: 626, column: 21, scope: !68)
!874 = !DILocation(line: 628, column: 44, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !69, line: 628, column: 11)
!876 = distinct !DILexicalBlock(scope: !68, file: !69, line: 627, column: 5)
!877 = !DILocation(line: 628, column: 32, scope: !875)
!878 = !DILocation(line: 628, column: 49, scope: !875)
!879 = !DILocation(line: 628, column: 11, scope: !876)
!880 = !DILocation(line: 630, column: 11, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !69, line: 630, column: 11)
!882 = !DILocation(line: 630, column: 11, scope: !876)
!883 = !DILocation(line: 632, column: 26, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !69, line: 632, column: 15)
!885 = distinct !DILexicalBlock(scope: !881, file: !69, line: 631, column: 9)
!886 = !DILocation(line: 632, column: 34, scope: !884)
!887 = !DILocation(line: 632, column: 37, scope: !884)
!888 = !DILocation(line: 632, column: 15, scope: !885)
!889 = !DILocation(line: 640, column: 16, scope: !876)
!890 = distinct !{!890, !871, !891, !865}
!891 = !DILocation(line: 641, column: 5, scope: !68)
!892 = !DILocation(line: 644, column: 3, scope: !68)
!893 = !DILocation(line: 0, scope: !830, inlinedAt: !894)
!894 = distinct !DILocation(line: 648, column: 31, scope: !68)
!895 = !DILocation(line: 0, scope: !830, inlinedAt: !896)
!896 = distinct !DILocation(line: 649, column: 31, scope: !68)
!897 = !DILocation(line: 0, scope: !830, inlinedAt: !898)
!898 = distinct !DILocation(line: 650, column: 31, scope: !68)
!899 = !DILocation(line: 0, scope: !830, inlinedAt: !900)
!900 = distinct !DILocation(line: 651, column: 31, scope: !68)
!901 = !DILocation(line: 0, scope: !830, inlinedAt: !902)
!902 = distinct !DILocation(line: 652, column: 31, scope: !68)
!903 = !DILocation(line: 0, scope: !830, inlinedAt: !904)
!904 = distinct !DILocation(line: 653, column: 31, scope: !68)
!905 = !DILocation(line: 0, scope: !830, inlinedAt: !906)
!906 = distinct !DILocation(line: 654, column: 31, scope: !68)
!907 = !DILocation(line: 0, scope: !830, inlinedAt: !908)
!908 = distinct !DILocation(line: 655, column: 31, scope: !68)
!909 = !DILocation(line: 0, scope: !830, inlinedAt: !910)
!910 = distinct !DILocation(line: 656, column: 31, scope: !68)
!911 = !DILocation(line: 0, scope: !830, inlinedAt: !912)
!912 = distinct !DILocation(line: 657, column: 31, scope: !68)
!913 = !DILocation(line: 663, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !68, file: !69, line: 663, column: 7)
!915 = !DILocation(line: 664, column: 7, scope: !914)
!916 = !DILocation(line: 664, column: 10, scope: !914)
!917 = !DILocation(line: 663, column: 7, scope: !68)
!918 = !DILocation(line: 669, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !69, line: 665, column: 5)
!920 = !DILocation(line: 671, column: 5, scope: !919)
!921 = !DILocation(line: 676, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !914, file: !69, line: 673, column: 5)
!923 = !DILocation(line: 679, column: 3, scope: !68)
!924 = !DILocation(line: 683, column: 3, scope: !68)
!925 = !DILocation(line: 686, column: 3, scope: !68)
!926 = !DILocation(line: 688, column: 3, scope: !68)
!927 = !DILocation(line: 691, column: 3, scope: !68)
!928 = !DILocation(line: 695, column: 3, scope: !68)
!929 = !DILocation(line: 696, column: 1, scope: !68)
!930 = !DISubprogram(name: "setlocale", scope: !931, file: !931, line: 122, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!931 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!932 = !DISubroutineType(types: !933)
!933 = !{!255, !108, !72}
!934 = !DISubprogram(name: "strncmp", scope: !935, file: !935, line: 159, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!935 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!936 = !DISubroutineType(types: !937)
!937 = !{!108, !72, !72, !110}
!938 = !DISubprogram(name: "exit", scope: !939, file: !939, line: 624, type: !748, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !803)
!939 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!940 = !DISubprogram(name: "getenv", scope: !939, file: !939, line: 641, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!941 = !DISubroutineType(types: !942)
!942 = !{!255, !72}
!943 = !DISubprogram(name: "strcmp", scope: !935, file: !935, line: 156, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!944 = !DISubroutineType(types: !945)
!945 = !{!108, !72, !72}
!946 = !DISubprogram(name: "strspn", scope: !935, file: !935, line: 297, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!947 = !DISubroutineType(types: !948)
!948 = !{!112, !72, !72}
!949 = !DISubprogram(name: "strchr", scope: !935, file: !935, line: 246, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!950 = !DISubroutineType(types: !951)
!951 = !{!255, !72, !108}
!952 = !DISubprogram(name: "__ctype_b_loc", scope: !92, file: !92, line: 79, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!953 = !DISubroutineType(types: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!958 = !DISubprogram(name: "strcspn", scope: !935, file: !935, line: 293, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!959 = !DISubprogram(name: "fwrite_unlocked", scope: !342, file: !342, line: 704, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!960 = !DISubroutineType(types: !961)
!961 = !{!110, !962, !110, !110, !808}
!962 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!965 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 56, type: !966, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !74, retainedNodes: !969)
!966 = !DISubroutineType(types: !967)
!967 = !{!108, !108, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!969 = !{!970, !971}
!970 = !DILocalVariable(name: "argc", arg: 1, scope: !965, file: !2, line: 56, type: !108)
!971 = !DILocalVariable(name: "argv", arg: 2, scope: !965, file: !2, line: 56, type: !968)
!972 = !DILocation(line: 0, scope: !965)
!973 = !DILocation(line: 59, column: 21, scope: !965)
!974 = !DILocation(line: 59, column: 3, scope: !965)
!975 = !DILocation(line: 60, column: 3, scope: !965)
!976 = !DILocation(line: 61, column: 3, scope: !965)
!977 = !DILocation(line: 62, column: 3, scope: !965)
!978 = !DILocation(line: 64, column: 3, scope: !965)
!979 = !DILocation(line: 67, column: 36, scope: !965)
!980 = !DILocation(line: 67, column: 58, scope: !965)
!981 = !DILocation(line: 66, column: 3, scope: !965)
!982 = !DILocation(line: 70, column: 14, scope: !983)
!983 = distinct !DILexicalBlock(scope: !965, file: !2, line: 70, column: 7)
!984 = !DILocation(line: 70, column: 12, scope: !983)
!985 = !DILocation(line: 70, column: 7, scope: !965)
!986 = !DILocation(line: 72, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !983, file: !2, line: 71, column: 5)
!988 = !DILocation(line: 73, column: 7, scope: !987)
!989 = !DILocation(line: 70, column: 21, scope: !983)
!990 = !DILocation(line: 76, column: 18, scope: !991)
!991 = distinct !DILexicalBlock(scope: !965, file: !2, line: 76, column: 7)
!992 = !DILocation(line: 76, column: 7, scope: !965)
!993 = !DILocation(line: 78, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !2, line: 77, column: 5)
!995 = !DILocation(line: 79, column: 7, scope: !994)
!996 = !DILocation(line: 82, column: 15, scope: !997)
!997 = distinct !DILexicalBlock(scope: !965, file: !2, line: 82, column: 7)
!998 = !DILocation(line: 82, column: 7, scope: !997)
!999 = !DILocation(line: 82, column: 29, scope: !997)
!1000 = !DILocation(line: 82, column: 7, scope: !965)
!1001 = !DILocation(line: 83, column: 5, scope: !997)
!1002 = !DILocation(line: 85, column: 3, scope: !965)
!1003 = !DISubprogram(name: "bindtextdomain", scope: !800, file: !800, line: 86, type: !1004, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!255, !72, !72}
!1006 = !DISubprogram(name: "textdomain", scope: !800, file: !800, line: 82, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1007 = !DISubprogram(name: "atexit", scope: !939, file: !939, line: 602, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!108, !382}
!1010 = !DISubprogram(name: "unlink", scope: !1011, file: !1011, line: 858, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1011 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!108, !72}
!1014 = !DISubprogram(name: "__errno_location", scope: !1015, file: !1015, line: 37, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1015 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!406}
!1018 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !316, file: !316, line: 50, type: !769, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1019)
!1019 = !{!1020}
!1020 = !DILocalVariable(name: "file", arg: 1, scope: !1018, file: !316, line: 50, type: !72)
!1021 = !DILocation(line: 0, scope: !1018)
!1022 = !DILocation(line: 52, column: 13, scope: !1018)
!1023 = !DILocation(line: 53, column: 1, scope: !1018)
!1024 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !316, file: !316, line: 87, type: !1025, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !234}
!1027 = !{!1028}
!1028 = !DILocalVariable(name: "ignore", arg: 1, scope: !1024, file: !316, line: 87, type: !234)
!1029 = !DILocation(line: 0, scope: !1024)
!1030 = !DILocation(line: 89, column: 16, scope: !1024)
!1031 = !{!1032, !1032, i64 0}
!1032 = !{!"_Bool", !760, i64 0}
!1033 = !DILocation(line: 90, column: 1, scope: !1024)
!1034 = distinct !DISubprogram(name: "close_stdout", scope: !316, file: !316, line: 116, type: !383, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !315, retainedNodes: !1035)
!1035 = !{!1036}
!1036 = !DILocalVariable(name: "write_error", scope: !1037, file: !316, line: 121, type: !72)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !316, line: 120, column: 5)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !316, line: 118, column: 7)
!1039 = !DILocation(line: 118, column: 21, scope: !1038)
!1040 = !DILocation(line: 118, column: 7, scope: !1038)
!1041 = !DILocation(line: 118, column: 29, scope: !1038)
!1042 = !DILocation(line: 119, column: 7, scope: !1038)
!1043 = !DILocation(line: 119, column: 12, scope: !1038)
!1044 = !{i8 0, i8 2}
!1045 = !DILocation(line: 119, column: 25, scope: !1038)
!1046 = !DILocation(line: 119, column: 28, scope: !1038)
!1047 = !DILocation(line: 119, column: 34, scope: !1038)
!1048 = !DILocation(line: 118, column: 7, scope: !1034)
!1049 = !DILocation(line: 121, column: 33, scope: !1037)
!1050 = !DILocation(line: 0, scope: !1037)
!1051 = !DILocation(line: 122, column: 11, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1037, file: !316, line: 122, column: 11)
!1053 = !DILocation(line: 0, scope: !1052)
!1054 = !DILocation(line: 122, column: 11, scope: !1037)
!1055 = !DILocation(line: 123, column: 9, scope: !1052)
!1056 = !DILocation(line: 126, column: 9, scope: !1052)
!1057 = !DILocation(line: 128, column: 14, scope: !1037)
!1058 = !DILocation(line: 128, column: 7, scope: !1037)
!1059 = !DILocation(line: 133, column: 42, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1034, file: !316, line: 133, column: 7)
!1061 = !DILocation(line: 133, column: 28, scope: !1060)
!1062 = !DILocation(line: 133, column: 50, scope: !1060)
!1063 = !DILocation(line: 133, column: 7, scope: !1034)
!1064 = !DILocation(line: 134, column: 12, scope: !1060)
!1065 = !DILocation(line: 134, column: 5, scope: !1060)
!1066 = !DILocation(line: 135, column: 1, scope: !1034)
!1067 = !DISubprogram(name: "_exit", scope: !1011, file: !1011, line: 624, type: !748, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1068 = distinct !DISubprogram(name: "verror", scope: !331, file: !331, line: 251, type: !1069, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1071)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !108, !108, !72, !341}
!1071 = !{!1072, !1073, !1074, !1075}
!1072 = !DILocalVariable(name: "status", arg: 1, scope: !1068, file: !331, line: 251, type: !108)
!1073 = !DILocalVariable(name: "errnum", arg: 2, scope: !1068, file: !331, line: 251, type: !108)
!1074 = !DILocalVariable(name: "message", arg: 3, scope: !1068, file: !331, line: 251, type: !72)
!1075 = !DILocalVariable(name: "args", arg: 4, scope: !1068, file: !331, line: 251, type: !341)
!1076 = !DILocation(line: 0, scope: !1068)
!1077 = !DILocation(line: 251, column: 1, scope: !1068)
!1078 = !DILocation(line: 261, column: 3, scope: !1068)
!1079 = !DILocation(line: 265, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1068, file: !331, line: 265, column: 7)
!1081 = !DILocation(line: 265, column: 7, scope: !1068)
!1082 = !DILocation(line: 266, column: 5, scope: !1080)
!1083 = !DILocation(line: 272, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !331, line: 268, column: 5)
!1085 = !DILocation(line: 276, column: 3, scope: !1068)
!1086 = !{i64 0, i64 8, !758, i64 8, i64 8, !758, i64 16, i64 8, !758, i64 24, i64 4, !818, i64 28, i64 4, !818}
!1087 = !DILocation(line: 282, column: 1, scope: !1068)
!1088 = distinct !DISubprogram(name: "flush_stdout", scope: !331, file: !331, line: 163, type: !383, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1089)
!1089 = !{!1090}
!1090 = !DILocalVariable(name: "stdout_fd", scope: !1088, file: !331, line: 166, type: !108)
!1091 = !DILocation(line: 0, scope: !1088)
!1092 = !DILocalVariable(name: "fd", arg: 1, scope: !1093, file: !331, line: 145, type: !108)
!1093 = distinct !DISubprogram(name: "is_open", scope: !331, file: !331, line: 145, type: !1094, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1096)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!108, !108}
!1096 = !{!1092}
!1097 = !DILocation(line: 0, scope: !1093, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 182, column: 25, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1088, file: !331, line: 182, column: 7)
!1100 = !DILocation(line: 157, column: 15, scope: !1093, inlinedAt: !1098)
!1101 = !DILocation(line: 157, column: 12, scope: !1093, inlinedAt: !1098)
!1102 = !DILocation(line: 182, column: 7, scope: !1088)
!1103 = !DILocation(line: 184, column: 5, scope: !1099)
!1104 = !DILocation(line: 185, column: 1, scope: !1088)
!1105 = distinct !DISubprogram(name: "error_tail", scope: !331, file: !331, line: 219, type: !1069, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1106)
!1106 = !{!1107, !1108, !1109, !1110}
!1107 = !DILocalVariable(name: "status", arg: 1, scope: !1105, file: !331, line: 219, type: !108)
!1108 = !DILocalVariable(name: "errnum", arg: 2, scope: !1105, file: !331, line: 219, type: !108)
!1109 = !DILocalVariable(name: "message", arg: 3, scope: !1105, file: !331, line: 219, type: !72)
!1110 = !DILocalVariable(name: "args", arg: 4, scope: !1105, file: !331, line: 219, type: !341)
!1111 = !DILocation(line: 0, scope: !1105)
!1112 = !DILocation(line: 219, column: 1, scope: !1105)
!1113 = !DILocation(line: 229, column: 13, scope: !1105)
!1114 = !DILocation(line: 135, column: 10, scope: !1115, inlinedAt: !1157)
!1115 = distinct !DISubprogram(name: "vfprintf", scope: !805, file: !805, line: 132, type: !1116, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1153)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!108, !1118, !809, !343}
!1118 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 7, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !251, line: 49, size: 1728, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1121, file: !251, line: 51, baseType: !108, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1121, file: !251, line: 54, baseType: !255, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1121, file: !251, line: 55, baseType: !255, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1121, file: !251, line: 56, baseType: !255, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1121, file: !251, line: 57, baseType: !255, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1121, file: !251, line: 58, baseType: !255, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1121, file: !251, line: 59, baseType: !255, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1121, file: !251, line: 60, baseType: !255, size: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1121, file: !251, line: 61, baseType: !255, size: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1121, file: !251, line: 64, baseType: !255, size: 64, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1121, file: !251, line: 65, baseType: !255, size: 64, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1121, file: !251, line: 66, baseType: !255, size: 64, offset: 704)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1121, file: !251, line: 68, baseType: !267, size: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1121, file: !251, line: 70, baseType: !1137, size: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1121, file: !251, line: 72, baseType: !108, size: 32, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1121, file: !251, line: 73, baseType: !108, size: 32, offset: 928)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1121, file: !251, line: 74, baseType: !274, size: 64, offset: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1121, file: !251, line: 77, baseType: !109, size: 16, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1121, file: !251, line: 78, baseType: !279, size: 8, offset: 1040)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1121, file: !251, line: 79, baseType: !34, size: 8, offset: 1048)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1121, file: !251, line: 81, baseType: !282, size: 64, offset: 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1121, file: !251, line: 89, baseType: !285, size: 64, offset: 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1121, file: !251, line: 91, baseType: !287, size: 64, offset: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1121, file: !251, line: 92, baseType: !290, size: 64, offset: 1280)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1121, file: !251, line: 93, baseType: !1137, size: 64, offset: 1344)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1121, file: !251, line: 94, baseType: !107, size: 64, offset: 1408)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1121, file: !251, line: 95, baseType: !110, size: 64, offset: 1472)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1121, file: !251, line: 96, baseType: !108, size: 32, offset: 1536)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1121, file: !251, line: 98, baseType: !297, size: 160, offset: 1568)
!1153 = !{!1154, !1155, !1156}
!1154 = !DILocalVariable(name: "__stream", arg: 1, scope: !1115, file: !805, line: 132, type: !1118)
!1155 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1115, file: !805, line: 133, type: !809)
!1156 = !DILocalVariable(name: "__ap", arg: 3, scope: !1115, file: !805, line: 133, type: !343)
!1157 = distinct !DILocation(line: 229, column: 3, scope: !1105)
!1158 = !{!1159, !1161}
!1159 = distinct !{!1159, !1160, !"vfprintf.inline: argument 0"}
!1160 = distinct !{!1160, !"vfprintf.inline"}
!1161 = distinct !{!1161, !1160, !"vfprintf.inline: argument 1"}
!1162 = !DILocation(line: 229, column: 3, scope: !1105)
!1163 = !DILocation(line: 0, scope: !1115, inlinedAt: !1157)
!1164 = !DILocation(line: 133, column: 49, scope: !1115, inlinedAt: !1157)
!1165 = !DILocation(line: 232, column: 3, scope: !1105)
!1166 = !DILocation(line: 233, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1105, file: !331, line: 233, column: 7)
!1168 = !DILocation(line: 233, column: 7, scope: !1105)
!1169 = !DILocalVariable(name: "errnum", arg: 1, scope: !1170, file: !331, line: 188, type: !108)
!1170 = distinct !DISubprogram(name: "print_errno_message", scope: !331, file: !331, line: 188, type: !748, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1171)
!1171 = !{!1169, !1172, !1173}
!1172 = !DILocalVariable(name: "s", scope: !1170, file: !331, line: 190, type: !72)
!1173 = !DILocalVariable(name: "errbuf", scope: !1170, file: !331, line: 193, type: !1174)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 1024)
!1177 = !DILocation(line: 0, scope: !1170, inlinedAt: !1178)
!1178 = distinct !DILocation(line: 234, column: 5, scope: !1167)
!1179 = !DILocation(line: 193, column: 3, scope: !1170, inlinedAt: !1178)
!1180 = !DILocation(line: 193, column: 8, scope: !1170, inlinedAt: !1178)
!1181 = !DILocation(line: 195, column: 7, scope: !1170, inlinedAt: !1178)
!1182 = !DILocation(line: 207, column: 9, scope: !1183, inlinedAt: !1178)
!1183 = distinct !DILexicalBlock(scope: !1170, file: !331, line: 207, column: 7)
!1184 = !DILocation(line: 207, column: 7, scope: !1170, inlinedAt: !1178)
!1185 = !DILocation(line: 208, column: 9, scope: !1183, inlinedAt: !1178)
!1186 = !DILocation(line: 208, column: 5, scope: !1183, inlinedAt: !1178)
!1187 = !DILocation(line: 214, column: 3, scope: !1170, inlinedAt: !1178)
!1188 = !DILocation(line: 216, column: 1, scope: !1170, inlinedAt: !1178)
!1189 = !DILocation(line: 234, column: 5, scope: !1167)
!1190 = !DILocation(line: 238, column: 3, scope: !1105)
!1191 = !DILocalVariable(name: "__c", arg: 1, scope: !1192, file: !1193, line: 101, type: !108)
!1192 = distinct !DISubprogram(name: "putc_unlocked", scope: !1193, file: !1193, line: 101, type: !1194, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1196)
!1193 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!108, !108, !1119}
!1196 = !{!1191, !1197}
!1197 = !DILocalVariable(name: "__stream", arg: 2, scope: !1192, file: !1193, line: 101, type: !1119)
!1198 = !DILocation(line: 0, scope: !1192, inlinedAt: !1199)
!1199 = distinct !DILocation(line: 238, column: 3, scope: !1105)
!1200 = !DILocation(line: 103, column: 10, scope: !1192, inlinedAt: !1199)
!1201 = !{!1202, !759, i64 40}
!1202 = !{!"_IO_FILE", !819, i64 0, !759, i64 8, !759, i64 16, !759, i64 24, !759, i64 32, !759, i64 40, !759, i64 48, !759, i64 56, !759, i64 64, !759, i64 72, !759, i64 80, !759, i64 88, !759, i64 96, !759, i64 104, !819, i64 112, !819, i64 116, !1203, i64 120, !860, i64 128, !760, i64 130, !760, i64 131, !759, i64 136, !1203, i64 144, !759, i64 152, !759, i64 160, !759, i64 168, !759, i64 176, !1203, i64 184, !819, i64 192, !760, i64 196}
!1203 = !{!"long", !760, i64 0}
!1204 = !{!1202, !759, i64 48}
!1205 = !{!"branch_weights", i32 2000, i32 1}
!1206 = !DILocation(line: 240, column: 3, scope: !1105)
!1207 = !DILocation(line: 241, column: 7, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1105, file: !331, line: 241, column: 7)
!1209 = !DILocation(line: 241, column: 7, scope: !1105)
!1210 = !DILocation(line: 242, column: 5, scope: !1208)
!1211 = !DILocation(line: 243, column: 1, scope: !1105)
!1212 = !DISubprogram(name: "__vfprintf_chk", scope: !805, file: !805, line: 96, type: !1213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!108, !1118, !108, !809, !343}
!1215 = !DISubprogram(name: "strerror_r", scope: !935, file: !935, line: 444, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!255, !108, !255, !110}
!1218 = !DISubprogram(name: "__overflow", scope: !342, file: !342, line: 886, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!108, !1119, !108}
!1221 = !DISubprogram(name: "fflush_unlocked", scope: !342, file: !342, line: 239, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!108, !1119}
!1224 = !DISubprogram(name: "fcntl", scope: !1225, file: !1225, line: 149, type: !1226, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !803)
!1225 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!108, !108, !108, null}
!1228 = distinct !DISubprogram(name: "error", scope: !331, file: !331, line: 285, type: !1229, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1231)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !108, !108, !72, null}
!1231 = !{!1232, !1233, !1234, !1235}
!1232 = !DILocalVariable(name: "status", arg: 1, scope: !1228, file: !331, line: 285, type: !108)
!1233 = !DILocalVariable(name: "errnum", arg: 2, scope: !1228, file: !331, line: 285, type: !108)
!1234 = !DILocalVariable(name: "message", arg: 3, scope: !1228, file: !331, line: 285, type: !72)
!1235 = !DILocalVariable(name: "ap", scope: !1228, file: !331, line: 287, type: !341)
!1236 = !DILocation(line: 0, scope: !1228)
!1237 = !DILocation(line: 287, column: 3, scope: !1228)
!1238 = !DILocation(line: 287, column: 11, scope: !1228)
!1239 = !DILocation(line: 288, column: 3, scope: !1228)
!1240 = !DILocation(line: 289, column: 3, scope: !1228)
!1241 = !DILocation(line: 290, column: 3, scope: !1228)
!1242 = !DILocation(line: 291, column: 1, scope: !1228)
!1243 = !DILocation(line: 0, scope: !338)
!1244 = !DILocation(line: 298, column: 1, scope: !338)
!1245 = !DILocation(line: 302, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !338, file: !331, line: 302, column: 7)
!1247 = !DILocation(line: 302, column: 7, scope: !338)
!1248 = !DILocation(line: 307, column: 11, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !331, line: 307, column: 11)
!1250 = distinct !DILexicalBlock(scope: !1246, file: !331, line: 303, column: 5)
!1251 = !DILocation(line: 307, column: 27, scope: !1249)
!1252 = !DILocation(line: 308, column: 11, scope: !1249)
!1253 = !DILocation(line: 308, column: 28, scope: !1249)
!1254 = !DILocation(line: 308, column: 25, scope: !1249)
!1255 = !DILocation(line: 309, column: 15, scope: !1249)
!1256 = !DILocation(line: 309, column: 33, scope: !1249)
!1257 = !DILocation(line: 310, column: 19, scope: !1249)
!1258 = !DILocation(line: 311, column: 22, scope: !1249)
!1259 = !DILocation(line: 311, column: 56, scope: !1249)
!1260 = !DILocation(line: 307, column: 11, scope: !1250)
!1261 = !DILocation(line: 316, column: 21, scope: !1250)
!1262 = !DILocation(line: 317, column: 23, scope: !1250)
!1263 = !DILocation(line: 318, column: 5, scope: !1250)
!1264 = !DILocation(line: 327, column: 3, scope: !338)
!1265 = !DILocation(line: 331, column: 7, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !338, file: !331, line: 331, column: 7)
!1267 = !DILocation(line: 331, column: 7, scope: !338)
!1268 = !DILocation(line: 332, column: 5, scope: !1266)
!1269 = !DILocation(line: 338, column: 7, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !331, line: 334, column: 5)
!1271 = !DILocation(line: 346, column: 3, scope: !338)
!1272 = !DILocation(line: 350, column: 3, scope: !338)
!1273 = !DILocation(line: 356, column: 1, scope: !338)
!1274 = distinct !DISubprogram(name: "error_at_line", scope: !331, file: !331, line: 359, type: !1275, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !1277)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !108, !108, !72, !78, !72, null}
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283}
!1278 = !DILocalVariable(name: "status", arg: 1, scope: !1274, file: !331, line: 359, type: !108)
!1279 = !DILocalVariable(name: "errnum", arg: 2, scope: !1274, file: !331, line: 359, type: !108)
!1280 = !DILocalVariable(name: "file_name", arg: 3, scope: !1274, file: !331, line: 359, type: !72)
!1281 = !DILocalVariable(name: "line_number", arg: 4, scope: !1274, file: !331, line: 360, type: !78)
!1282 = !DILocalVariable(name: "message", arg: 5, scope: !1274, file: !331, line: 360, type: !72)
!1283 = !DILocalVariable(name: "ap", scope: !1274, file: !331, line: 362, type: !341)
!1284 = !DILocation(line: 0, scope: !1274)
!1285 = !DILocation(line: 362, column: 3, scope: !1274)
!1286 = !DILocation(line: 362, column: 11, scope: !1274)
!1287 = !DILocation(line: 363, column: 3, scope: !1274)
!1288 = !DILocation(line: 364, column: 3, scope: !1274)
!1289 = !DILocation(line: 366, column: 3, scope: !1274)
!1290 = !DILocation(line: 367, column: 1, scope: !1274)
!1291 = distinct !DISubprogram(name: "getprogname", scope: !678, file: !678, line: 54, type: !1292, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !803)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!72}
!1294 = !DILocation(line: 58, column: 10, scope: !1291)
!1295 = !DILocation(line: 58, column: 3, scope: !1291)
!1296 = distinct !DISubprogram(name: "parse_long_options", scope: !387, file: !387, line: 45, type: !1297, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1300)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !108, !968, !72, !72, !72, !1299, null}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1311}
!1301 = !DILocalVariable(name: "argc", arg: 1, scope: !1296, file: !387, line: 45, type: !108)
!1302 = !DILocalVariable(name: "argv", arg: 2, scope: !1296, file: !387, line: 46, type: !968)
!1303 = !DILocalVariable(name: "command_name", arg: 3, scope: !1296, file: !387, line: 47, type: !72)
!1304 = !DILocalVariable(name: "package", arg: 4, scope: !1296, file: !387, line: 48, type: !72)
!1305 = !DILocalVariable(name: "version", arg: 5, scope: !1296, file: !387, line: 49, type: !72)
!1306 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1296, file: !387, line: 50, type: !1299)
!1307 = !DILocalVariable(name: "saved_opterr", scope: !1296, file: !387, line: 53, type: !108)
!1308 = !DILocalVariable(name: "c", scope: !1309, file: !387, line: 60, type: !108)
!1309 = distinct !DILexicalBlock(scope: !1310, file: !387, line: 59, column: 5)
!1310 = distinct !DILexicalBlock(scope: !1296, file: !387, line: 58, column: 7)
!1311 = !DILocalVariable(name: "authors", scope: !1312, file: !387, line: 71, type: !1316)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !387, line: 70, column: 15)
!1313 = distinct !DILexicalBlock(scope: !1314, file: !387, line: 64, column: 13)
!1314 = distinct !DILexicalBlock(scope: !1315, file: !387, line: 62, column: 9)
!1315 = distinct !DILexicalBlock(scope: !1309, file: !387, line: 61, column: 11)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !342, line: 52, baseType: !1317)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !344, line: 14, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1319, baseType: !1320)
!1319 = !DIFile(filename: "lib/long-options.c", directory: "/src")
