; ModuleID = 'src/users.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !71, line: 676, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 61)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !71, line: 679, type: !151, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !71, line: 683, type: !128, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !71, line: 688, type: !128, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !71, line: 691, type: !167, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !71, line: 839, type: !63, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !71, line: 840, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 22)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !71, line: 841, type: !191, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !71, line: 862, type: !135, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !71, line: 868, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 71)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !71, line: 875, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 51)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !71, line: 877, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 12)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !151, isLocal: true, isDefinition: true)
!240 = !{!241, !242, !243, !246, !248, !249, !250, !254, !255, !256, !257, !259, !312, !313, !314, !316, !317}
!241 = !DILocalVariable(name: "program", arg: 1, scope: !70, file: !71, line: 573, type: !74)
!242 = !DILocalVariable(name: "option", arg: 2, scope: !70, file: !71, line: 573, type: !74)
!243 = !DILocalVariable(name: "term", scope: !244, file: !71, line: 585, type: !74)
!244 = distinct !DILexicalBlock(scope: !245, file: !71, line: 582, column: 5)
!245 = distinct !DILexicalBlock(scope: !70, file: !71, line: 581, column: 7)
!246 = !DILocalVariable(name: "double_space", scope: !70, file: !71, line: 594, type: !247)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DILocalVariable(name: "first_word", scope: !70, file: !71, line: 595, type: !74)
!249 = !DILocalVariable(name: "option_text", scope: !70, file: !71, line: 596, type: !74)
!250 = !DILocalVariable(name: "s", scope: !251, file: !71, line: 608, type: !74)
!251 = distinct !DILexicalBlock(scope: !252, file: !71, line: 605, column: 5)
!252 = distinct !DILexicalBlock(scope: !253, file: !71, line: 604, column: 12)
!253 = distinct !DILexicalBlock(scope: !70, file: !71, line: 597, column: 7)
!254 = !DILocalVariable(name: "spaces", scope: !251, file: !71, line: 609, type: !119)
!255 = !DILocalVariable(name: "anchor_len", scope: !70, file: !71, line: 620, type: !119)
!256 = !DILocalVariable(name: "desc_text", scope: !70, file: !71, line: 625, type: !74)
!257 = !DILocalVariable(name: "__ptr", scope: !258, file: !71, line: 644, type: !74)
!258 = distinct !DILexicalBlock(scope: !70, file: !71, line: 644, column: 3)
!259 = !DILocalVariable(name: "__stream", scope: !258, file: !71, line: 644, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !283, !284, !285, !289, !290, !292, !293, !296, !298, !301, !304, !305, !306, !307, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !117, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !124, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !124, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !124, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !124, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !124, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !124, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !124, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !124, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !124, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !124, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !124, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !282, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !117, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !117, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !287, line: 152, baseType: !288)
!287 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!288 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !118, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !41, size: 8, offset: 1048)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !287, line: 153, baseType: !288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !299, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !302, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !282, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !116, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !119, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !117, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !309, size: 160, offset: 1568)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 20)
!312 = !DILocalVariable(name: "__cnt", scope: !258, file: !71, line: 644, type: !119)
!313 = !DILocalVariable(name: "url_program", scope: !70, file: !71, line: 648, type: !74)
!314 = !DILocalVariable(name: "__ptr", scope: !315, file: !71, line: 686, type: !74)
!315 = distinct !DILexicalBlock(scope: !70, file: !71, line: 686, column: 3)
!316 = !DILocalVariable(name: "__stream", scope: !315, file: !71, line: 686, type: !260)
!317 = !DILocalVariable(name: "__cnt", scope: !315, file: !71, line: 686, type: !119)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !320, line: 3, type: !191, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Version", scope: !323, file: !320, line: 3, type: !74, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C11, file: !320, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!324 = !{!318, !321}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "file_name", scope: !327, file: !328, line: 45, type: !74, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C11, file: !328, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!329 = !{!330, !332, !334, !336, !325, !338}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !162, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !328, line: 121, type: !235, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !328, line: 123, type: !162, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !328, line: 126, type: !151, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !327, file: !328, line: 55, type: !247, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !342, file: !343, line: 66, type: !394, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !343, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!344 = !{!116, !122}
!345 = !{!346, !348, !373, !375, !377, !379, !340, !381, !383, !385, !387, !392}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !343, line: 272, type: !128, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "old_file_name", scope: !350, file: !343, line: 304, type: !74, isLocal: true, isDefinition: true)
!350 = distinct !DISubprogram(name: "verror_at_line", scope: !343, file: !343, line: 298, type: !351, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !366)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !117, !117, !74, !80, !74, !353}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !354, line: 52, baseType: !355)
!354 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !356, line: 14, baseType: !357)
!356 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !358, baseType: !359)
!358 = !DIFile(filename: "lib/error.c", directory: "/src")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !360)
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !359, file: !358, baseType: !116, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !359, file: !358, baseType: !116, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !359, file: !358, baseType: !116, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !359, file: !358, baseType: !117, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !359, file: !358, baseType: !117, size: 32, offset: 224)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DILocalVariable(name: "status", arg: 1, scope: !350, file: !343, line: 298, type: !117)
!368 = !DILocalVariable(name: "errnum", arg: 2, scope: !350, file: !343, line: 298, type: !117)
!369 = !DILocalVariable(name: "file_name", arg: 3, scope: !350, file: !343, line: 298, type: !74)
!370 = !DILocalVariable(name: "line_number", arg: 4, scope: !350, file: !343, line: 298, type: !80)
!371 = !DILocalVariable(name: "message", arg: 5, scope: !350, file: !343, line: 298, type: !74)
!372 = !DILocalVariable(name: "args", arg: 6, scope: !350, file: !343, line: 298, type: !353)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "old_line_number", scope: !350, file: !343, line: 305, type: !80, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !343, line: 338, type: !135, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !167, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !343, line: 346, type: !142, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "error_message_count", scope: !342, file: !343, line: 69, type: !80, isLocal: false, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !342, file: !343, line: 295, type: !117, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !162, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !343, line: 208, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 21)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !343, line: 214, type: !128, isLocal: true, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !399, line: 60, type: !142, isLocal: true, isDefinition: true)
!399 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "long_options", scope: !402, file: !399, line: 34, type: !410, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C11, file: !399, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !403, splitDebugInlining: false, nameTableKind: None)
!403 = !{!397, !404, !406, !408, !400}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !399, line: 112, type: !41, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !399, line: 36, type: !128, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !399, line: 37, type: !167, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 768, elements: !152)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !413, line: 50, size: 256, elements: !414)
!413 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!414 = !{!415, !416, !417, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !413, line: 52, baseType: !74, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !412, file: !413, line: 55, baseType: !117, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !413, line: 56, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !412, file: !413, line: 57, baseType: !117, size: 32, offset: 192)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "program_name", scope: !422, file: !423, line: 31, type: !74, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C11, file: !423, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !424, globals: !425, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!424 = !{!124}
!425 = !{!420, !426, !428}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !423, line: 46, type: !167, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !423, line: 49, type: !135, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "utf07FF", scope: !432, file: !433, line: 46, type: !460, isLocal: true, isDefinition: true)
!432 = distinct !DISubprogram(name: "proper_name_lite", scope: !433, file: !433, line: 38, type: !434, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !436, retainedNodes: !438)
!433 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!434 = !DISubroutineType(types: !435)
!435 = !{!74, !74, !74}
!436 = distinct !DICompileUnit(language: DW_LANG_C11, file: !433, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !437, splitDebugInlining: false, nameTableKind: None)
!437 = !{!430}
!438 = !{!439, !440, !441, !442, !447}
!439 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !432, file: !433, line: 38, type: !74)
!440 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !432, file: !433, line: 38, type: !74)
!441 = !DILocalVariable(name: "translation", scope: !432, file: !433, line: 40, type: !74)
!442 = !DILocalVariable(name: "w", scope: !432, file: !433, line: 47, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !444, line: 37, baseType: !445)
!444 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !287, line: 57, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !287, line: 42, baseType: !80)
!447 = !DILocalVariable(name: "mbs", scope: !432, file: !433, line: 48, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !450)
!449 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !452)
!451 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !452, file: !451, line: 15, baseType: !117, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !452, file: !451, line: 20, baseType: !456, size: 32, offset: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !451, line: 16, size: 32, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !456, file: !451, line: 18, baseType: !80, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !456, file: !451, line: 19, baseType: !135, size: 32)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !143)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !463, line: 78, type: !167, isLocal: true, isDefinition: true)
!463 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !463, line: 79, type: !26, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !463, line: 80, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 13)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !463, line: 81, type: !468, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !463, line: 82, type: !309, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !463, line: 83, type: !142, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !463, line: 84, type: !167, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !463, line: 85, type: !162, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !463, line: 86, type: !162, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !463, line: 87, type: !167, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !487, file: !463, line: 76, type: !559, isLocal: false, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C11, file: !463, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !488, retainedTypes: !494, globals: !495, splitDebugInlining: false, nameTableKind: None)
!488 = !{!101, !489, !86}
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !102, line: 254, baseType: !80, size: 32, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!492 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!493 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!494 = !{!117, !118, !119}
!495 = !{!461, !464, !466, !471, !473, !475, !477, !479, !481, !483, !485, !496, !500, !510, !512, !517, !519, !521, !523, !525, !548, !555, !557}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !487, file: !463, line: 92, type: !498, isLocal: false, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !47)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !487, file: !463, line: 1040, type: !502, isLocal: false, isDefinition: true)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !463, line: 56, size: 448, elements: !503)
!503 = !{!504, !505, !506, !508, !509}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !502, file: !463, line: 59, baseType: !101, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !463, line: 62, baseType: !117, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !502, file: !463, line: 66, baseType: !507, size: 256, offset: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 256, elements: !168)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !502, file: !463, line: 69, baseType: !74, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !502, file: !463, line: 72, baseType: !74, size: 64, offset: 384)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !487, file: !463, line: 107, type: !502, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "slot0", scope: !487, file: !463, line: 831, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 256)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !463, line: 321, type: !142, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !463, line: 357, type: !142, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !463, line: 358, type: !142, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !463, line: 199, type: !162, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "quote", scope: !527, file: !463, line: 228, type: !546, isLocal: true, isDefinition: true)
!527 = distinct !DISubprogram(name: "gettext_quote", scope: !463, file: !463, line: 197, type: !528, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !487, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!74, !74, !101}
!530 = !{!531, !532, !533, !534, !535}
!531 = !DILocalVariable(name: "msgid", arg: 1, scope: !527, file: !463, line: 197, type: !74)
!532 = !DILocalVariable(name: "s", arg: 2, scope: !527, file: !463, line: 197, type: !101)
!533 = !DILocalVariable(name: "translation", scope: !527, file: !463, line: 199, type: !74)
!534 = !DILocalVariable(name: "w", scope: !527, file: !463, line: 229, type: !443)
!535 = !DILocalVariable(name: "mbs", scope: !527, file: !463, line: 230, type: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !538, file: !451, line: 15, baseType: !117, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !538, file: !451, line: 20, baseType: !542, size: 32, offset: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !538, file: !451, line: 16, size: 32, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !542, file: !451, line: 18, baseType: !80, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !542, file: !451, line: 19, baseType: !135, size: 32)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !547)
!547 = !{!144, !137}
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "slotvec", scope: !487, file: !463, line: 834, type: !550, isLocal: true, isDefinition: true)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !463, line: 823, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !551, file: !463, line: 825, baseType: !119, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !551, file: !463, line: 826, baseType: !124, size: 64, offset: 64)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "nslots", scope: !487, file: !463, line: 832, type: !117, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "slotvec0", scope: !487, file: !463, line: 833, type: !551, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 704, elements: !561)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!561 = !{!562}
!562 = !DISubrange(count: 11)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !565, line: 347, type: !19, isLocal: true, isDefinition: true)
!565 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !565, line: 398, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 9)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !565, line: 399, type: !142, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !565, line: 446, type: !162, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !565, line: 447, type: !41, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !579, line: 98, type: !580, isLocal: true, isDefinition: true)
!579 = !DIFile(filename: "./lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 29)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !579, line: 99, type: !580, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !579, line: 100, type: !389, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !579, line: 40, type: !468, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !579, line: 40, type: !151, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !593, line: 67, type: !235, isLocal: true, isDefinition: true)
!593 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !593, line: 69, type: !162, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !593, line: 83, type: !162, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !593, line: 83, type: !135, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !593, line: 85, type: !142, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !593, line: 88, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 171)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !593, line: 88, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 34)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !593, line: 105, type: !63, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !593, line: 109, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 23)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !593, line: 113, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 28)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !593, line: 120, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 32)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !593, line: 127, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 36)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !593, line: 134, type: !186, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !593, line: 142, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 44)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !593, line: 150, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 48)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !593, line: 159, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 52)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !593, line: 170, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 60)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !593, line: 248, type: !309, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !593, line: 248, type: !211, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !593, line: 254, type: !309, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !593, line: 254, type: !19, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !593, line: 254, type: !186, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !593, line: 259, type: !3, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !593, line: 259, type: !580, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !672, file: !673, line: 26, type: !675, isLocal: false, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !674, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!674 = !{!670}
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 47)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "exit_failure", scope: !680, file: !681, line: 24, type: !683, isLocal: false, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !682, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!682 = !{!678}
!683 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !686, line: 34, type: !151, isLocal: true, isDefinition: true)
!686 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !686, line: 34, type: !162, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !686, line: 34, type: !58, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !693, line: 108, type: !41, isLocal: true, isDefinition: true)
!693 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "internal_state", scope: !696, file: !693, line: 97, type: !699, isLocal: true, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !697, globals: !698, splitDebugInlining: false, nameTableKind: None)
!697 = !{!116, !119, !122}
!698 = !{!691, !694}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !449, line: 6, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !451, line: 21, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 64, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !701, file: !451, line: 15, baseType: !117, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !701, file: !451, line: 20, baseType: !705, size: 32, offset: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !701, file: !451, line: 16, size: 32, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !705, file: !451, line: 18, baseType: !80, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !705, file: !451, line: 19, baseType: !135, size: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !711, line: 35, type: !142, isLocal: true, isDefinition: true)
!711 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !711, line: 35, type: !26, isLocal: true, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !717, retainedTypes: !718, globals: !752, splitDebugInlining: false, nameTableKind: None)
!717 = !{!78}
!718 = !{!124, !116, !719, !750, !119}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !722, line: 55, size: 3200, elements: !723)
!722 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!723 = !{!724, !726, !728, !729, !730, !731, !732, !737, !738, !746, !749}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !721, file: !722, line: 57, baseType: !725, size: 16)
!725 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !721, file: !722, line: 58, baseType: !727, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !287, line: 154, baseType: !117)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !721, file: !722, line: 59, baseType: !626, size: 256, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !721, file: !722, line: 61, baseType: !135, size: 32, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !721, file: !722, line: 63, baseType: !626, size: 256, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !721, file: !722, line: 65, baseType: !514, size: 2048, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !721, file: !722, line: 67, baseType: !733, size: 32, offset: 2656)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !722, line: 42, size: 32, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !733, file: !722, line: 45, baseType: !725, size: 16)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !733, file: !722, line: 46, baseType: !725, size: 16, offset: 16)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !721, file: !722, line: 81, baseType: !288, size: 64, offset: 2688)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !721, file: !722, line: 82, baseType: !739, size: 128, offset: 2752)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !740, line: 8, size: 128, elements: !741)
!740 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!741 = !{!742, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !739, file: !740, line: 14, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !287, line: 160, baseType: !288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !739, file: !740, line: 15, baseType: !745, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !287, line: 162, baseType: !288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !721, file: !722, line: 84, baseType: !747, size: 128, offset: 2880)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !136)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !287, line: 41, baseType: !117)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !721, file: !722, line: 85, baseType: !309, size: 160, offset: 3008)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !751, line: 87, baseType: !288)
!751 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!752 = !{!563, !566, !571, !573, !575, !577, !583, !585, !587, !589}
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !593, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !754, retainedTypes: !758, globals: !759, splitDebugInlining: false, nameTableKind: None)
!754 = !{!755}
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !593, line: 40, baseType: !80, size: 32, elements: !756)
!756 = !{!757}
!757 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!758 = !{!116}
!759 = !{!591, !594, !596, !598, !600, !602, !607, !612, !614, !619, !624, !629, !634, !636, !641, !646, !651, !656, !658, !660, !662, !664, !666, !668}
!760 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !762, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!762 = !{!763, !775}
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !764, file: !761, line: 188, baseType: !80, size: 32, elements: !773)
!764 = distinct !DISubprogram(name: "x2nrealloc", scope: !761, file: !761, line: 176, type: !765, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !760, retainedNodes: !768)
!765 = !DISubroutineType(types: !766)
!766 = !{!116, !116, !767, !119}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!768 = !{!769, !770, !771, !772}
!769 = !DILocalVariable(name: "p", arg: 1, scope: !764, file: !761, line: 176, type: !116)
!770 = !DILocalVariable(name: "pn", arg: 2, scope: !764, file: !761, line: 176, type: !767)
!771 = !DILocalVariable(name: "s", arg: 3, scope: !764, file: !761, line: 176, type: !119)
!772 = !DILocalVariable(name: "n", scope: !764, file: !761, line: 178, type: !119)
!773 = !{!774}
!774 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !776, file: !761, line: 228, baseType: !80, size: 32, elements: !773)
!776 = distinct !DISubprogram(name: "xpalloc", scope: !761, file: !761, line: 223, type: !777, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !760, retainedNodes: !783)
!777 = !DISubroutineType(types: !778)
!778 = !{!116, !116, !779, !780, !782, !780}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !781, line: 130, baseType: !782)
!781 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !120, line: 35, baseType: !288)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792}
!784 = !DILocalVariable(name: "pa", arg: 1, scope: !776, file: !761, line: 223, type: !116)
!785 = !DILocalVariable(name: "pn", arg: 2, scope: !776, file: !761, line: 223, type: !779)
!786 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !776, file: !761, line: 223, type: !780)
!787 = !DILocalVariable(name: "n_max", arg: 4, scope: !776, file: !761, line: 223, type: !782)
!788 = !DILocalVariable(name: "s", arg: 5, scope: !776, file: !761, line: 223, type: !780)
!789 = !DILocalVariable(name: "n0", scope: !776, file: !761, line: 230, type: !780)
!790 = !DILocalVariable(name: "n", scope: !776, file: !761, line: 237, type: !780)
!791 = !DILocalVariable(name: "nbytes", scope: !776, file: !761, line: 248, type: !780)
!792 = !DILocalVariable(name: "adjusted_nbytes", scope: !776, file: !761, line: 252, type: !780)
!793 = !{!124, !116, !247, !288, !121}
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !686, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !795, splitDebugInlining: false, nameTableKind: None)
!795 = !{!684, !687, !689}
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!800 = distinct !DICompileUnit(language: DW_LANG_C11, file: !801, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!802 = distinct !DICompileUnit(language: DW_LANG_C11, file: !803, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!804 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !808, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!808 = !{!247, !121, !116}
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !810, splitDebugInlining: false, nameTableKind: None)
!810 = !{!709, !712}
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !758, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!815 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!816 = !{i32 7, !"Dwarf Version", i32 5}
!817 = !{i32 2, !"Debug Info Version", i32 3}
!818 = !{i32 1, !"wchar_size", i32 4}
!819 = !{i32 8, !"PIC Level", i32 2}
!820 = !{i32 7, !"PIE Level", i32 2}
!821 = !{i32 7, !"uwtable", i32 2}
!822 = !{i32 7, !"frame-pointer", i32 1}
!823 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 96, type: !824, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !117}
!826 = !{!827}
!827 = !DILocalVariable(name: "status", arg: 1, scope: !823, file: !2, line: 96, type: !117)
!828 = !DILocation(line: 0, scope: !823)
!829 = !DILocation(line: 98, column: 14, scope: !830)
!830 = distinct !DILexicalBlock(scope: !823, file: !2, line: 98, column: 7)
!831 = !DILocation(line: 98, column: 7, scope: !823)
!832 = !DILocation(line: 99, column: 5, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !2, line: 99, column: 5)
!834 = !{!835, !835, i64 0}
!835 = !{!"any pointer", !836, i64 0}
!836 = !{!"omnipotent char", !837, i64 0}
!837 = !{!"Simple C/C++ TBAA"}
!838 = !DILocation(line: 102, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !830, file: !2, line: 101, column: 5)
!840 = !DILocation(line: 103, column: 7, scope: !839)
!841 = !DILocation(line: 109, column: 7, scope: !839)
!842 = !DILocation(line: 110, column: 7, scope: !839)
!843 = !DILocalVariable(name: "program", arg: 1, scope: !844, file: !71, line: 836, type: !74)
!844 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !71, file: !71, line: 836, type: !845, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !74}
!847 = !{!843, !848, !855, !856, !858, !859}
!848 = !DILocalVariable(name: "infomap", scope: !844, file: !71, line: 838, type: !849)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 896, elements: !163)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !844, file: !71, line: 838, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !851, file: !71, line: 838, baseType: !74, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !851, file: !71, line: 838, baseType: !74, size: 64, offset: 64)
!855 = !DILocalVariable(name: "node", scope: !844, file: !71, line: 848, type: !74)
!856 = !DILocalVariable(name: "map_prog", scope: !844, file: !71, line: 849, type: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!858 = !DILocalVariable(name: "lc_messages", scope: !844, file: !71, line: 861, type: !74)
!859 = !DILocalVariable(name: "url_program", scope: !844, file: !71, line: 874, type: !74)
!860 = !DILocation(line: 0, scope: !844, inlinedAt: !861)
!861 = distinct !DILocation(line: 111, column: 7, scope: !839)
!862 = !DILocation(line: 857, column: 3, scope: !844, inlinedAt: !861)
!863 = !DILocation(line: 861, column: 29, scope: !844, inlinedAt: !861)
!864 = !DILocation(line: 862, column: 7, scope: !865, inlinedAt: !861)
!865 = distinct !DILexicalBlock(scope: !844, file: !71, line: 862, column: 7)
!866 = !DILocation(line: 862, column: 19, scope: !865, inlinedAt: !861)
!867 = !DILocation(line: 862, column: 22, scope: !865, inlinedAt: !861)
!868 = !DILocation(line: 862, column: 7, scope: !844, inlinedAt: !861)
!869 = !DILocation(line: 868, column: 7, scope: !870, inlinedAt: !861)
!870 = distinct !DILexicalBlock(scope: !865, file: !71, line: 863, column: 5)
!871 = !DILocation(line: 870, column: 5, scope: !870, inlinedAt: !861)
!872 = !DILocation(line: 875, column: 3, scope: !844, inlinedAt: !861)
!873 = !DILocation(line: 877, column: 3, scope: !844, inlinedAt: !861)
!874 = !DILocation(line: 113, column: 3, scope: !823)
!875 = !DISubprogram(name: "dcgettext", scope: !876, file: !876, line: 51, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!876 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!877 = !DISubroutineType(types: !878)
!878 = !{!124, !74, !74, !117}
!879 = !{}
!880 = !DISubprogram(name: "__fprintf_chk", scope: !881, file: !881, line: 93, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!881 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!882 = !DISubroutineType(types: !883)
!883 = !{!117, !884, !117, !885, null}
!884 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!885 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!886 = !DISubprogram(name: "__printf_chk", scope: !881, file: !881, line: 95, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!887 = !DISubroutineType(types: !888)
!888 = !{!117, !117, !885, null}
!889 = !DILocation(line: 0, scope: !70)
!890 = !DILocation(line: 581, column: 7, scope: !245)
!891 = !{!892, !892, i64 0}
!892 = !{!"int", !836, i64 0}
!893 = !DILocation(line: 581, column: 19, scope: !245)
!894 = !DILocation(line: 581, column: 7, scope: !70)
!895 = !DILocation(line: 585, column: 26, scope: !244)
!896 = !DILocation(line: 0, scope: !244)
!897 = !DILocation(line: 586, column: 23, scope: !244)
!898 = !DILocation(line: 586, column: 28, scope: !244)
!899 = !DILocation(line: 586, column: 32, scope: !244)
!900 = !{!836, !836, i64 0}
!901 = !DILocation(line: 586, column: 38, scope: !244)
!902 = !DILocalVariable(name: "__s1", arg: 1, scope: !903, file: !904, line: 1359, type: !74)
!903 = distinct !DISubprogram(name: "streq", scope: !904, file: !904, line: 1359, type: !905, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !907)
!904 = !DIFile(filename: "./lib/string.h", directory: "/src")
!905 = !DISubroutineType(types: !906)
!906 = !{!247, !74, !74}
!907 = !{!902, !908}
!908 = !DILocalVariable(name: "__s2", arg: 2, scope: !903, file: !904, line: 1359, type: !74)
!909 = !DILocation(line: 0, scope: !903, inlinedAt: !910)
!910 = distinct !DILocation(line: 586, column: 41, scope: !244)
!911 = !DILocation(line: 1361, column: 11, scope: !903, inlinedAt: !910)
!912 = !DILocation(line: 1361, column: 10, scope: !903, inlinedAt: !910)
!913 = !DILocation(line: 586, column: 19, scope: !244)
!914 = !DILocation(line: 587, column: 5, scope: !244)
!915 = !DILocation(line: 588, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !70, file: !71, line: 588, column: 7)
!917 = !DILocation(line: 588, column: 7, scope: !70)
!918 = !DILocation(line: 590, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !916, file: !71, line: 589, column: 5)
!920 = !DILocation(line: 591, column: 7, scope: !919)
!921 = !DILocation(line: 595, column: 37, scope: !70)
!922 = !DILocation(line: 595, column: 35, scope: !70)
!923 = !DILocation(line: 596, column: 29, scope: !70)
!924 = !DILocation(line: 597, column: 8, scope: !253)
!925 = !DILocation(line: 597, column: 7, scope: !70)
!926 = !DILocation(line: 604, column: 24, scope: !252)
!927 = !DILocation(line: 604, column: 12, scope: !253)
!928 = !DILocation(line: 0, scope: !251)
!929 = !DILocation(line: 610, column: 16, scope: !251)
!930 = !DILocation(line: 610, column: 7, scope: !251)
!931 = !DILocation(line: 611, column: 21, scope: !251)
!932 = !{!933, !933, i64 0}
!933 = !{!"short", !836, i64 0}
!934 = !DILocation(line: 611, column: 19, scope: !251)
!935 = !DILocation(line: 611, column: 16, scope: !251)
!936 = !DILocation(line: 610, column: 30, scope: !251)
!937 = distinct !{!937, !930, !931, !938}
!938 = !{!"llvm.loop.mustprogress"}
!939 = !DILocation(line: 612, column: 18, scope: !940)
!940 = distinct !DILexicalBlock(scope: !251, file: !71, line: 612, column: 11)
!941 = !DILocation(line: 612, column: 11, scope: !251)
!942 = !DILocation(line: 620, column: 23, scope: !70)
!943 = !DILocation(line: 625, column: 39, scope: !70)
!944 = !DILocation(line: 626, column: 3, scope: !70)
!945 = !DILocation(line: 626, column: 10, scope: !70)
!946 = !DILocation(line: 626, column: 21, scope: !70)
!947 = !DILocation(line: 628, column: 44, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !71, line: 628, column: 11)
!949 = distinct !DILexicalBlock(scope: !70, file: !71, line: 627, column: 5)
!950 = !DILocation(line: 628, column: 32, scope: !948)
!951 = !DILocation(line: 628, column: 49, scope: !948)
!952 = !DILocation(line: 628, column: 11, scope: !949)
!953 = !DILocation(line: 630, column: 11, scope: !954)
!954 = distinct !DILexicalBlock(scope: !949, file: !71, line: 630, column: 11)
!955 = !DILocation(line: 630, column: 11, scope: !949)
!956 = !DILocation(line: 632, column: 26, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !71, line: 632, column: 15)
!958 = distinct !DILexicalBlock(scope: !954, file: !71, line: 631, column: 9)
!959 = !DILocation(line: 632, column: 34, scope: !957)
!960 = !DILocation(line: 632, column: 37, scope: !957)
!961 = !DILocation(line: 632, column: 15, scope: !958)
!962 = !DILocation(line: 640, column: 16, scope: !949)
!963 = distinct !{!963, !944, !964, !938}
!964 = !DILocation(line: 641, column: 5, scope: !70)
!965 = !DILocation(line: 644, column: 3, scope: !70)
!966 = !DILocation(line: 0, scope: !903, inlinedAt: !967)
!967 = distinct !DILocation(line: 648, column: 31, scope: !70)
!968 = !DILocation(line: 0, scope: !903, inlinedAt: !969)
!969 = distinct !DILocation(line: 649, column: 31, scope: !70)
!970 = !DILocation(line: 0, scope: !903, inlinedAt: !971)
!971 = distinct !DILocation(line: 650, column: 31, scope: !70)
!972 = !DILocation(line: 0, scope: !903, inlinedAt: !973)
!973 = distinct !DILocation(line: 651, column: 31, scope: !70)
!974 = !DILocation(line: 0, scope: !903, inlinedAt: !975)
!975 = distinct !DILocation(line: 652, column: 31, scope: !70)
!976 = !DILocation(line: 0, scope: !903, inlinedAt: !977)
!977 = distinct !DILocation(line: 653, column: 31, scope: !70)
!978 = !DILocation(line: 0, scope: !903, inlinedAt: !979)
!979 = distinct !DILocation(line: 654, column: 31, scope: !70)
!980 = !DILocation(line: 0, scope: !903, inlinedAt: !981)
!981 = distinct !DILocation(line: 655, column: 31, scope: !70)
!982 = !DILocation(line: 0, scope: !903, inlinedAt: !983)
!983 = distinct !DILocation(line: 656, column: 31, scope: !70)
!984 = !DILocation(line: 0, scope: !903, inlinedAt: !985)
!985 = distinct !DILocation(line: 657, column: 31, scope: !70)
!986 = !DILocation(line: 663, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !70, file: !71, line: 663, column: 7)
!988 = !DILocation(line: 664, column: 7, scope: !987)
!989 = !DILocation(line: 664, column: 10, scope: !987)
!990 = !DILocation(line: 663, column: 7, scope: !70)
!991 = !DILocation(line: 669, column: 7, scope: !992)
!992 = distinct !DILexicalBlock(scope: !987, file: !71, line: 665, column: 5)
!993 = !DILocation(line: 671, column: 5, scope: !992)
!994 = !DILocation(line: 676, column: 7, scope: !995)
!995 = distinct !DILexicalBlock(scope: !987, file: !71, line: 673, column: 5)
!996 = !DILocation(line: 679, column: 3, scope: !70)
!997 = !DILocation(line: 683, column: 3, scope: !70)
!998 = !DILocation(line: 686, column: 3, scope: !70)
!999 = !DILocation(line: 688, column: 3, scope: !70)
!1000 = !DILocation(line: 691, column: 3, scope: !70)
!1001 = !DILocation(line: 695, column: 3, scope: !70)
!1002 = !DILocation(line: 696, column: 1, scope: !70)
!1003 = !DISubprogram(name: "setlocale", scope: !1004, file: !1004, line: 122, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1004 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!124, !117, !74}
!1007 = !DISubprogram(name: "strncmp", scope: !1008, file: !1008, line: 159, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1008 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!117, !74, !74, !119}
!1011 = !DISubprogram(name: "fputs_unlocked", scope: !354, file: !354, line: 691, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!117, !885, !884}
!1014 = !DISubprogram(name: "exit", scope: !1015, file: !1015, line: 624, type: !824, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1015 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1016 = !DISubprogram(name: "getenv", scope: !1015, file: !1015, line: 641, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!124, !74}
!1019 = !DISubprogram(name: "strcmp", scope: !1008, file: !1008, line: 156, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!117, !74, !74}
!1022 = !DISubprogram(name: "strspn", scope: !1008, file: !1008, line: 297, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!121, !74, !74}
!1025 = !DISubprogram(name: "strchr", scope: !1008, file: !1008, line: 246, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!124, !74, !117}
!1028 = !DISubprogram(name: "__ctype_b_loc", scope: !87, file: !87, line: 79, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1034 = !DISubprogram(name: "strcspn", scope: !1008, file: !1008, line: 293, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1035 = !DISubprogram(name: "fwrite_unlocked", scope: !354, file: !354, line: 704, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!119, !1038, !119, !119, !884}
!1038 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1041 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 117, type: !1042, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1044)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!117, !117, !123}
!1044 = !{!1045, !1046}
!1045 = !DILocalVariable(name: "argc", arg: 1, scope: !1041, file: !2, line: 117, type: !117)
!1046 = !DILocalVariable(name: "argv", arg: 2, scope: !1041, file: !2, line: 117, type: !123)
!1047 = !DILocation(line: 0, scope: !1041)
!1048 = !DILocation(line: 120, column: 21, scope: !1041)
!1049 = !DILocation(line: 120, column: 3, scope: !1041)
!1050 = !DILocation(line: 121, column: 3, scope: !1041)
!1051 = !DILocation(line: 122, column: 3, scope: !1041)
!1052 = !DILocation(line: 123, column: 3, scope: !1041)
!1053 = !DILocation(line: 125, column: 3, scope: !1041)
!1054 = !DILocation(line: 128, column: 36, scope: !1041)
!1055 = !DILocation(line: 128, column: 58, scope: !1041)
!1056 = !DILocation(line: 127, column: 3, scope: !1041)
!1057 = !DILocation(line: 131, column: 18, scope: !1041)
!1058 = !DILocation(line: 131, column: 16, scope: !1041)
!1059 = !DILocation(line: 131, column: 3, scope: !1041)
!1060 = !DILocation(line: 134, column: 7, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 132, column: 5)
!1062 = !DILocation(line: 135, column: 7, scope: !1061)
!1063 = !DILocation(line: 138, column: 14, scope: !1061)
!1064 = !DILocation(line: 138, column: 7, scope: !1061)
!1065 = !DILocation(line: 139, column: 7, scope: !1061)
!1066 = !DILocation(line: 142, column: 7, scope: !1061)
!1067 = !DILocation(line: 143, column: 7, scope: !1061)
!1068 = !DILocation(line: 146, column: 3, scope: !1041)
!1069 = !DISubprogram(name: "bindtextdomain", scope: !876, file: !876, line: 86, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!124, !74, !74}
!1072 = !DISubprogram(name: "textdomain", scope: !876, file: !876, line: 82, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1073 = !DISubprogram(name: "atexit", scope: !1015, file: !1015, line: 602, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!117, !394}
!1076 = distinct !DISubprogram(name: "users", scope: !2, file: !2, line: 82, type: !1077, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1079)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !74, !117}
!1079 = !{!1080, !1081, !1082, !1083}
!1080 = !DILocalVariable(name: "filename", arg: 1, scope: !1076, file: !2, line: 82, type: !74)
!1081 = !DILocalVariable(name: "options", arg: 2, scope: !1076, file: !2, line: 82, type: !117)
!1082 = !DILocalVariable(name: "n_users", scope: !1076, file: !2, line: 84, type: !780)
!1083 = !DILocalVariable(name: "utmp_buf", scope: !1076, file: !2, line: 85, type: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !79, line: 92, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !79, line: 65, size: 576, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1099, !1102, !1103, !1104}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1086, file: !79, line: 69, baseType: !124, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1086, file: !79, line: 70, baseType: !124, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1086, file: !79, line: 71, baseType: !124, size: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1086, file: !79, line: 72, baseType: !124, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !1086, file: !79, line: 74, baseType: !1093, size: 128, offset: 256)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1094, line: 11, size: 128, elements: !1095)
!1094 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1093, file: !1094, line: 16, baseType: !743, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1093, file: !1094, line: 21, baseType: !1098, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !287, line: 197, baseType: !288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1086, file: !79, line: 75, baseType: !1100, size: 32, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1101, line: 97, baseType: !727)
!1101 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1086, file: !79, line: 76, baseType: !1100, size: 32, offset: 416)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1086, file: !79, line: 77, baseType: !725, size: 16, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1086, file: !79, line: 79, baseType: !1105, size: 64, offset: 480)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1086, file: !79, line: 79, size: 64, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1105, file: !79, line: 79, baseType: !117, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1105, file: !79, line: 79, baseType: !117, size: 32, offset: 32)
!1109 = !DILocation(line: 0, scope: !1076)
!1110 = !DILocation(line: 84, column: 3, scope: !1076)
!1111 = !DILocation(line: 85, column: 3, scope: !1076)
!1112 = !DILocation(line: 86, column: 11, scope: !1076)
!1113 = !DILocation(line: 87, column: 7, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1076, file: !2, line: 87, column: 7)
!1115 = !DILocation(line: 87, column: 58, scope: !1114)
!1116 = !DILocation(line: 87, column: 7, scope: !1076)
!1117 = !DILocation(line: 88, column: 5, scope: !1114)
!1118 = !DILocation(line: 90, column: 23, scope: !1076)
!1119 = !{!1120, !1120, i64 0}
!1120 = !{!"long", !836, i64 0}
!1121 = !DILocation(line: 90, column: 32, scope: !1076)
!1122 = !DILocalVariable(name: "n", arg: 1, scope: !1123, file: !2, line: 45, type: !780)
!1123 = distinct !DISubprogram(name: "list_entries_users", scope: !2, file: !2, line: 45, type: !1124, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1128)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !780, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1128 = !{!1122, !1129, !1130, !1131, !1132, !1136, !1138, !1141}
!1129 = !DILocalVariable(name: "this", arg: 2, scope: !1123, file: !2, line: 45, type: !1126)
!1130 = !DILocalVariable(name: "u", scope: !1123, file: !2, line: 47, type: !123)
!1131 = !DILocalVariable(name: "n_entries", scope: !1123, file: !2, line: 48, type: !780)
!1132 = !DILocalVariable(name: "trimmed_name", scope: !1133, file: !2, line: 54, type: !124)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 53, column: 9)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !2, line: 52, column: 11)
!1135 = distinct !DILexicalBlock(scope: !1123, file: !2, line: 51, column: 5)
!1136 = !DILocalVariable(name: "i", scope: !1137, file: !2, line: 66, type: !780)
!1137 = distinct !DILexicalBlock(scope: !1123, file: !2, line: 66, column: 3)
!1138 = !DILocalVariable(name: "c", scope: !1139, file: !2, line: 68, type: !4)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 67, column: 5)
!1140 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 66, column: 3)
!1141 = !DILocalVariable(name: "i", scope: !1142, file: !2, line: 73, type: !780)
!1142 = distinct !DILexicalBlock(scope: !1123, file: !2, line: 73, column: 3)
!1143 = !DILocation(line: 0, scope: !1123, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 90, column: 3, scope: !1076)
!1145 = !DILocation(line: 47, column: 14, scope: !1123, inlinedAt: !1144)
!1146 = !DILocation(line: 50, column: 3, scope: !1123, inlinedAt: !1144)
!1147 = !DILocation(line: 64, column: 3, scope: !1123, inlinedAt: !1144)
!1148 = !DILocation(line: 0, scope: !1137, inlinedAt: !1144)
!1149 = !DILocation(line: 66, column: 3, scope: !1137, inlinedAt: !1144)
!1150 = !DILocation(line: 50, column: 11, scope: !1123, inlinedAt: !1144)
!1151 = !DILocation(line: 52, column: 11, scope: !1134, inlinedAt: !1144)
!1152 = !{!1153, !835, i64 0}
!1153 = !{!"gl_utmp", !835, i64 0, !835, i64 8, !835, i64 16, !835, i64 24, !1154, i64 32, !892, i64 48, !892, i64 52, !933, i64 56, !1155, i64 60}
!1154 = !{!"timespec", !1120, i64 0, !1120, i64 8}
!1155 = !{!"", !892, i64 0, !892, i64 4}
!1156 = !{!1153, !933, i64 56}
!1157 = !DILocation(line: 52, column: 11, scope: !1135, inlinedAt: !1144)
!1158 = !DILocation(line: 56, column: 26, scope: !1133, inlinedAt: !1144)
!1159 = !DILocation(line: 0, scope: !1133, inlinedAt: !1144)
!1160 = !DILocation(line: 58, column: 11, scope: !1133, inlinedAt: !1144)
!1161 = !DILocation(line: 58, column: 24, scope: !1133, inlinedAt: !1144)
!1162 = !DILocation(line: 59, column: 11, scope: !1133, inlinedAt: !1144)
!1163 = !DILocation(line: 60, column: 9, scope: !1133, inlinedAt: !1144)
!1164 = !DILocation(line: 61, column: 11, scope: !1135, inlinedAt: !1144)
!1165 = distinct !{!1165, !1146, !1166, !938}
!1166 = !DILocation(line: 62, column: 5, scope: !1123, inlinedAt: !1144)
!1167 = !DILocation(line: 66, column: 23, scope: !1140, inlinedAt: !1144)
!1168 = !DILocation(line: 68, column: 19, scope: !1139, inlinedAt: !1144)
!1169 = !DILocation(line: 0, scope: !1139, inlinedAt: !1144)
!1170 = !DILocation(line: 69, column: 7, scope: !1139, inlinedAt: !1144)
!1171 = !DILocation(line: 70, column: 7, scope: !1139, inlinedAt: !1144)
!1172 = !DILocalVariable(name: "__c", arg: 1, scope: !1173, file: !1174, line: 108, type: !117)
!1173 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1174, file: !1174, line: 108, type: !1175, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1177)
!1174 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!117, !117}
!1177 = !{!1172}
!1178 = !DILocation(line: 0, scope: !1173, inlinedAt: !1179)
!1179 = distinct !DILocation(line: 70, column: 7, scope: !1139, inlinedAt: !1144)
!1180 = !DILocation(line: 110, column: 10, scope: !1173, inlinedAt: !1179)
!1181 = !{!1182, !835, i64 40}
!1182 = !{!"_IO_FILE", !892, i64 0, !835, i64 8, !835, i64 16, !835, i64 24, !835, i64 32, !835, i64 40, !835, i64 48, !835, i64 56, !835, i64 64, !835, i64 72, !835, i64 80, !835, i64 88, !835, i64 96, !835, i64 104, !892, i64 112, !892, i64 116, !1120, i64 120, !933, i64 128, !836, i64 130, !836, i64 131, !835, i64 136, !1120, i64 144, !835, i64 152, !835, i64 160, !835, i64 168, !835, i64 176, !1120, i64 184, !892, i64 192, !836, i64 196}
!1183 = !{!1182, !835, i64 48}
!1184 = !{!"branch_weights", i32 2000, i32 1}
!1185 = !DILocation(line: 66, column: 37, scope: !1140, inlinedAt: !1144)
!1186 = distinct !{!1186, !1149, !1187, !938}
!1187 = !DILocation(line: 71, column: 5, scope: !1137, inlinedAt: !1144)
!1188 = !DILocation(line: 0, scope: !1142, inlinedAt: !1144)
!1189 = !DILocation(line: 74, column: 11, scope: !1190, inlinedAt: !1144)
!1190 = distinct !DILexicalBlock(scope: !1142, file: !2, line: 73, column: 3)
!1191 = !DILocation(line: 74, column: 5, scope: !1190, inlinedAt: !1144)
!1192 = !DILocation(line: 73, column: 37, scope: !1190, inlinedAt: !1144)
!1193 = !DILocation(line: 73, column: 23, scope: !1190, inlinedAt: !1144)
!1194 = !DILocation(line: 73, column: 3, scope: !1142, inlinedAt: !1144)
!1195 = distinct !{!1195, !1194, !1196, !938}
!1196 = !DILocation(line: 74, column: 15, scope: !1142, inlinedAt: !1144)
!1197 = !DILocation(line: 75, column: 3, scope: !1123, inlinedAt: !1144)
!1198 = !DILocation(line: 92, column: 9, scope: !1076)
!1199 = !DILocation(line: 92, column: 3, scope: !1076)
!1200 = !DILocation(line: 93, column: 1, scope: !1076)
!1201 = !DISubprogram(name: "__errno_location", scope: !1202, file: !1202, line: 37, type: !1203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1202 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!418}
!1205 = distinct !DISubprogram(name: "userid_compare", scope: !2, file: !2, line: 37, type: !1206, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !1208)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!117, !1039, !1039}
!1208 = !{!1209, !1210, !1211, !1212}
!1209 = !DILocalVariable(name: "v_a", arg: 1, scope: !1205, file: !2, line: 37, type: !1039)
!1210 = !DILocalVariable(name: "v_b", arg: 2, scope: !1205, file: !2, line: 37, type: !1039)
!1211 = !DILocalVariable(name: "a", scope: !1205, file: !2, line: 39, type: !123)
!1212 = !DILocalVariable(name: "b", scope: !1205, file: !2, line: 40, type: !123)
!1213 = !DILocation(line: 0, scope: !1205)
!1214 = !DILocation(line: 41, column: 18, scope: !1205)
!1215 = !DILocation(line: 41, column: 22, scope: !1205)
!1216 = !DILocation(line: 41, column: 10, scope: !1205)
!1217 = !DILocation(line: 41, column: 3, scope: !1205)
!1218 = !DISubprogram(name: "qsort", scope: !1015, file: !1015, line: 838, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !116, !119, !119, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1015, line: 816, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1223 = !DISubprogram(name: "__overflow", scope: !354, file: !354, line: 886, type: !1224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!117, !260, !117}
!1226 = !DISubprogram(name: "free", scope: !1015, file: !1015, line: 555, type: !1227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !116}
!1229 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !328, file: !328, line: 50, type: !845, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1230)
!1230 = !{!1231}
!1231 = !DILocalVariable(name: "file", arg: 1, scope: !1229, file: !328, line: 50, type: !74)
!1232 = !DILocation(line: 0, scope: !1229)
!1233 = !DILocation(line: 52, column: 13, scope: !1229)
!1234 = !DILocation(line: 53, column: 1, scope: !1229)
!1235 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !328, file: !328, line: 87, type: !1236, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1238)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !247}
!1238 = !{!1239}
!1239 = !DILocalVariable(name: "ignore", arg: 1, scope: !1235, file: !328, line: 87, type: !247)
!1240 = !DILocation(line: 0, scope: !1235)
!1241 = !DILocation(line: 89, column: 16, scope: !1235)
!1242 = !{!1243, !1243, i64 0}
!1243 = !{!"_Bool", !836, i64 0}
!1244 = !DILocation(line: 90, column: 1, scope: !1235)
!1245 = distinct !DISubprogram(name: "close_stdout", scope: !328, file: !328, line: 116, type: !395, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !1246)
!1246 = !{!1247}
!1247 = !DILocalVariable(name: "write_error", scope: !1248, file: !328, line: 121, type: !74)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !328, line: 120, column: 5)
!1249 = distinct !DILexicalBlock(scope: !1245, file: !328, line: 118, column: 7)
!1250 = !DILocation(line: 118, column: 21, scope: !1249)
!1251 = !DILocation(line: 118, column: 7, scope: !1249)
!1252 = !DILocation(line: 118, column: 29, scope: !1249)
!1253 = !DILocation(line: 119, column: 7, scope: !1249)
!1254 = !DILocation(line: 119, column: 12, scope: !1249)
!1255 = !{i8 0, i8 2}
!1256 = !DILocation(line: 119, column: 25, scope: !1249)
!1257 = !DILocation(line: 119, column: 28, scope: !1249)
!1258 = !DILocation(line: 119, column: 34, scope: !1249)
!1259 = !DILocation(line: 118, column: 7, scope: !1245)
!1260 = !DILocation(line: 121, column: 33, scope: !1248)
!1261 = !DILocation(line: 0, scope: !1248)
!1262 = !DILocation(line: 122, column: 11, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1248, file: !328, line: 122, column: 11)
!1264 = !DILocation(line: 0, scope: !1263)
!1265 = !DILocation(line: 122, column: 11, scope: !1248)
!1266 = !DILocation(line: 123, column: 9, scope: !1263)
!1267 = !DILocation(line: 126, column: 9, scope: !1263)
!1268 = !DILocation(line: 128, column: 14, scope: !1248)
!1269 = !DILocation(line: 128, column: 7, scope: !1248)
!1270 = !DILocation(line: 133, column: 42, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1245, file: !328, line: 133, column: 7)
!1272 = !DILocation(line: 133, column: 28, scope: !1271)
!1273 = !DILocation(line: 133, column: 50, scope: !1271)
!1274 = !DILocation(line: 133, column: 7, scope: !1245)
!1275 = !DILocation(line: 134, column: 12, scope: !1271)
!1276 = !DILocation(line: 134, column: 5, scope: !1271)
!1277 = !DILocation(line: 135, column: 1, scope: !1245)
!1278 = !DISubprogram(name: "_exit", scope: !1279, file: !1279, line: 624, type: !824, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1279 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1280 = distinct !DISubprogram(name: "verror", scope: !343, file: !343, line: 251, type: !1281, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1283)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !117, !117, !74, !353}
!1283 = !{!1284, !1285, !1286, !1287}
!1284 = !DILocalVariable(name: "status", arg: 1, scope: !1280, file: !343, line: 251, type: !117)
!1285 = !DILocalVariable(name: "errnum", arg: 2, scope: !1280, file: !343, line: 251, type: !117)
!1286 = !DILocalVariable(name: "message", arg: 3, scope: !1280, file: !343, line: 251, type: !74)
!1287 = !DILocalVariable(name: "args", arg: 4, scope: !1280, file: !343, line: 251, type: !353)
!1288 = !DILocation(line: 0, scope: !1280)
!1289 = !DILocation(line: 251, column: 1, scope: !1280)
!1290 = !DILocation(line: 261, column: 3, scope: !1280)
!1291 = !DILocation(line: 265, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1280, file: !343, line: 265, column: 7)
!1293 = !DILocation(line: 265, column: 7, scope: !1280)
!1294 = !DILocation(line: 266, column: 5, scope: !1292)
!1295 = !DILocation(line: 272, column: 7, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1292, file: !343, line: 268, column: 5)
!1297 = !DILocation(line: 276, column: 3, scope: !1280)
!1298 = !{i64 0, i64 8, !834, i64 8, i64 8, !834, i64 16, i64 8, !834, i64 24, i64 4, !891, i64 28, i64 4, !891}
!1299 = !DILocation(line: 282, column: 1, scope: !1280)
!1300 = distinct !DISubprogram(name: "flush_stdout", scope: !343, file: !343, line: 163, type: !395, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1301)
!1301 = !{!1302}
!1302 = !DILocalVariable(name: "stdout_fd", scope: !1300, file: !343, line: 166, type: !117)
!1303 = !DILocation(line: 0, scope: !1300)
!1304 = !DILocalVariable(name: "fd", arg: 1, scope: !1305, file: !343, line: 145, type: !117)
!1305 = distinct !DISubprogram(name: "is_open", scope: !343, file: !343, line: 145, type: !1175, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1306)
!1306 = !{!1304}
!1307 = !DILocation(line: 0, scope: !1305, inlinedAt: !1308)
!1308 = distinct !DILocation(line: 182, column: 25, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1300, file: !343, line: 182, column: 7)
!1310 = !DILocation(line: 157, column: 15, scope: !1305, inlinedAt: !1308)
!1311 = !DILocation(line: 157, column: 12, scope: !1305, inlinedAt: !1308)
!1312 = !DILocation(line: 182, column: 7, scope: !1300)
!1313 = !DILocation(line: 184, column: 5, scope: !1309)
!1314 = !DILocation(line: 185, column: 1, scope: !1300)
!1315 = distinct !DISubprogram(name: "error_tail", scope: !343, file: !343, line: 219, type: !1281, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1316)
!1316 = !{!1317, !1318, !1319, !1320}
