; ModuleID = 'src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.Tokens = type { i64, ptr, ptr, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.fstatus = type { i32, %struct.stat }
%struct.wc_lines = type { i32, i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.argv_iterator = type { ptr, i64, ptr, i64, ptr, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct._obstack_chunk = type { ptr, ptr, [0 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!173 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !59, !64, !69, !74, !79, !84, !174, !179, !184, !189, !194, !199, !201, !206, !211, !216, !221, !223, !228, !233, !425, !430, !432, !437, !439, !444, !449, !451, !453, !455, !457, !462, !464, !466, !471, !473, !475, !477, !479, !481, !483, !485, !489, !491, !493, !495, !497, !499, !501, !89, !503, !505, !510, !540, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !570, !572, !574, !576, !578, !580, !582, !584, !586, !591, !593, !598, !600, !602, !604, !606, !608, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643, !655, !659, !661, !663, !665, !667, !671, !673, !675, !709, !711, !716, !721, !724, !726, !728, !730, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !773, !775}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 6)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 848, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 14)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 11)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !176, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 17)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 52)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !218, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 27)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 906, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 31)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "stdin_only", scope: !235, file: !2, line: 921, type: !424, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 792, type: !236, scopeLine: 793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !239)
!236 = !DISubroutineType(types: !237)
!237 = !{!101, !101, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!239 = !{!240, !241, !242, !243, !248, !249, !250, !293, !353, !356, !359, !360, !363, !415, !416, !417, !418, !419, !421}
!240 = !DILocalVariable(name: "argc", arg: 1, scope: !235, file: !2, line: 792, type: !101)
!241 = !DILocalVariable(name: "argv", arg: 2, scope: !235, file: !2, line: 792, type: !238)
!242 = !DILocalVariable(name: "optc", scope: !235, file: !2, line: 794, type: !101)
!243 = !DILocalVariable(name: "nfiles", scope: !235, file: !2, line: 795, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !245, line: 130, baseType: !246)
!245 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !167, line: 35, baseType: !247)
!247 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!248 = !DILocalVariable(name: "files", scope: !235, file: !2, line: 796, type: !238)
!249 = !DILocalVariable(name: "files_from", scope: !235, file: !2, line: 797, type: !164)
!250 = !DILocalVariable(name: "fstatus", scope: !235, file: !2, line: 798, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !2, line: 85, size: 1088, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !252, file: !2, line: 89, baseType: !101, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !252, file: !2, line: 92, baseType: !256, size: 1024, offset: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !257, line: 44, size: 1024, elements: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!258 = !{!259, !262, !264, !266, !268, !270, !272, !273, !274, !276, !278, !279, !281, !289, !290, !291}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 46, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !261, line: 145, baseType: !168)
!261 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 47, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !261, line: 148, baseType: !168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !256, file: !257, line: 48, baseType: !265, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !261, line: 150, baseType: !94)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !256, file: !257, line: 49, baseType: !267, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !261, line: 151, baseType: !94)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !256, file: !257, line: 50, baseType: !269, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !261, line: 146, baseType: !94)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !256, file: !257, line: 51, baseType: !271, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !261, line: 147, baseType: !94)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !256, file: !257, line: 52, baseType: !260, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !256, file: !257, line: 53, baseType: !260, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !256, file: !257, line: 54, baseType: !275, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 152, baseType: !247)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !256, file: !257, line: 55, baseType: !277, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !261, line: 175, baseType: !101)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !256, file: !257, line: 56, baseType: !101, size: 32, offset: 480)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !256, file: !257, line: 57, baseType: !280, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !261, line: 180, baseType: !247)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !256, file: !257, line: 65, baseType: !282, size: 128, offset: 576)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !283, line: 11, size: 128, elements: !284)
!283 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!284 = !{!285, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !282, file: !283, line: 16, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !261, line: 160, baseType: !247)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !282, file: !283, line: 21, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !261, line: 197, baseType: !247)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !256, file: !257, line: 66, baseType: !282, size: 128, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !256, file: !257, line: 67, baseType: !282, size: 128, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !256, file: !257, line: 79, baseType: !292, size: 64, offset: 960)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !219)
!293 = !DILocalVariable(name: "tok", scope: !235, file: !2, line: 799, type: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !295, line: 32, size: 2304, elements: !296)
!295 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!296 = !{!297, !298, !299, !301, !351, !352}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !294, file: !295, line: 34, baseType: !166, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !294, file: !295, line: 35, baseType: !238, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !294, file: !295, line: 36, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !294, file: !295, line: 37, baseType: !302, size: 704, offset: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !303, line: 210, size: 704, elements: !304)
!303 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!304 = !{!305, !306, !316, !317, !318, !319, !324, !325, !336, !347, !348, !349, !350}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !302, file: !303, line: 212, baseType: !166, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !302, file: !303, line: 213, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !303, line: 203, size: 128, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !308, file: !303, line: 205, baseType: !164, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !308, file: !303, line: 206, baseType: !307, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !308, file: !303, line: 207, baseType: !313, offset: 128)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: -1)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !302, file: !303, line: 214, baseType: !164, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !302, file: !303, line: 215, baseType: !164, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !302, file: !303, line: 216, baseType: !164, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !302, file: !303, line: 221, baseType: !320, size: 64, offset: 320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 217, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !320, file: !303, line: 219, baseType: !166, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !320, file: !303, line: 220, baseType: !161, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !302, file: !303, line: 222, baseType: !166, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !302, file: !303, line: 229, baseType: !326, size: 64, offset: 448)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 225, size: 64, elements: !327)
!327 = !{!328, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !326, file: !303, line: 227, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!161, !166}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !326, file: !303, line: 228, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!161, !161, !166}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !302, file: !303, line: 234, baseType: !337, size: 64, offset: 512)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !303, line: 230, size: 64, elements: !338)
!338 = !{!339, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !337, file: !303, line: 232, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !161}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !337, file: !303, line: 233, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !161, !161}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !302, file: !303, line: 236, baseType: !161, size: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !302, file: !303, line: 237, baseType: !94, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !302, file: !303, line: 238, baseType: !94, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !302, file: !303, line: 242, baseType: !94, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !294, file: !295, line: 38, baseType: !302, size: 704, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !294, file: !295, line: 39, baseType: !302, size: 704, offset: 1600)
!353 = !DILocalVariable(name: "i", scope: !354, file: !2, line: 864, type: !101)
!354 = distinct !DILexicalBlock(scope: !355, file: !2, line: 864, column: 5)
!355 = distinct !DILexicalBlock(scope: !235, file: !2, line: 863, column: 7)
!356 = !DILocalVariable(name: "i", scope: !357, file: !2, line: 867, type: !101)
!357 = distinct !DILexicalBlock(scope: !358, file: !2, line: 867, column: 5)
!358 = distinct !DILexicalBlock(scope: !235, file: !2, line: 866, column: 7)
!359 = !DILocalVariable(name: "read_tokens", scope: !235, file: !2, line: 870, type: !172)
!360 = !DILocalVariable(name: "ai", scope: !235, file: !2, line: 871, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !141, line: 32, flags: DIFlagFwdDecl)
!363 = !DILocalVariable(name: "stream", scope: !364, file: !2, line: 874, type: !366)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 873, column: 5)
!365 = distinct !DILexicalBlock(scope: !235, file: !2, line: 872, column: 7)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !368, line: 7, baseType: !369)
!368 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !370, line: 49, size: 1728, elements: !371)
!370 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !387, !389, !390, !391, !392, !393, !395, !396, !399, !401, !404, !407, !408, !409, !410, !411}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !369, file: !370, line: 51, baseType: !101, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !369, file: !370, line: 54, baseType: !164, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !369, file: !370, line: 55, baseType: !164, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !369, file: !370, line: 56, baseType: !164, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !369, file: !370, line: 57, baseType: !164, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !369, file: !370, line: 58, baseType: !164, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !369, file: !370, line: 59, baseType: !164, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !369, file: !370, line: 60, baseType: !164, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !369, file: !370, line: 61, baseType: !164, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !369, file: !370, line: 64, baseType: !164, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !369, file: !370, line: 65, baseType: !164, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !369, file: !370, line: 66, baseType: !164, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !369, file: !370, line: 68, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !370, line: 36, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !369, file: !370, line: 70, baseType: !388, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !369, file: !370, line: 72, baseType: !101, size: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !369, file: !370, line: 73, baseType: !101, size: 32, offset: 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !369, file: !370, line: 74, baseType: !275, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !369, file: !370, line: 77, baseType: !165, size: 16, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !369, file: !370, line: 78, baseType: !394, size: 8, offset: 1040)
!394 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !369, file: !370, line: 79, baseType: !76, size: 8, offset: 1048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !369, file: !370, line: 81, baseType: !397, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !370, line: 43, baseType: null)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !369, file: !370, line: 89, baseType: !400, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 153, baseType: !247)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !369, file: !370, line: 91, baseType: !402, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !370, line: 37, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !369, file: !370, line: 92, baseType: !405, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !370, line: 38, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !369, file: !370, line: 93, baseType: !388, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !369, file: !370, line: 94, baseType: !161, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !369, file: !370, line: 95, baseType: !166, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !369, file: !370, line: 96, baseType: !101, size: 32, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !369, file: !370, line: 98, baseType: !412, size: 160, offset: 1568)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 20)
!415 = !DILocalVariable(name: "st", scope: !364, file: !2, line: 898, type: !256)
!416 = !DILocalVariable(name: "ok", scope: !235, file: !2, line: 936, type: !172)
!417 = !DILocalVariable(name: "ai_err", scope: !235, file: !2, line: 937, type: !140)
!418 = !DILocalVariable(name: "file_name", scope: !235, file: !2, line: 938, type: !164)
!419 = !DILocalVariable(name: "i", scope: !420, file: !2, line: 939, type: !101)
!420 = distinct !DILexicalBlock(scope: !235, file: !2, line: 939, column: 3)
!421 = !DILocalVariable(name: "skip_file", scope: !422, file: !2, line: 941, type: !172)
!422 = distinct !DILexicalBlock(scope: !423, file: !2, line: 940, column: 5)
!423 = distinct !DILexicalBlock(scope: !420, file: !2, line: 939, column: 3)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !77)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 946, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 72)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !24, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 30)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !196, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 15)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 12)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1017, type: !446, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1023, type: !203, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1029, type: !446, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1035, type: !181, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "wc_isprint", scope: !91, file: !2, line: 51, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2048, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 256)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "wc_isspace", scope: !91, file: !2, line: 52, type: !459, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "debug", scope: !91, file: !2, line: 54, type: !172, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "total_lines", scope: !91, file: !2, line: 58, type: !468, isLocal: true, isDefinition: true)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !469, line: 102, baseType: !470)
!469 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !261, line: 73, baseType: !168)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "total_words", scope: !91, file: !2, line: 59, type: !468, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "total_chars", scope: !91, file: !2, line: 60, type: !468, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "total_bytes", scope: !91, file: !2, line: 61, type: !468, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !91, file: !2, line: 62, type: !172, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !91, file: !2, line: 63, type: !172, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !91, file: !2, line: 64, type: !172, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !91, file: !2, line: 65, type: !172, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "max_line_length", scope: !91, file: !2, line: 66, type: !487, isLocal: true, isDefinition: true)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !469, line: 101, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !261, line: 72, baseType: !247)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "print_lines", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "print_words", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "print_chars", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "print_bytes", scope: !91, file: !2, line: 69, type: !172, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "print_linelength", scope: !91, file: !2, line: 70, type: !172, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "number_width", scope: !91, file: !2, line: 73, type: !101, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !91, file: !2, line: 76, type: !172, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !91, file: !2, line: 82, type: !172, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !100, line: 729, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 56)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !512, file: !100, line: 575, type: !101, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "oputs_", scope: !100, file: !100, line: 573, type: !513, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !515)
!513 = !DISubroutineType(cc: DW_CC_nocall, types: !514)
!514 = !{null, !169, !169}
!515 = !{!516, !517, !518, !521, !522, !523, !524, !528, !529, !530, !531, !533, !534, !535, !536, !538, !539}
!516 = !DILocalVariable(name: "program", arg: 1, scope: !512, file: !100, line: 573, type: !169)
!517 = !DILocalVariable(name: "option", arg: 2, scope: !512, file: !100, line: 573, type: !169)
!518 = !DILocalVariable(name: "term", scope: !519, file: !100, line: 585, type: !169)
!519 = distinct !DILexicalBlock(scope: !520, file: !100, line: 582, column: 5)
!520 = distinct !DILexicalBlock(scope: !512, file: !100, line: 581, column: 7)
!521 = !DILocalVariable(name: "double_space", scope: !512, file: !100, line: 594, type: !172)
!522 = !DILocalVariable(name: "first_word", scope: !512, file: !100, line: 595, type: !169)
!523 = !DILocalVariable(name: "option_text", scope: !512, file: !100, line: 596, type: !169)
!524 = !DILocalVariable(name: "s", scope: !525, file: !100, line: 608, type: !169)
!525 = distinct !DILexicalBlock(scope: !526, file: !100, line: 605, column: 5)
!526 = distinct !DILexicalBlock(scope: !527, file: !100, line: 604, column: 12)
!527 = distinct !DILexicalBlock(scope: !512, file: !100, line: 597, column: 7)
!528 = !DILocalVariable(name: "spaces", scope: !525, file: !100, line: 609, type: !166)
!529 = !DILocalVariable(name: "anchor_len", scope: !512, file: !100, line: 620, type: !166)
!530 = !DILocalVariable(name: "desc_text", scope: !512, file: !100, line: 625, type: !169)
!531 = !DILocalVariable(name: "__ptr", scope: !532, file: !100, line: 644, type: !169)
!532 = distinct !DILexicalBlock(scope: !512, file: !100, line: 644, column: 3)
!533 = !DILocalVariable(name: "__stream", scope: !532, file: !100, line: 644, type: !366)
!534 = !DILocalVariable(name: "__cnt", scope: !532, file: !100, line: 644, type: !166)
!535 = !DILocalVariable(name: "url_program", scope: !512, file: !100, line: 648, type: !169)
!536 = !DILocalVariable(name: "__ptr", scope: !537, file: !100, line: 686, type: !169)
!537 = distinct !DILexicalBlock(scope: !512, file: !100, line: 686, column: 3)
!538 = !DILocalVariable(name: "__stream", scope: !537, file: !100, line: 686, type: !366)
!539 = !DILocalVariable(name: "__cnt", scope: !537, file: !100, line: 686, type: !166)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !100, line: 585, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 5)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !100, line: 586, type: !542, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !100, line: 595, type: !208, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !100, line: 620, type: !181, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !218, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !100, line: 648, type: !542, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !208, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !100, line: 649, type: !24, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !100, line: 650, type: !542, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !181, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !100, line: 651, type: !181, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !100, line: 652, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 7)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !100, line: 653, type: !186, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !100, line: 654, type: !81, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !100, line: 655, type: !81, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !100, line: 656, type: !81, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !100, line: 657, type: !81, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !100, line: 663, type: !567, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !100, line: 664, type: !81, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !203, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !100, line: 669, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 40)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !441, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !100, line: 676, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 61)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !100, line: 679, type: !24, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !100, line: 683, type: !542, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !100, line: 688, type: !542, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !100, line: 691, type: !186, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !100, line: 839, type: !176, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !100, line: 840, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 22)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !100, line: 841, type: !441, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !100, line: 862, type: !208, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !100, line: 868, type: !9, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !100, line: 875, type: !225, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !34, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !100, line: 877, type: !446, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !181, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !181, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !181, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !181, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !181, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !446, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !176, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !542, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !186, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "longopts", scope: !91, file: !2, line: 104, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 2816, elements: !197)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !648, line: 50, size: 256, elements: !649)
!648 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!649 = !{!650, !651, !652, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !648, line: 52, baseType: !169, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !647, file: !648, line: 55, baseType: !101, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !648, line: 56, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !647, file: !648, line: 57, baseType: !101, size: 32, offset: 192)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "total_types", scope: !91, file: !2, line: 130, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 128, elements: !209)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !542, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !567, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !542, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !181, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "total_args", scope: !91, file: !2, line: 126, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 320, elements: !543)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "total_mode", scope: !91, file: !2, line: 135, type: !134, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 378, type: !441, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "use_neon", scope: !677, file: !2, line: 322, type: !394, isLocal: true, isDefinition: true)
!677 = distinct !DISubprogram(name: "wc_lines", scope: !2, file: !2, line: 305, type: !678, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !686)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !101}
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wc_lines", file: !681, line: 2, size: 192, elements: !682)
!681 = !DIFile(filename: "src/wc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f73f6c91eb8849cde32b7f2c7fc10330")
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !680, file: !681, line: 2, baseType: !101, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !680, file: !681, line: 2, baseType: !487, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !680, file: !681, line: 2, baseType: !487, size: 64, offset: 128)
!686 = !{!687, !688, !689, !690, !691, !696, !700, !701, !702, !706}
!687 = !DILocalVariable(name: "fd", arg: 1, scope: !677, file: !2, line: 305, type: !101)
!688 = !DILocalVariable(name: "lines", scope: !677, file: !2, line: 329, type: !487)
!689 = !DILocalVariable(name: "bytes", scope: !677, file: !2, line: 329, type: !487)
!690 = !DILocalVariable(name: "long_lines", scope: !677, file: !2, line: 330, type: !172)
!691 = !DILocalVariable(name: "buf", scope: !692, file: !2, line: 334, type: !693)
!692 = distinct !DILexicalBlock(scope: !677, file: !2, line: 333, column: 5)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097160, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 262145)
!696 = !DILocalVariable(name: "bytes_read", scope: !692, file: !2, line: 335, type: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !698, line: 77, baseType: !699)
!698 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !261, line: 194, baseType: !247)
!700 = !DILocalVariable(name: "end", scope: !692, file: !2, line: 340, type: !164)
!701 = !DILocalVariable(name: "buflines", scope: !692, file: !2, line: 341, type: !244)
!702 = !DILocalVariable(name: "p", scope: !703, file: !2, line: 346, type: !164)
!703 = distinct !DILexicalBlock(scope: !704, file: !2, line: 346, column: 11)
!704 = distinct !DILexicalBlock(scope: !705, file: !2, line: 344, column: 9)
!705 = distinct !DILexicalBlock(scope: !692, file: !2, line: 343, column: 11)
!706 = !DILocalVariable(name: "p", scope: !707, file: !2, line: 353, type: !164)
!707 = distinct !DILexicalBlock(scope: !708, file: !2, line: 353, column: 11)
!708 = distinct !DILexicalBlock(scope: !705, file: !2, line: 350, column: 9)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !181, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 28)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 26)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !723, line: 68, type: !208, isLocal: true, isDefinition: true)
!723 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !723, line: 68, type: !542, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !723, line: 69, type: !542, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !723, line: 69, type: !181, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !723, line: 70, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 9)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !723, line: 70, type: !81, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !723, line: 71, type: !186, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !723, line: 71, type: !732, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !723, line: 72, type: !567, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !723, line: 72, type: !196, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !723, line: 73, type: !196, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !723, line: 73, type: !446, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !723, line: 75, type: !567, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !723, line: 76, type: !181, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !723, line: 76, type: !567, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !757, file: !2, line: 268, type: !772, isLocal: true, isDefinition: true)
!757 = distinct !DISubprogram(name: "write_counts", scope: !2, file: !2, line: 261, type: !758, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !468, !468, !468, !468, !487, !169}
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768}
!761 = !DILocalVariable(name: "lines", arg: 1, scope: !757, file: !2, line: 261, type: !468)
!762 = !DILocalVariable(name: "words", arg: 2, scope: !757, file: !2, line: 262, type: !468)
!763 = !DILocalVariable(name: "chars", arg: 3, scope: !757, file: !2, line: 263, type: !468)
!764 = !DILocalVariable(name: "bytes", arg: 4, scope: !757, file: !2, line: 264, type: !468)
!765 = !DILocalVariable(name: "linelength", arg: 5, scope: !757, file: !2, line: 265, type: !487)
!766 = !DILocalVariable(name: "file", arg: 6, scope: !757, file: !2, line: 266, type: !169)
!767 = !DILocalVariable(name: "format_int", scope: !757, file: !2, line: 269, type: !169)
!768 = !DILocalVariable(name: "buf", scope: !757, file: !2, line: 270, type: !769)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 21)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 40, elements: !543)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !208, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !100, line: 952, type: !446, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!778 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!779 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!780 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!781 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!782 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!783 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !786, line: 3, type: !441, isLocal: true, isDefinition: true)
!786 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "Version", scope: !789, file: !786, line: 3, type: !169, isLocal: false, isDefinition: true)
!789 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !790, splitDebugInlining: false, nameTableKind: None)
!790 = !{!784, !787}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !793, file: !794, line: 65, type: !813, isLocal: false, isDefinition: true)
!793 = distinct !DICompileUnit(language: DW_LANG_C11, file: !794, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !795, retainedTypes: !796, globals: !797, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!795 = !{!120}
!796 = !{!161, !169, !171}
!797 = !{!791, !798, !800, !802, !807, !809, !811}
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !794, line: 141, type: !567, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !794, line: 141, type: !225, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !794, line: 142, type: !804, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 29)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !794, line: 160, type: !769, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !794, line: 165, type: !186, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !794, line: 170, type: !542, isLocal: true, isDefinition: true)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !814, line: 69, baseType: !815)
!814 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "file_name", scope: !820, file: !821, line: 45, type: !169, isLocal: true, isDefinition: true)
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !822, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!822 = !{!823, !825, !827, !829, !818, !831}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !821, line: 121, type: !567, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !821, line: 121, type: !446, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !821, line: 123, type: !567, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !821, line: 126, type: !24, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !820, file: !821, line: 55, type: !172, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !835, file: !836, line: 25, type: !172, isLocal: false, isDefinition: true)
!835 = distinct !DICompileUnit(language: DW_LANG_C11, file: !836, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !837, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!837 = !{!833, !838, !853, !855, !860}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "hwcaps", scope: !840, file: !836, line: 45, type: !169, isLocal: true, isDefinition: true)
!840 = distinct !DISubprogram(name: "hwcap_allowed", scope: !836, file: !836, line: 28, type: !841, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !835, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!172, !169}
!843 = !{!844, !845, !850, !851, !852}
!844 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !840, file: !836, line: 28, type: !169)
!845 = !DILocalVariable(name: "tunables_start", scope: !846, file: !836, line: 50, type: !169)
!846 = distinct !DILexicalBlock(scope: !847, file: !836, line: 49, column: 9)
!847 = distinct !DILexicalBlock(scope: !848, file: !836, line: 48, column: 11)
!848 = distinct !DILexicalBlock(scope: !849, file: !836, line: 47, column: 5)
!849 = distinct !DILexicalBlock(scope: !840, file: !836, line: 46, column: 7)
!850 = !DILocalVariable(name: "last_hwcaps", scope: !846, file: !836, line: 51, type: !169)
!851 = !DILocalVariable(name: "sentinel", scope: !840, file: !836, line: 67, type: !169)
!852 = !DILocalVariable(name: "cap", scope: !840, file: !836, line: 70, type: !169)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !836, line: 48, type: !441, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !836, line: 52, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 18)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !836, line: 55, type: !76, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !864, file: !865, line: 66, type: !815, isLocal: false, isDefinition: true)
!864 = distinct !DICompileUnit(language: DW_LANG_C11, file: !865, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !866, globals: !867, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!866 = !{!161, !171}
!867 = !{!868, !870, !894, !896, !898, !900, !862, !902, !904, !906, !908, !910}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !865, line: 272, type: !542, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "old_file_name", scope: !872, file: !865, line: 304, type: !169, isLocal: true, isDefinition: true)
!872 = distinct !DISubprogram(name: "verror_at_line", scope: !865, file: !865, line: 298, type: !873, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !864, retainedNodes: !887)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !101, !101, !169, !94, !169, !875}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !698, line: 52, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !877, line: 14, baseType: !878)
!877 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !879, baseType: !880)
!879 = !DIFile(filename: "lib/error.c", directory: "/src")
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !881)
!881 = !{!882, !883, !884, !885, !886}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !880, file: !879, baseType: !161, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !880, file: !879, baseType: !161, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !880, file: !879, baseType: !161, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !880, file: !879, baseType: !101, size: 32, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !880, file: !879, baseType: !101, size: 32, offset: 224)
!887 = !{!888, !889, !890, !891, !892, !893}
!888 = !DILocalVariable(name: "status", arg: 1, scope: !872, file: !865, line: 298, type: !101)
!889 = !DILocalVariable(name: "errnum", arg: 2, scope: !872, file: !865, line: 298, type: !101)
!890 = !DILocalVariable(name: "file_name", arg: 3, scope: !872, file: !865, line: 298, type: !169)
!891 = !DILocalVariable(name: "line_number", arg: 4, scope: !872, file: !865, line: 298, type: !94)
!892 = !DILocalVariable(name: "message", arg: 5, scope: !872, file: !865, line: 298, type: !169)
!893 = !DILocalVariable(name: "args", arg: 6, scope: !872, file: !865, line: 298, type: !875)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "old_line_number", scope: !872, file: !865, line: 305, type: !94, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !865, line: 338, type: !208, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !865, line: 346, type: !186, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !865, line: 346, type: !218, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "error_message_count", scope: !864, file: !865, line: 69, type: !94, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !864, file: !865, line: 295, type: !101, isLocal: false, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !865, line: 208, type: !567, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !865, line: 208, type: !769, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !865, line: 214, type: !542, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !914, line: 108, type: !76, isLocal: true, isDefinition: true)
!914 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "internal_state", scope: !917, file: !914, line: 97, type: !920, isLocal: true, isDefinition: true)
!917 = distinct !DICompileUnit(language: DW_LANG_C11, file: !914, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !918, globals: !919, splitDebugInlining: false, nameTableKind: None)
!918 = !{!161, !166, !171}
!919 = !{!912, !915}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !921, line: 6, baseType: !922)
!921 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !923, line: 21, baseType: !924)
!923 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 13, size: 64, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !924, file: !923, line: 15, baseType: !101, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !924, file: !923, line: 20, baseType: !928, size: 32, offset: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !924, file: !923, line: 16, size: 32, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !928, file: !923, line: 18, baseType: !94, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !928, file: !923, line: 19, baseType: !208, size: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !934, line: 182, type: !191, isLocal: true, isDefinition: true)
!934 = !DIFile(filename: "lib/physmem.c", directory: "/src", checksumkind: CSK_MD5, checksum: "df355a32f7975afeeeba505b6287e039")
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !934, line: 205, type: !203, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !934, line: 209, type: !86, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "program_name", scope: !941, file: !942, line: 31, type: !169, isLocal: false, isDefinition: true)
!941 = distinct !DICompileUnit(language: DW_LANG_C11, file: !942, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !943, globals: !944, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!943 = !{!164}
!944 = !{!939, !945, !947}
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !942, line: 46, type: !186, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !942, line: 49, type: !208, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "utf07FF", scope: !951, file: !952, line: 46, type: !977, isLocal: true, isDefinition: true)
!951 = distinct !DISubprogram(name: "proper_name_lite", scope: !952, file: !952, line: 38, type: !953, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !955, retainedNodes: !957)
!952 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!953 = !DISubroutineType(types: !954)
!954 = !{!169, !169, !169}
!955 = distinct !DICompileUnit(language: DW_LANG_C11, file: !952, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !956, splitDebugInlining: false, nameTableKind: None)
!956 = !{!949}
!957 = !{!958, !959, !960, !961, !966}
!958 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !951, file: !952, line: 38, type: !169)
!959 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !951, file: !952, line: 38, type: !169)
!960 = !DILocalVariable(name: "translation", scope: !951, file: !952, line: 40, type: !169)
!961 = !DILocalVariable(name: "w", scope: !951, file: !952, line: 47, type: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !963, line: 37, baseType: !964)
!963 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !261, line: 57, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !261, line: 42, baseType: !94)
!966 = !DILocalVariable(name: "mbs", scope: !951, file: !952, line: 48, type: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !921, line: 6, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !923, line: 21, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 13, size: 64, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !969, file: !923, line: 15, baseType: !101, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !969, file: !923, line: 20, baseType: !973, size: 32, offset: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !969, file: !923, line: 16, size: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !973, file: !923, line: 18, baseType: !94, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !973, file: !923, line: 19, baseType: !208, size: 32)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 16, elements: !219)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !980, line: 78, type: !186, isLocal: true, isDefinition: true)
!980 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !980, line: 79, type: !181, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !980, line: 80, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 13)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !980, line: 81, type: !985, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !980, line: 82, type: !412, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !980, line: 83, type: !218, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !980, line: 84, type: !186, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !980, line: 85, type: !567, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !980, line: 86, type: !567, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !980, line: 87, type: !186, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1004, file: !980, line: 76, type: !1074, isLocal: false, isDefinition: true)
!1004 = distinct !DICompileUnit(language: DW_LANG_C11, file: !980, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1005, retainedTypes: !1011, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!1005 = !{!120, !1006, !105}
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !121, line: 254, baseType: !94, size: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010}
!1008 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1009 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1010 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1011 = !{!101, !165, !166}
!1012 = !{!978, !981, !983, !988, !990, !992, !994, !996, !998, !1000, !1002, !1013, !1017, !1027, !1029, !1032, !1034, !1036, !1038, !1040, !1063, !1070, !1072}
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1004, file: !980, line: 92, type: !1015, isLocal: false, isDefinition: true)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 320, elements: !82)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1004, file: !980, line: 1040, type: !1019, isLocal: false, isDefinition: true)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !980, line: 56, size: 448, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1025, !1026}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1019, file: !980, line: 59, baseType: !120, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1019, file: !980, line: 62, baseType: !101, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1019, file: !980, line: 66, baseType: !1024, size: 256, offset: 64)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !187)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1019, file: !980, line: 69, baseType: !169, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1019, file: !980, line: 72, baseType: !169, size: 64, offset: 384)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1004, file: !980, line: 107, type: !1019, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "slot0", scope: !1004, file: !980, line: 831, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !460)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !980, line: 321, type: !218, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !980, line: 357, type: !218, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !980, line: 358, type: !218, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !980, line: 199, type: !567, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "quote", scope: !1042, file: !980, line: 228, type: !1061, isLocal: true, isDefinition: true)
!1042 = distinct !DISubprogram(name: "gettext_quote", scope: !980, file: !980, line: 197, type: !1043, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1004, retainedNodes: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!169, !169, !120}
!1045 = !{!1046, !1047, !1048, !1049, !1050}
!1046 = !DILocalVariable(name: "msgid", arg: 1, scope: !1042, file: !980, line: 197, type: !169)
!1047 = !DILocalVariable(name: "s", arg: 2, scope: !1042, file: !980, line: 197, type: !120)
!1048 = !DILocalVariable(name: "translation", scope: !1042, file: !980, line: 199, type: !169)
!1049 = !DILocalVariable(name: "w", scope: !1042, file: !980, line: 229, type: !962)
!1050 = !DILocalVariable(name: "mbs", scope: !1042, file: !980, line: 230, type: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !921, line: 6, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !923, line: 21, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 13, size: 64, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1053, file: !923, line: 15, baseType: !101, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1053, file: !923, line: 20, baseType: !1057, size: 32, offset: 32)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1053, file: !923, line: 16, size: 32, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1057, file: !923, line: 18, baseType: !94, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1057, file: !923, line: 19, baseType: !208, size: 32)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !1062)
!1062 = !{!220, !210}
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "slotvec", scope: !1004, file: !980, line: 834, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !980, line: 823, size: 128, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !980, line: 825, baseType: !166, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1066, file: !980, line: 826, baseType: !164, size: 64, offset: 64)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "nslots", scope: !1004, file: !980, line: 832, type: !101, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1004, file: !980, line: 833, type: !1066, isLocal: true, isDefinition: true)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 704, elements: !197)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 67, type: !446, isLocal: true, isDefinition: true)
!1077 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 69, type: !567, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 83, type: !567, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 83, type: !208, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 85, type: !218, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 88, type: !1088, isLocal: true, isDefinition: true)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 171)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 88, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 34)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 105, type: !176, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 109, type: !1100, isLocal: true, isDefinition: true)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 23)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 113, type: !713, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 120, type: !1107, isLocal: true, isDefinition: true)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 32)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 127, type: !1112, isLocal: true, isDefinition: true)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 36)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 134, type: !588, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 142, type: !1119, isLocal: true, isDefinition: true)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 44)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 150, type: !1124, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 48)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 159, type: !213, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 170, type: !1131, isLocal: true, isDefinition: true)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 60)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 248, type: !412, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 248, type: !610, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 254, type: !412, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 254, type: !191, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 254, type: !588, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 259, type: !3, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(scope: null, file: !1077, line: 259, type: !804, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1150, file: !1151, line: 26, type: !1153, isLocal: false, isDefinition: true)
!1150 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1151, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1152, splitDebugInlining: false, nameTableKind: None)
!1151 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1152 = !{!1148}
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 376, elements: !1154)
!1154 = !{!1155}
!1155 = !DISubrange(count: 47)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 34, type: !24, isLocal: true, isDefinition: true)
!1158 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 34, type: !567, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !1158, line: 34, type: !203, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !1165, line: 35, type: !218, isLocal: true, isDefinition: true)
!1165 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(scope: null, file: !1165, line: 35, type: !181, isLocal: true, isDefinition: true)
!1168 = !DIGlobalVariableExpression(var: !1169, expr: !DIExpression())
!1169 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !1170, file: !1171, line: 53, type: !815, isLocal: false, isDefinition: true)
!1170 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1171, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1172, globals: !1173, splitDebugInlining: false, nameTableKind: None)
!1171 = !DIFile(filename: "lib/obstack.c", directory: "/src", checksumkind: CSK_MD5, checksum: "47f5bbc27e7c2d5a5cc3aab9403d8d27")
!1172 = !{!172, !161, !164, !168}
!1173 = !{!1168, !1174, !1176, !1178}
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1171, line: 353, type: !208, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1171, line: 353, type: !567, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1171, line: 353, type: !203, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1182, file: !1183, line: 24, type: !1185, isLocal: false, isDefinition: true)
!1182 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1183, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1184, splitDebugInlining: false, nameTableKind: None)
!1183 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1184 = !{!1180}
!1185 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !101)
!1186 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1187, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1188, retainedTypes: !1189, splitDebugInlining: false, nameTableKind: None)
!1187 = !DIFile(filename: "lib/argv-iter.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0e394449b22995c9f56acaf5026a67a")
!1188 = !{!140}
!1189 = !{!161}
!1190 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1191, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1192, splitDebugInlining: false, nameTableKind: None)
!1191 = !DIFile(filename: "lib/btowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a7b66f5e99f59c6c11b5045aee41d6bc")
!1192 = !{!166}
!1193 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1194, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1195, splitDebugInlining: false, nameTableKind: None)
!1194 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1195 = !{!147}
!1196 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1197, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1197 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1198 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1199, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1189, splitDebugInlining: false, nameTableKind: None)
!1199 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1200 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1201, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
