; ModuleID = 'src/who.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.anon = type { i32, i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }

!228 = distinct !DIGlobalVariable(name: "include_idle", scope: !130, file: !2, line: 107, type: !196, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "include_heading", scope: !130, file: !2, line: 110, type: !196, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "include_mesg", scope: !130, file: !2, line: 114, type: !196, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "include_exit", scope: !130, file: !2, line: 117, type: !196, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "need_boottime", scope: !130, file: !2, line: 120, type: !196, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !130, file: !2, line: 123, type: !196, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "need_login", scope: !130, file: !2, line: 126, type: !196, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !130, file: !2, line: 129, type: !196, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !130, file: !2, line: 132, type: !196, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !130, file: !2, line: 135, type: !196, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "need_users", scope: !130, file: !2, line: 138, type: !196, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "my_line_only", scope: !130, file: !2, line: 141, type: !196, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "time_format", scope: !130, file: !2, line: 145, type: !188, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "time_format_width", scope: !130, file: !2, line: 146, type: !138, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !257, file: !137, line: 575, type: !138, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "oputs_", scope: !137, file: !137, line: 573, type: !258, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !260)
!258 = !DISubroutineType(cc: DW_CC_nocall, types: !259)
!259 = !{null, !188, !188}
!260 = !{!261, !262, !263, !266, !267, !268, !269, !273, !274, !275, !276, !278, !329, !330, !331, !333, !334}
!261 = !DILocalVariable(name: "program", arg: 1, scope: !257, file: !137, line: 573, type: !188)
!262 = !DILocalVariable(name: "option", arg: 2, scope: !257, file: !137, line: 573, type: !188)
!263 = !DILocalVariable(name: "term", scope: !264, file: !137, line: 585, type: !188)
!264 = distinct !DILexicalBlock(scope: !265, file: !137, line: 582, column: 5)
!265 = distinct !DILexicalBlock(scope: !257, file: !137, line: 581, column: 7)
!266 = !DILocalVariable(name: "double_space", scope: !257, file: !137, line: 594, type: !196)
!267 = !DILocalVariable(name: "first_word", scope: !257, file: !137, line: 595, type: !188)
!268 = !DILocalVariable(name: "option_text", scope: !257, file: !137, line: 596, type: !188)
!269 = !DILocalVariable(name: "s", scope: !270, file: !137, line: 608, type: !188)
!270 = distinct !DILexicalBlock(scope: !271, file: !137, line: 605, column: 5)
!271 = distinct !DILexicalBlock(scope: !272, file: !137, line: 604, column: 12)
!272 = distinct !DILexicalBlock(scope: !257, file: !137, line: 597, column: 7)
!273 = !DILocalVariable(name: "spaces", scope: !270, file: !137, line: 609, type: !185)
!274 = !DILocalVariable(name: "anchor_len", scope: !257, file: !137, line: 620, type: !185)
!275 = !DILocalVariable(name: "desc_text", scope: !257, file: !137, line: 625, type: !188)
!276 = !DILocalVariable(name: "__ptr", scope: !277, file: !137, line: 644, type: !188)
!277 = distinct !DILexicalBlock(scope: !257, file: !137, line: 644, column: 3)
!278 = !DILocalVariable(name: "__stream", scope: !277, file: !137, line: 644, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 7, baseType: !282)
!281 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !283, line: 49, size: 1728, elements: !284)
!283 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !300, !302, !303, !304, !306, !307, !309, !310, !313, !315, !318, !321, !322, !323, !324, !325}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !282, file: !283, line: 51, baseType: !138, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !282, file: !283, line: 54, baseType: !182, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !282, file: !283, line: 55, baseType: !182, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !282, file: !283, line: 56, baseType: !182, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !282, file: !283, line: 57, baseType: !182, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !282, file: !283, line: 58, baseType: !182, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !282, file: !283, line: 59, baseType: !182, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !282, file: !283, line: 60, baseType: !182, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !282, file: !283, line: 61, baseType: !182, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !282, file: !283, line: 64, baseType: !182, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !282, file: !283, line: 65, baseType: !182, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !282, file: !283, line: 66, baseType: !182, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !282, file: !283, line: 68, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !283, line: 36, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !282, file: !283, line: 70, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !282, file: !283, line: 72, baseType: !138, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !282, file: !283, line: 73, baseType: !138, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !282, file: !283, line: 74, baseType: !305, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !194, line: 152, baseType: !195)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !282, file: !283, line: 77, baseType: !184, size: 16, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !282, file: !283, line: 78, baseType: !308, size: 8, offset: 1040)
!308 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !282, file: !283, line: 79, baseType: !110, size: 8, offset: 1048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !282, file: !283, line: 81, baseType: !311, size: 64, offset: 1088)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !283, line: 43, baseType: null)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !282, file: !283, line: 89, baseType: !314, size: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !194, line: 153, baseType: !195)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !282, file: !283, line: 91, baseType: !316, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !283, line: 37, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !282, file: !283, line: 92, baseType: !319, size: 64, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !283, line: 38, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !282, file: !283, line: 93, baseType: !301, size: 64, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !282, file: !283, line: 94, baseType: !183, size: 64, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !282, file: !283, line: 95, baseType: !185, size: 64, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !282, file: !283, line: 96, baseType: !138, size: 32, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !282, file: !283, line: 98, baseType: !326, size: 160, offset: 1568)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 20)
!329 = !DILocalVariable(name: "__cnt", scope: !277, file: !137, line: 644, type: !185)
!330 = !DILocalVariable(name: "url_program", scope: !257, file: !137, line: 648, type: !188)
!331 = !DILocalVariable(name: "__ptr", scope: !332, file: !137, line: 686, type: !188)
!332 = distinct !DILexicalBlock(scope: !257, file: !137, line: 686, column: 3)
!333 = !DILocalVariable(name: "__stream", scope: !332, file: !137, line: 686, type: !279)
!334 = !DILocalVariable(name: "__cnt", scope: !332, file: !137, line: 686, type: !185)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !137, line: 585, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 5)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !137, line: 586, type: !337, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !137, line: 595, type: !24, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !137, line: 620, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 6)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !137, line: 648, type: !19, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !137, line: 648, type: !337, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !137, line: 649, type: !24, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !137, line: 649, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 3)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !137, line: 650, type: !337, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !137, line: 651, type: !346, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !137, line: 651, type: !346, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !137, line: 652, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 7)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !137, line: 653, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !137, line: 654, type: !115, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !137, line: 655, type: !115, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !137, line: 656, type: !115, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !137, line: 657, type: !115, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !137, line: 663, type: !368, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !137, line: 664, type: !115, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !137, line: 669, type: !202, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !137, line: 669, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 40)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !137, line: 676, type: !125, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !137, line: 676, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 61)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !137, line: 679, type: !357, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !137, line: 683, type: !337, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !137, line: 688, type: !337, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !137, line: 691, type: !373, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !137, line: 839, type: !207, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !137, line: 840, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 22)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !137, line: 841, type: !125, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !137, line: 862, type: !24, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !137, line: 868, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 71)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !137, line: 875, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 27)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !137, line: 877, type: !44, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !137, line: 877, type: !216, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !24, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !337, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !346, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !337, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !373, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !346, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !368, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !373, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !337, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !373, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 9)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !346, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !337, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !346, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !457, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !337, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !2, line: 172, type: !373, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 615, type: !357, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !2, line: 538, type: !337, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 540, type: !19, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !2, line: 545, type: !103, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !346, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !337, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !337, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !337, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !337, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 552, type: !24, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !2, line: 552, type: !373, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 552, type: !337, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "mesg", scope: !498, file: !2, line: 232, type: !357, isLocal: true, isDefinition: true)
!498 = distinct !DISubprogram(name: "print_line", scope: !2, file: !2, line: 227, type: !499, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !188, !189, !188, !188, !188, !188, !188, !188}
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !516, !517}
!502 = !DILocalVariable(name: "user", arg: 1, scope: !498, file: !2, line: 227, type: !188)
!503 = !DILocalVariable(name: "state", arg: 2, scope: !498, file: !2, line: 227, type: !189)
!504 = !DILocalVariable(name: "line", arg: 3, scope: !498, file: !2, line: 228, type: !188)
!505 = !DILocalVariable(name: "time_str", arg: 4, scope: !498, file: !2, line: 229, type: !188)
!506 = !DILocalVariable(name: "idle", arg: 5, scope: !498, file: !2, line: 229, type: !188)
!507 = !DILocalVariable(name: "pid", arg: 6, scope: !498, file: !2, line: 229, type: !188)
!508 = !DILocalVariable(name: "comment", arg: 7, scope: !498, file: !2, line: 230, type: !188)
!509 = !DILocalVariable(name: "exitstr", arg: 8, scope: !498, file: !2, line: 230, type: !188)
!510 = !DILocalVariable(name: "buf", scope: !498, file: !2, line: 233, type: !182)
!511 = !DILocalVariable(name: "x_idle", scope: !498, file: !2, line: 234, type: !373)
!512 = !DILocalVariable(name: "x_pid", scope: !498, file: !2, line: 235, type: !513)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 13)
!516 = !DILocalVariable(name: "x_exitstr", scope: !498, file: !2, line: 236, type: !182)
!517 = !DILocalVariable(name: "p", scope: !518, file: !2, line: 282, type: !182)
!518 = distinct !DILexicalBlock(scope: !498, file: !2, line: 280, column: 3)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 241, type: !346, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !346, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !368, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 29)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !337, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !24, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "hoststr", scope: !536, file: !2, line: 319, type: !182, isLocal: true, isDefinition: true)
!536 = distinct !DISubprogram(name: "print_user", scope: !2, file: !2, line: 312, type: !537, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !567)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539, !191}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !143, line: 92, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !143, line: 65, size: 576, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !555, !559, !560, !562}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !542, file: !143, line: 69, baseType: !182, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !542, file: !143, line: 70, baseType: !182, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !542, file: !143, line: 71, baseType: !182, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !542, file: !143, line: 72, baseType: !182, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !542, file: !143, line: 74, baseType: !549, size: 128, offset: 256)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !550, line: 11, size: 128, elements: !551)
!550 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !549, file: !550, line: 16, baseType: !193, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !549, file: !550, line: 21, baseType: !554, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !194, line: 197, baseType: !195)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !542, file: !143, line: 75, baseType: !556, size: 32, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !557, line: 97, baseType: !558)
!557 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !194, line: 154, baseType: !138)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !542, file: !143, line: 76, baseType: !556, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !542, file: !143, line: 77, baseType: !561, size: 16, offset: 448)
!561 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !542, file: !143, line: 79, baseType: !563, size: 64, offset: 480)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !143, line: 79, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !563, file: !143, line: 79, baseType: !138, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !563, file: !143, line: 79, baseType: !138, size: 32, offset: 32)
!567 = !{!568, !569, !570, !599, !600, !601, !602, !603, !604, !605, !606, !609, !610, !611, !617, !618, !620}
!568 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !536, file: !2, line: 312, type: !539)
!569 = !DILocalVariable(name: "boottime", arg: 2, scope: !536, file: !2, line: 312, type: !191)
!570 = !DILocalVariable(name: "stats", scope: !536, file: !2, line: 314, type: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !572, line: 44, size: 1024, elements: !573)
!572 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!573 = !{!574, !576, !578, !580, !582, !584, !586, !587, !588, !589, !591, !592, !594, !595, !596, !597}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !571, file: !572, line: 46, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !194, line: 145, baseType: !187)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !571, file: !572, line: 47, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !194, line: 148, baseType: !187)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !571, file: !572, line: 48, baseType: !579, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !194, line: 150, baseType: !133)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !571, file: !572, line: 49, baseType: !581, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !194, line: 151, baseType: !133)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !571, file: !572, line: 50, baseType: !583, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !194, line: 146, baseType: !133)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !571, file: !572, line: 51, baseType: !585, size: 32, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !194, line: 147, baseType: !133)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !571, file: !572, line: 52, baseType: !575, size: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !571, file: !572, line: 53, baseType: !575, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !571, file: !572, line: 54, baseType: !305, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !571, file: !572, line: 55, baseType: !590, size: 32, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !194, line: 175, baseType: !138)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !571, file: !572, line: 56, baseType: !138, size: 32, offset: 480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !571, file: !572, line: 57, baseType: !593, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !194, line: 180, baseType: !195)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !571, file: !572, line: 65, baseType: !549, size: 128, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !571, file: !572, line: 66, baseType: !549, size: 128, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !571, file: !572, line: 67, baseType: !549, size: 128, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !571, file: !572, line: 79, baseType: !598, size: 64, offset: 960)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !20)
!599 = !DILocalVariable(name: "last_change", scope: !536, file: !2, line: 315, type: !191)
!600 = !DILocalVariable(name: "mesg", scope: !536, file: !2, line: 316, type: !4)
!601 = !DILocalVariable(name: "idlestr", scope: !536, file: !2, line: 317, type: !368)
!602 = !DILocalVariable(name: "pidstr", scope: !536, file: !2, line: 318, type: !216)
!603 = !DILocalVariable(name: "line", scope: !536, file: !2, line: 325, type: !182)
!604 = !DILocalVariable(name: "space", scope: !536, file: !2, line: 326, type: !182)
!605 = !DILocalVariable(name: "dirfd", scope: !536, file: !2, line: 329, type: !138)
!606 = !DILocalVariable(name: "host", scope: !607, file: !2, line: 363, type: !182)
!607 = distinct !DILexicalBlock(scope: !608, file: !2, line: 362, column: 5)
!608 = distinct !DILexicalBlock(scope: !536, file: !2, line: 361, column: 7)
!609 = !DILocalVariable(name: "display", scope: !607, file: !2, line: 364, type: !182)
!610 = !DILocalVariable(name: "ut_host", scope: !607, file: !2, line: 365, type: !182)
!611 = !DILocalVariable(name: "needed", scope: !612, file: !2, line: 383, type: !614)
!612 = distinct !DILexicalBlock(scope: !613, file: !2, line: 382, column: 9)
!613 = distinct !DILexicalBlock(scope: !607, file: !2, line: 381, column: 11)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !615, line: 130, baseType: !616)
!615 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !186, line: 35, baseType: !195)
!617 = !DILocalVariable(name: "p", scope: !612, file: !2, line: 389, type: !182)
!618 = !DILocalVariable(name: "needed", scope: !619, file: !2, line: 397, type: !614)
!619 = distinct !DILexicalBlock(scope: !613, file: !2, line: 396, column: 9)
!620 = !DILocalVariable(name: "p", scope: !619, file: !2, line: 403, type: !182)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "hostlen", scope: !536, file: !2, line: 321, type: !614, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !536, file: !2, line: 334, type: !138, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !337, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !337, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !24, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 393, type: !19, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "now", scope: !635, file: !2, line: 182, type: !191, isLocal: true, isDefinition: true)
!635 = distinct !DISubprogram(name: "idle_string", scope: !2, file: !2, line: 180, type: !636, scopeLine: 181, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!188, !191, !191}
!638 = !{!639, !640, !641}
!639 = !DILocalVariable(name: "when", arg: 1, scope: !635, file: !2, line: 180, type: !191)
!640 = !DILocalVariable(name: "boottime", arg: 2, scope: !635, file: !2, line: 180, type: !191)
!641 = !DILocalVariable(name: "seconds_idle", scope: !635, file: !2, line: 187, type: !138)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !346, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !635, file: !2, line: 196, type: !346, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !115, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 204, type: !346, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "buf", scope: !652, file: !2, line: 211, type: !673, isLocal: true, isDefinition: true)
!652 = distinct !DISubprogram(name: "time_string", scope: !2, file: !2, line: 209, type: !653, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{!188, !539}
!655 = !{!656, !657}
!656 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !652, file: !2, line: 209, type: !539)
!657 = !DILocalVariable(name: "tmp", scope: !652, file: !2, line: 212, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !660, line: 7, size: 448, elements: !661)
!660 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !659, file: !660, line: 9, baseType: !138, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !659, file: !660, line: 10, baseType: !138, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !659, file: !660, line: 11, baseType: !138, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !659, file: !660, line: 12, baseType: !138, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !659, file: !660, line: 13, baseType: !138, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !659, file: !660, line: 14, baseType: !138, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !659, file: !660, line: 15, baseType: !138, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !659, file: !660, line: 16, baseType: !138, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !659, file: !660, line: 17, baseType: !138, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !659, file: !660, line: 20, baseType: !195, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !659, file: !660, line: 21, baseType: !188, size: 64, offset: 384)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 33)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "runlevline", scope: !678, file: !2, line: 504, type: !182, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "print_runlevel", scope: !2, file: !2, line: 502, type: !679, scopeLine: 503, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !539}
!681 = !{!682, !683, !684}
!682 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !678, file: !2, line: 502, type: !539)
!683 = !DILocalVariable(name: "last", scope: !678, file: !2, line: 505, type: !190)
!684 = !DILocalVariable(name: "curr", scope: !678, file: !2, line: 506, type: !190)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "comment", scope: !678, file: !2, line: 504, type: !182, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 509, type: !115, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !2, line: 510, type: !346, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !346, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 514, type: !337, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !2, line: 428, type: !216, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 497, type: !513, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 437, type: !24, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !346, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "exitstr", scope: !705, file: !2, line: 449, type: !182, isLocal: true, isDefinition: true)
!705 = distinct !DISubprogram(name: "print_deadprocs", scope: !2, file: !2, line: 447, type: !679, scopeLine: 448, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !130, retainedNodes: !706)
!706 = !{!707, !708, !709}
!707 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !705, file: !2, line: 447, type: !539)
!708 = !DILocalVariable(name: "comment", scope: !705, file: !2, line: 450, type: !182)
!709 = !DILocalVariable(name: "pidstr", scope: !705, file: !2, line: 451, type: !216)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !346, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !346, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !115, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 4608, elements: !726)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !719, line: 50, size: 256, elements: !720)
!719 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!720 = !{!721, !722, !723, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !718, file: !719, line: 52, baseType: !188, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !718, file: !719, line: 55, baseType: !138, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !718, file: !719, line: 56, baseType: !724, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !718, file: !719, line: 57, baseType: !138, size: 32, offset: 192)
!726 = !{!727}
!727 = !DISubrange(count: 18)
!728 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!729 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!730 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!731 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!732 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!733 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!734 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!735 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!736 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!737 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!738 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!739 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!740 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!741 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!742 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !745, line: 3, type: !125, isLocal: true, isDefinition: true)
!745 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "Version", scope: !748, file: !745, line: 3, type: !188, isLocal: false, isDefinition: true)
!748 = distinct !DICompileUnit(language: DW_LANG_C11, file: !745, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !749, splitDebugInlining: false, nameTableKind: None)
!749 = !{!743, !746}
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "last_cherror", scope: !752, file: !753, line: 28, type: !138, isLocal: true, isDefinition: true)
!752 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !754, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!754 = !{!755, !750}
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "hints", scope: !757, file: !753, line: 63, type: !765, isLocal: true, isDefinition: true)
!757 = distinct !DISubprogram(name: "canon_host_r", scope: !753, file: !753, line: 61, type: !758, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !752, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{!182, !188, !724}
!760 = !{!761, !762, !763, !786, !787}
!761 = !DILocalVariable(name: "host", arg: 1, scope: !757, file: !753, line: 61, type: !188)
!762 = !DILocalVariable(name: "cherror", arg: 2, scope: !757, file: !753, line: 61, type: !724)
!763 = !DILocalVariable(name: "res", scope: !757, file: !753, line: 66, type: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !766, line: 565, size: 384, elements: !767)
!766 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!767 = !{!768, !769, !770, !771, !772, !776, !784, !785}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !765, file: !766, line: 567, baseType: !138, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !765, file: !766, line: 568, baseType: !138, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !765, file: !766, line: 569, baseType: !138, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !765, file: !766, line: 570, baseType: !138, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !765, file: !766, line: 571, baseType: !773, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !774, line: 33, baseType: !775)
!774 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !194, line: 210, baseType: !133)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !765, file: !766, line: 572, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !774, line: 180, size: 128, elements: !779)
!779 = !{!780, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !778, file: !774, line: 182, baseType: !781, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !782, line: 28, baseType: !184)
!782 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !778, file: !774, line: 183, baseType: !103, size: 112, offset: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !765, file: !766, line: 573, baseType: !182, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !765, file: !766, line: 574, baseType: !764, size: 64, offset: 320)
!786 = !DILocalVariable(name: "status", scope: !757, file: !753, line: 67, type: !138)
!787 = !DILocalVariable(name: "retval", scope: !757, file: !753, line: 69, type: !182)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "file_name", scope: !790, file: !791, line: 45, type: !188, isLocal: true, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !792, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!792 = !{!793, !795, !797, !799, !788, !801}
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !791, line: 121, type: !368, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !791, line: 121, type: !216, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !791, line: 123, type: !368, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !791, line: 126, type: !357, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !790, file: !791, line: 55, type: !196, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !805, file: !806, line: 66, type: !857, isLocal: false, isDefinition: true)
!805 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !807, globals: !808, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!807 = !{!183, !190}
!808 = !{!809, !811, !836, !838, !840, !842, !803, !844, !846, !848, !850, !855}
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !806, line: 272, type: !337, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "old_file_name", scope: !813, file: !806, line: 304, type: !188, isLocal: true, isDefinition: true)
!813 = distinct !DISubprogram(name: "verror_at_line", scope: !806, file: !806, line: 298, type: !814, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !805, retainedNodes: !829)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !138, !138, !188, !133, !188, !816}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !817, line: 52, baseType: !818)
!817 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !819, line: 14, baseType: !820)
!819 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !821, baseType: !822)
!821 = !DIFile(filename: "lib/error.c", directory: "/src")
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !823)
!823 = !{!824, !825, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !822, file: !821, baseType: !183, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !822, file: !821, baseType: !183, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !822, file: !821, baseType: !183, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !822, file: !821, baseType: !138, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !822, file: !821, baseType: !138, size: 32, offset: 224)
!829 = !{!830, !831, !832, !833, !834, !835}
!830 = !DILocalVariable(name: "status", arg: 1, scope: !813, file: !806, line: 298, type: !138)
!831 = !DILocalVariable(name: "errnum", arg: 2, scope: !813, file: !806, line: 298, type: !138)
!832 = !DILocalVariable(name: "file_name", arg: 3, scope: !813, file: !806, line: 298, type: !188)
!833 = !DILocalVariable(name: "line_number", arg: 4, scope: !813, file: !806, line: 298, type: !133)
!834 = !DILocalVariable(name: "message", arg: 5, scope: !813, file: !806, line: 298, type: !188)
!835 = !DILocalVariable(name: "args", arg: 6, scope: !813, file: !806, line: 298, type: !816)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "old_line_number", scope: !813, file: !806, line: 305, type: !133, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !806, line: 338, type: !24, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !806, line: 346, type: !373, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !806, line: 346, type: !19, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "error_message_count", scope: !805, file: !806, line: 69, type: !133, isLocal: false, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !805, file: !806, line: 295, type: !138, isLocal: false, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !806, line: 208, type: !368, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !806, line: 208, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 21)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !806, line: 214, type: !337, isLocal: true, isDefinition: true)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null}
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !862, line: 35, type: !19, isLocal: true, isDefinition: true)
!862 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !862, line: 35, type: !346, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "program_name", scope: !867, file: !868, line: 31, type: !188, isLocal: false, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C11, file: !868, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !869, globals: !870, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!869 = !{!182}
!870 = !{!865, !871, !873}
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !868, line: 46, type: !373, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !868, line: 49, type: !24, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "utf07FF", scope: !877, file: !878, line: 46, type: !905, isLocal: true, isDefinition: true)
!877 = distinct !DISubprogram(name: "proper_name_lite", scope: !878, file: !878, line: 38, type: !879, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !881, retainedNodes: !883)
!878 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!879 = !DISubroutineType(types: !880)
!880 = !{!188, !188, !188}
!881 = distinct !DICompileUnit(language: DW_LANG_C11, file: !878, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !882, splitDebugInlining: false, nameTableKind: None)
!882 = !{!875}
!883 = !{!884, !885, !886, !887, !892}
!884 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !877, file: !878, line: 38, type: !188)
!885 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !877, file: !878, line: 38, type: !188)
!886 = !DILocalVariable(name: "translation", scope: !877, file: !878, line: 40, type: !188)
!887 = !DILocalVariable(name: "w", scope: !877, file: !878, line: 47, type: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !889, line: 37, baseType: !890)
!889 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !194, line: 57, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !194, line: 42, baseType: !133)
!892 = !DILocalVariable(name: "mbs", scope: !877, file: !878, line: 48, type: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !894, line: 6, baseType: !895)
!894 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !896, line: 21, baseType: !897)
!896 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !896, line: 13, size: 64, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !897, file: !896, line: 15, baseType: !138, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !897, file: !896, line: 20, baseType: !901, size: 32, offset: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !896, line: 16, size: 32, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !901, file: !896, line: 18, baseType: !133, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !901, file: !896, line: 19, baseType: !24, size: 32)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 16, elements: !20)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !908, line: 78, type: !373, isLocal: true, isDefinition: true)
!908 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !908, line: 79, type: !346, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !908, line: 80, type: !513, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !908, line: 81, type: !513, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !908, line: 82, type: !326, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !908, line: 83, type: !19, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !908, line: 84, type: !373, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !908, line: 85, type: !368, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !908, line: 86, type: !368, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !908, line: 87, type: !373, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !929, file: !908, line: 76, type: !1001, isLocal: false, isDefinition: true)
!929 = distinct !DICompileUnit(language: DW_LANG_C11, file: !908, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !930, retainedTypes: !936, globals: !937, splitDebugInlining: false, nameTableKind: None)
!930 = !{!164, !931, !149}
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !165, line: 254, baseType: !133, size: 32, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!934 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!935 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!936 = !{!138, !184, !185}
!937 = !{!906, !909, !911, !913, !915, !917, !919, !921, !923, !925, !927, !938, !942, !952, !954, !959, !961, !963, !965, !967, !990, !997, !999}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !929, file: !908, line: 92, type: !940, isLocal: false, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 320, elements: !116)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !929, file: !908, line: 1040, type: !944, isLocal: false, isDefinition: true)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !908, line: 56, size: 448, elements: !945)
!945 = !{!946, !947, !948, !950, !951}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !944, file: !908, line: 59, baseType: !164, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !908, line: 62, baseType: !138, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !944, file: !908, line: 66, baseType: !949, size: 256, offset: 64)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !374)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !944, file: !908, line: 69, baseType: !188, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !944, file: !908, line: 72, baseType: !188, size: 64, offset: 384)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !929, file: !908, line: 107, type: !944, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "slot0", scope: !929, file: !908, line: 831, type: !956, isLocal: true, isDefinition: true)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 256)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !908, line: 321, type: !19, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !908, line: 357, type: !19, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !908, line: 358, type: !19, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !908, line: 199, type: !368, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "quote", scope: !969, file: !908, line: 228, type: !988, isLocal: true, isDefinition: true)
!969 = distinct !DISubprogram(name: "gettext_quote", scope: !908, file: !908, line: 197, type: !970, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !929, retainedNodes: !972)
!970 = !DISubroutineType(types: !971)
!971 = !{!188, !188, !164}
!972 = !{!973, !974, !975, !976, !977}
!973 = !DILocalVariable(name: "msgid", arg: 1, scope: !969, file: !908, line: 197, type: !188)
!974 = !DILocalVariable(name: "s", arg: 2, scope: !969, file: !908, line: 197, type: !164)
!975 = !DILocalVariable(name: "translation", scope: !969, file: !908, line: 199, type: !188)
!976 = !DILocalVariable(name: "w", scope: !969, file: !908, line: 229, type: !888)
!977 = !DILocalVariable(name: "mbs", scope: !969, file: !908, line: 230, type: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !894, line: 6, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !896, line: 21, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !896, line: 13, size: 64, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !980, file: !896, line: 15, baseType: !138, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !980, file: !896, line: 20, baseType: !984, size: 32, offset: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !980, file: !896, line: 16, size: 32, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !984, file: !896, line: 18, baseType: !133, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !984, file: !896, line: 19, baseType: !24, size: 32)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !989)
!989 = !{!21, !26}
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "slotvec", scope: !929, file: !908, line: 834, type: !992, isLocal: true, isDefinition: true)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !908, line: 823, size: 128, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !993, file: !908, line: 825, baseType: !185, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !993, file: !908, line: 826, baseType: !182, size: 64, offset: 64)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "nslots", scope: !929, file: !908, line: 832, type: !138, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "slotvec0", scope: !929, file: !908, line: 833, type: !993, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 704, elements: !1003)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!1003 = !{!1004}
!1004 = !DISubrange(count: 11)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 347, type: !103, isLocal: true, isDefinition: true)
!1007 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 398, type: !457, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 399, type: !19, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 446, type: !368, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !1007, line: 447, type: !110, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !1018, line: 98, type: !527, isLocal: true, isDefinition: true)
!1018 = !DIFile(filename: "./lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1018, line: 99, type: !527, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !1018, line: 100, type: !852, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !1018, line: 40, type: !513, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1018, line: 40, type: !357, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 67, type: !216, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 69, type: !368, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 83, type: !368, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 83, type: !24, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 85, type: !19, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 88, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 171)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 88, type: !1045, isLocal: true, isDefinition: true)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 34)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 105, type: !207, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 109, type: !1052, isLocal: true, isDefinition: true)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 23)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 113, type: !1057, isLocal: true, isDefinition: true)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 28)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 120, type: !84, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 127, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 36)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 134, type: !392, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 142, type: !9, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 150, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 48)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 159, type: !75, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 170, type: !14, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 248, type: !326, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 248, type: !414, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 254, type: !326, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 254, type: !103, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 254, type: !392, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 259, type: !3, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 259, type: !527, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1096, file: !1097, line: 26, type: !1099, isLocal: false, isDefinition: true)
!1096 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1097, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1098, splitDebugInlining: false, nameTableKind: None)
!1097 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1098 = !{!1094}
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 376, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 47)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1104, file: !1105, line: 24, type: !1107, isLocal: false, isDefinition: true)
!1104 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1105, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1106, splitDebugInlining: false, nameTableKind: None)
!1105 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1106 = !{!1102}
!1107 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !138)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !1110, line: 34, type: !357, isLocal: true, isDefinition: true)
!1110 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !1110, line: 34, type: !368, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !1110, line: 34, type: !202, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !1117, line: 108, type: !110, isLocal: true, isDefinition: true)
!1117 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "internal_state", scope: !1120, file: !1117, line: 97, type: !1123, isLocal: true, isDefinition: true)
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1117, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1121, globals: !1122, splitDebugInlining: false, nameTableKind: None)
!1121 = !{!183, !185, !190}
!1122 = !{!1115, !1118}
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !894, line: 6, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !896, line: 21, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !896, line: 13, size: 64, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1125, file: !896, line: 15, baseType: !138, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1125, file: !896, line: 20, baseType: !1129, size: 32, offset: 32)
!1129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1125, file: !896, line: 16, size: 32, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1129, file: !896, line: 18, baseType: !133, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1129, file: !896, line: 19, baseType: !24, size: 32)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 121, type: !357, isLocal: true, isDefinition: true)
!1135 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 124, type: !1138, isLocal: true, isDefinition: true)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 41)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1143, line: 202, type: !368, isLocal: true, isDefinition: true)
!1143 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1146, file: !1143, line: 211, type: !1330, isLocal: true, isDefinition: true)
!1146 = distinct !DISubprogram(name: "printf_fetchargs", scope: !1143, file: !1143, line: 42, type: !1147, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1321, retainedNodes: !1325)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!138, !1149, !1159}
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !819, line: 22, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1151, baseType: !1152)
!1151 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1152, file: !1151, baseType: !183, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1152, file: !1151, baseType: !183, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1152, file: !1151, baseType: !183, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1152, file: !1151, baseType: !138, size: 32, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1152, file: !1151, baseType: !138, size: 32, offset: 224)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1161, line: 185, baseType: !1162)
!1161 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1161, line: 179, size: 1920, elements: !1163)
!1163 = !{!1164, !1165, !1319}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1162, file: !1161, line: 181, baseType: !185, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1162, file: !1161, line: 182, baseType: !1166, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1161, line: 174, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1161, line: 111, size: 256, elements: !1169)
!1169 = !{!1170, !1221}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !1161, line: 113, baseType: !1171, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1161, line: 108, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1161, line: 47, baseType: !133, size: 32, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1174 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1175 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1176 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1177 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1178 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1179 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1180 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1181 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1182 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1183 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1184 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1185 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1186 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1187 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1188 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1189 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1190 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1191 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1192 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1193 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1194 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1195 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1196 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1197 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1198 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1199 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1200 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1201 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1202 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1203 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1204 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1205 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1206 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1207 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1208 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1209 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1210 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1211 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1212 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1213 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1214 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1215 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1216 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1217 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1218 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1219 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1220 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1168, file: !1161, line: 172, baseType: !1222, size: 128, offset: 128)
!1222 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1168, file: !1161, line: 114, size: 128, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1234, !1236, !1240, !1244, !1247, !1250, !1253, !1255, !1258, !1261, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1285, !1288, !1289, !1293, !1294, !1296, !1298, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1222, file: !1161, line: 116, baseType: !308, size: 8)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1222, file: !1161, line: 117, baseType: !190, size: 8)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1222, file: !1161, line: 118, baseType: !561, size: 16)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1222, file: !1161, line: 119, baseType: !184, size: 16)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1222, file: !1161, line: 120, baseType: !138, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1222, file: !1161, line: 121, baseType: !133, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1222, file: !1161, line: 122, baseType: !195, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !1222, file: !1161, line: 123, baseType: !187, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !1222, file: !1161, line: 124, baseType: !1233, size: 64)
!1233 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !1222, file: !1161, line: 125, baseType: !1235, size: 64)
!1235 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !1222, file: !1161, line: 126, baseType: !1237, size: 8)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1238, line: 24, baseType: !1239)
!1238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !194, line: 37, baseType: !308)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !1222, file: !1161, line: 127, baseType: !1241, size: 8)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1242, line: 24, baseType: !1243)
!1242 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !194, line: 38, baseType: !190)
